{
  "jobs": [
    {
      "id": "S3P73Xr1g0uhIqJZAAAAAA==",
      "title": "Senior Software Engineer – Python Developer",
      "company": "Marriott International",
      "location": "Bethesda, MD",
      "description": "Additional Information\n\nJob Number 25167379\n\nJob Category Information Technology\n\nLocation Marriott International HQ, 7750 Wisconsin Avenue, Bethesda, Maryland, United States, 20814VIEW ON MAP\n\nSchedule Full Time\n\nLocated Remotely? Y\n\nPosition Type Management\n\nPay Range: $98,400-$174,900 Annually\n\nBonus Eligible: Y\n\nExpiration Date: 10/21/2025\n\nIf you're looking to build leading technology that enables the future of global travel while transforming your career – step out of the status quo and join Global Technology at Marriott International.\n\nTHE OPPORTUNITY\n\nWe're seeking an exceptional Senior Python Developer to join our innovative 6-person team building Marriott's next-generation Internal Developer Portal. This greenfield project serves as the single pane of glass for application teams across our Fortune 500 organization, revolutionizing how we provision environments, manage access, and ship products at scale.\n\nAs a senior member of our team, you'll have significant influence on the technical direction and architecture of a platform that will transform how thousands of developers work. This is a rare opportunity to shape enterprise-scale platform engineering from the ground up.\n\nWhat You'll Do\n\nDesign and Build APIs: Create robust, scalable RESTful APIs using FastAPI and Python best practices to power our developer portal's core functionality\n\nDrive Automation: Develop Python-based automation scripts and workflows that eliminate manual processes and accelerate development velocity across the organization\n\nAI Integration: Implement cutting-edge AI integrations and intelligent features that enhance the developer experience and provide smart insights\n\nPlatform Architecture: Collaborate on architectural decisions for a platform handling environment provisioning, access management, application information, and environment management at enterprise scale\n\nCloud Infrastructure: Leverage AWS services to build resilient, performant solutions\n\nMentorship: Guide and mentor team members, sharing your expertise to elevate the entire team's capabilities\n\nCross-functional Collaboration: Work closely with frontend engineers, DevOps, and stakeholder teams to deliver end-to-end platform features\n\nInnovation: As an early team member on a new product, you'll have the freedom to experiment with new technologies and approaches\n\nWhat You Bring\n\nRequired:\n\n7+ years of software development experience with strong Python expertise\n\nProven track record building production RESTful APIs, preferably with FastAPI\n\nDeep understanding of Python best practices, design patterns, and ecosystem tools\n\nExperience with AWS services and cloud-native architecture\n\nStrong knowledge of PostgreSQL, DocumentDB/MongoDB, and Redis\n\nExcellence in writing clean, maintainable, well-tested code\n\nExperience with containerization (Docker, Kubernetes, Helm)\n\nSelf-motivated problem solver who thrives in greenfield development\n\nStrong communication skills and ability to work effectively in small, agile teams\n\nBachelor's or Master's in Computer Science or equivalent experience\n\nPreferred:\n\nPlatform engineering or developer portal experience\n\nAI/ML integration experience and familiarity with AI agent development\n\nFrontend development skills (React, Vite)\n\nInfrastructure as Code experience (Terraform)\n\nAWS certifications\n\nExperience with CI/CD pipelines and DevOps practices\n\nBackground in building tools that developers love\n\nHow We Work\n\nSmall, agile team using Kanban within a SAFe framework\n\nFlexible work arrangements - remote, hybrid, or on-site options available\n\nQuarterly travel (3-4 days) for PI Planning sessions - a great opportunity to connect with the broader team\n\nFocus on new development with some production support\n\nCulture of innovation, learning, and technical excellence\n\nWHY MARRIOTT?\n\nBeyond the opportunity to impact how a Fortune 500 company builds technology, Marriott offers:\n\nWork on technology that powers experiences for millions of travelers worldwide\n\nComprehensive benefits package\n\nGlobal travel perks and discounts at Marriott properties worldwide - perfect for those who love to travel\n\nCareer growth opportunities in a company that values internal mobility\n\nBe part of a company consistently recognized as a great place to work\n\nReady to transform how enterprise software is built while enjoying the perks of the travel industry? Join us in creating the future of developer productivity at Marriott International.\n\nAt Marriott International, we are dedicated to being an equal opportunity employer, welcoming all and providing access to opportunity. We actively foster an environment where the unique backgrounds of our associates are valued and celebrated. Our greatest strength lies in the rich blend of culture, talent, and experiences of our associates.  We are committed to non-discrimination on any protected basis, including disability, veteran status, or other basis protected by applicable law.\n\nAll positions offer a 401(k) plan, stock purchase plan, discounts at Marriott properties, commuter benefits, employee assistance plan, and childcare discounts. Benefits are subject to terms and conditions, which may include rules regarding eligibility, enrollment, waiting period, contribution, benefit limits, election changes, benefit exclusions, and others. Click here to learn more.\n\nFull-time positions also offer coverage for medical, dental, vision, health care flexible spending account, dependent care flexible spending account, life insurance, disability insurance, accident insurance, adoption expense reimbursements, paid parental leave and educational assistance.\n\nWashington Applicants Only : Employees will accrue paid sick leave, 0.077 PTO balance for every hour worked and be eligible to receive a minimum of 9 holidays annually.\n\nMarriott HQ is committed to a hybrid work environment that enables associates to Be connected. Headquarters-based positions are considered hybrid, for candidates within a commuting distance to Bethesda, MD; candidates outside of commuting distance to Bethesda, MD will be considered for Remote positions.\n\nMarriott International is the world’s largest hotel company, with more brands, more hotels and more opportunities for associates to grow and succeed. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "React",
        "AI",
        "SQL",
        "Docker",
        "Kubernetes",
        "AWS",
        "MongoDB",
        "PostgreSQL"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-17T00:00:00.000Z",
      "url": "https://www.linkedin.com/jobs/view/senior-software-engineer-%E2%80%93-python-developer-at-marriott-international-4316023478?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Python developer",
      "source": "JSearch API"
    },
    {
      "id": "bTzUv-8Qb52PoibxAAAAAA==",
      "title": "Python Developer (SAS Experience) - REMOTE",
      "company": "KATMAI",
      "location": "Washington, DC",
      "description": "Job Description:\n\nSUMMARY\n\nProvide support to the U.S. Census Bureau's Demographic Systems Division (DSD) by offering Python development services in support of DSD’s migration of survey processing systems from Statistical Analysis System (SAS) to Python.\n\nESSENTIAL DUTIES & RESPONSIBILITIES\n• Assist with the development and documentation of the rewrite of The Survey of Income and Program Participation (SIPP) production processing system into a Python codebase. The scope of the SIPP Production processing consists of 200+ edit programs. (Revamp SIPP system, named SIPP Seamless, is currently in its planning phase).\n• Support the ongoing SIPP production system and the SIPP Seamless system.\n• Assist DSD with the implementation of Python code solutions using efficient methodologies to utilize the language’s strengths.\n• Assist DSD in analyzing existing SAS-based system to glean functional requirements to develop optimized, Python-based solutions.\n• Write high quality code that is well-documented and easy to read, use, and maintain.\n• Use Python to read and reformat large datasets.\n• Improve Python code performance.\n• Attend branch meetings and share technical knowledge clearly.\n• Work with customers and subject matter experts to capture and document business needs and processes through meetings and requirements gathering.\n• Make recommendations concerning the feasibility of revising existing applications or developing new approaches to utilize resources more effectively.\n• Troubleshoot issues as needed and work with appropriate resources to resolve problems.\n• Assist DSD with developing proof-in-concepts, pilots, and alternatives analysis.\n• Provide thorough documentation based on Census Bureau and/or DSD standards. Documentation includes but is not limited to formal specifications and/or systems logical diagrams, training, and in-code documentation.\n• Participate in code and peer reviews, as well as formal walkthroughs as directed.\n• Conduct formal presentations and provide written documents outlining any issues and concerns to Census Management.\n• Utilize DSD version control system regularly to ensure all developed code is readily available to Census staff.\n• Review the existing software systems and make recommendations to improve the design.\n• Provide weekly and/or daily status reports in requested format to tasks manager or as directed.\n• Work with and train designated Census Bureau IT specialists to ensure that the system is fully understood by those designated individuals responsible for maintaining the system once released to production.\n• Maintain regular communications with team as required.\n• Complete tasks using, but not limited to, technologies such as:\n• Python related packages, tools, and products such as NumPy, Pandas, Anaconda, Jupyter Notebook, and VS code\n• SAS Software such as Advanced Base SAS, SAS Macro Language, and SAS ODS software\n• PostgreSQL Databases and related languages, tools, and products such as pgAdmin, and PL/pgSQL\n• Version control software such as Git, GitLab or GitHub\n• Linux terminal or other tools to allow for executing from the command line\n• Microsoft suite including Word, Excel, PowerPoint, SharePoint, and Teams\n• The following deliverables are required:\n• Finalized Python modules and code for performing identified, demographic edits for the SIPP survey\n• ISPB Python Programming Standards and Guidelines document\n• Regular status reports\n• Presentation and training material\n• Evaluation and recommendation for database implementation\n• Python code stored a version control software, such as SVN or GitLab\n• Maintain regular and punctual attendance.\n• Perform other duties as assigned.\n\nSUPERVISORY RESPONSIBILITIES\n\nNone.\n\nJob Requirements:\n\nMINIMUM QUALIFICATIONS\n• Bachelor’s degree in computer science or related field is preferred.\n• Five (5) to seven (7) years of related experience with backend and front-end development, relational database and developing applications or equivalent combination of experience preferred.\n• Knowledge of using GitLab or GitHub to configure pipelines for CI/CD.\n• Experience using Python to read and reformat large data files.\n• Experience improving code performance: able to profile and refactor code and find bottlenecks and overheads, preferably on production code.\n• Experience writing high quality code: well-documented and easy to read, use, maintain, and extend.\n• Experienced with Linux, able to perform basic commands as an end user.\n• Experience with data validation in a statistical processing environment.\n• Familiarity with SAS code.\n• Familiarity with database designs that balance usability with functionality.\n• Must pass the Census Bureau Security Investigation / background investigation.\n• Must obtain and maintain any necessary security access and/or background checks.\n\nDESIRED QUALIFICATIONS & SKILLS\n• Cloud computing, preferably with Amazon Web Service is a plus.\n• Statistical Analysis System (SAS) programming experience is a plus.\n• Excellent verbal and written communication skills.\n\nWORK SCHEDULE\n\nFull-time. May be required to work additional hours as needed to complete assignment or project.\n\nTRAVEL\n\nNone.\n\nDRIVING REQUIREMENTS\n\nNone.\n\nWORK ENVIRONMENT\n\nWork is expected to be remote; however, the company reserves the right to require onsite work.\n\nPHYSICAL DEMANDS\n\nPosition consists of sitting for long periods of time, using hands/ fingers, handling, reaching with hands and arms, speaking, or translating. Periods of walking, standing, bending, kneeling, stooping, crouching, and lifting equipment weighing up to 10 pounds. Moderate to extended periods of office work with heavy periods of computer usage. It is Katmai’s business philosophy and practice to provide reasonable accommodations, according to applicable state and federal laws, to all qualified individuals with physical or mental disabilities.\n\nCOMPENSATION & BENEFITS PACKAGE\n• Pay range: $145k to $150k per year.\n• Eligible Benefits: Medical, Dental, Vision, Life & AD&D Insurance, Long-Term & Short-Term Disability Insurance, 401(k) Savings Plan, Employee Assistance Program (EAP), Paid Time Off (PTO), 11 Paid Federal Holidays, and Leave of Absence.\n\nCompliance:\n\nTo be considered for this position, all applicants must apply on the company website, https://katmaicorp.com/life-at-katmai/\n\nWe are a VEVRAA Federal Contractor\n\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity or national origin, disability status, protected veteran status, marital status, familial status or any other characteristic protected by law. https://katmaicorp.com/life-at-katmai/#equal_opportunity Preference will be given to Ouzinkie Shareholders, Descendants of Shareholders and Spouses of Shareholders in accordance with Title 43 U.S. Code 1626(g) and Title 42 U.S. Code 2000e - 2(i).",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "AI",
        "SQL",
        "Git",
        "AWS",
        "PostgreSQL"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": null,
      "url": "https://www.indeed.com/viewjob?jk=54911db3e75a34eb&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Python developer",
      "source": "JSearch API"
    },
    {
      "id": "AOJN1-8KZAD75XALAAAAAA==",
      "title": "Python AI/ML Developer",
      "company": "Mindlance",
      "location": "Washington, DC",
      "description": "Mindlance is seeking a skilled and motivated Python AI/ML Developer with hands-on experience in Generative AI. In this role, you’ll be responsible for developing, deploying, and optimizing generative applications.\n\nResponsibilities\n• Design, develop, and maintain Python-based applications and microservices.\n• Integrate large language models (LLMs) and multimodal generative models into production pipelines.\n• Work with APIs and frameworks like Azure OpenAI, LangChain, LangGraph etc.\n• Hands-on expertise with LLMs, RAG, vector databases, embeddings, and orchestration frameworks (e.g., LangChain, LangGraph, Semantic Kernel).\n• Collaborate with cross-functional teams to define requirements and deliver high-impact solutions.\n• Stay up to date with the latest research and advancements in generative AI.\n\nSkills\n• 5-7 years of professional Python development experience.\n• Experience deploying models via APIs, Flask/FastAPI, or other web frameworks.\n• Strong understanding of data structures, algorithms, and software architecture.\n• Familiarity with cloud platforms (AWS, GCP, Azure) and model hosting services.\n• Experience with Git, Docker, CI/CD pipelines.\n\nCompany Overview\n• Mindlance is a Staffing and Recruiting company which provides multi-vertical staffing services It was founded in 1999, and is headquartered in Union, New Jersey, USA, with a workforce of 1001-5000 employees. Its website is http://www.mindlance.com.\n\nCompany H1B Sponsorship\n• Mindlance has a track record of offering H1B sponsorships, with 37 in 2025, 53 in 2024, 37 in 2023, 72 in 2022, 36 in 2021, 40 in 2020. Please note that this does not guarantee sponsorship for this specific role.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "Flask",
        "AI",
        "Git",
        "Docker",
        "AWS",
        "Azure",
        "GCP"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-14T00:00:00.000Z",
      "url": "https://jobright.ai/jobs/info/68eea001d078b81ad160cc95?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Python developer",
      "source": "JSearch API"
    },
    {
      "id": "UHBVi6HHWXTCQpYkAAAAAA==",
      "title": "Full Stack Developer Specialist (GenAI, Angular, Python, Microservices)",
      "company": "Jobs via Dice",
      "location": "McLean, VA",
      "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, eSolutionsFirst, LLC, is seeking the following. Apply via Dice today!\n\nFull Stack Developer Specialist (GenAI, Angular, Python, Microservices)\n\n6 Months contract Extension\n\nMcLean , VA On-site M-F; In Person Interview required; Needed locals\n\nMust Have Qualifications:\n• Angular, Python, and microservices architecture.\n\nPosition Summary:\n• We are seeking a highly experienced hands-on Full Stack Engineer to design and development of cutting-edge AI Agents, Agentic Workflows, and Gen AI Applications that solve complex business problems.\n• This role requires advanced proficiency in Angular for front-end development and Python-based microservices for the orchestration layer deployed to AWS EKS (Kubernetes).\n• You will serve as a hands-on engineer, working alongside Gen AI scientists, UX designers, product managers, and data engineers to shape and implement enterprise-grade Gen AI solutions.\n\nKey Responsibilities:\n• Architect and implement scalable Full Stack AI Agents, Agentic Workflows, and Gen AI applications to address diverse and complex business use cases.\n• Develop, optimize, and maintain the front-end using Angular, ensuring a seamless user experience.\n• Design and deploy Python-based microservices for robust orchestration and integration with AI models.\n• Collaborate with Gen AI scientists to integrate machine learning models such as LLMs, RAG, and multi-modal AI into the application architecture.\n• Implement solutions leveraging modern design patterns and best practices for full stack development.\n• Build and maintain RESTful APIs to enable seamless communication between the front end and back end.\n• Collaborate with cross-functional teams of UI/UX designers, data engineers, and Gen AI scientists to build full-stack Gen AI experiences.\n• Integrate Gen AI solutions with enterprise platforms via API-based methods and standardized patterns.\n• Establish and enforce validation procedures with Evaluation Frameworks, bias mitigation, safety protocols, and guardrails for production-ready deployment.\n\nRequired Qualifications:\n• Bachelor's or Master's degree in Computer Science, Computer Engineering, or a related field.\n• 10+ years of experience in full stack development, with 3+ years in applied Gen AI or LLM-based solutions.\n• Deep expertise in Angular, Python, and microservices architecture.\n• Proven experience with cloud-native development, particularly AWS services.\n• Strong programming skills and familiarity with AI/ML libraries and frameworks.\n• Demonstrated ability to work in cross-functional agile teams.\n• Please provide GitHub link for candidate's code repository. Also, please vet the candidate thoroughly for technical skills.\n\nPreferred Qualifications:\n• Experience in AI-powered application development.\n• Familiarity with CI/CD practices for DevOps and scalable deployment.\n• Hands-on experience with enterprise AI governance and ethical deployment frameworks.\n• Contributions to open-source projects or publications in software development domains.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "Angular",
        "Machine Learning",
        "AI",
        "Git",
        "Kubernetes",
        "AWS"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-18T01:00:00.000Z",
      "url": "https://www.linkedin.com/jobs/view/full-stack-developer-specialist-genai-angular-python-microservices-at-jobs-via-dice-4315788383?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Python developer",
      "source": "JSearch API"
    },
    {
      "id": "Cw008QMU5zEl0f2KAAAAAA==",
      "title": "Developer - Python (Django) Developer",
      "company": "Progression Inc",
      "location": "Bethesda, MD",
      "description": "Python Developer (Full Stack) Bethesda, MD MUST: Public Trust Eligible 3+ years of software engineers building consumer web applications or services 3+ years expert in Python (Django) and responsive front-end design (Bootstrap, Foundation, etc.) 3+ years experience with version control systems (git) and cloud-based services (AWS, Linode, etc.) 3+ years experience with JavaScript, jQuery and Backbone.js Proficiency with databases Oracle, MySQL, SQL Server (MSSQL) Unix/Linux experience Knowledge of deployment frameworks Experience with scripting, scheduling jobs etc.\nExperience working on Government contracts Skills in Ruby, Perl, and ColdFusion Experience with responsive design Experience with Java Experience with Django CMS or Ruby on Rails Experience with JavaScript frameworks (Grunt, Angular) Self-motivated and accountable Strong communication skills (verbal and written) Bachelor's degree in engineering, Computer Science or a related field DUTIES: Migrate legacy applications to python Analyze legacy applications code and Learn the legacy applications' functionalities Maintain existing applications, and provide support to users Design new applications independently and/or work architect Provide vision for new applications from functionalities, to front end UI design Interact with end users, and Government Lead, managers to understand new application' requirements and support needs Reverse engineer the legacy application if necessary Use customers' systems to maintain code *Progression Inc.\nis an affirmative action/equal opportunity employer.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, status as a protected veteran, or status as an individual with a disability.* #INDPRO",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "JavaScript",
        "Java",
        "Ruby",
        "Go",
        "Rust",
        "Angular",
        "Django",
        "AI",
        "SQL",
        "Git",
        "AWS"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-13T00:00:00.000Z",
      "url": "https://www.careerbuilder.com/job/J3V5G86PD7RX2YTT4VW?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Python developer",
      "source": "JSearch API"
    },
    {
      "id": "_mkTO-hYUblzDgn1AAAAAA==",
      "title": "Python Developer, Mid",
      "company": "Booz Allen",
      "location": "Arlington, VA",
      "description": "Python Developer, Mid\n\nThe Opportunity:\n\nYou will enable faster, more efficient execution of advanced Air Force modeling and simulation (M&S) scenarios by containerizing legacy tools, integrating disparate model frameworks, and accelerating adjudication workflows. This role is focused on technical problem solving, system navigation, and environment integration — not traditional software development.\n\nYou’ll support operational analysts, wargaming teams, and decision-makers by injecting modern Python-driven capabilities into legacy or stovepiped systems. You will work with existing non-Python models and applications to enhance interoperability, performance, and usability — pushing toward a modular, scalable, and rapid-turnaround M&S infrastructure.\n\nJoin us. The world can’t wait.\n\nYou Have:\n• 3+ years of experience with Python, including containerization, scripting, automation, and tool integration\n• Experience containerizing applications and models, such as Docker, Podman, or Singularity, and managing runtime environments\n• Ability to translate non-Python codebases, such as C++, MATLAB, or Java, into Python for integration or augmentation\n• Ability to navigate and modify existing codebases and environments\n• Ability to work outside rigid Agile or Waterfall structures while focusing on mission-driven outcomes\n• Ability to work in classified or restricted-access computing environments\n• Top Secret clearance\n• Bachelor's degree in a Science, Technology, Engineering, or Mathematics field\n\nNice If You Have:\n• Experience working with modeling frameworks, such as AFSIM, NGTS, STORM, JICM, or similar DoD simulation tools\n\nClearance:\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; Top Secret clearance is required.\n\nCompensation\n\nAt Booz Allen, we celebrate your contributions, provide you with opportunities and choices, and support your total well-being. Our offerings include health, life, disability, financial, and retirement benefits, as well as paid leave, professional development, tuition assistance, work-life programs, and dependent care. Our recognition awards program acknowledges employees for exceptional performance and superior demonstration of our values. Full-time and part-time employees working at least 20 hours a week on a regular basis are eligible to participate in Booz Allen’s benefit programs. Individuals that do not meet the threshold are only eligible for select offerings, not inclusive of health benefits. We encourage you to learn more about our total benefits by visiting the Resource page on our Careers site and reviewing Our Employee Benefits page.\n\nSalary at Booz Allen is determined by various factors, including but not limited to location, the individual’s particular combination of education, knowledge, skills, competencies, and experience, as well as contract-specific affordability and organizational requirements. The projected compensation range for this position is $69,400.00 to $158,000.00 (annualized USD). The estimate displayed represents the typical salary range for this position and is just one component of Booz Allen’s total compensation package for employees. This posting will close within 90 days from the Posting Date.\n\nIdentity Statement\n\nAs part of the application process, you are expected to be on camera during interviews and assessments. We reserve the right to take your picture to verify your identity and prevent fraud.\n\nWork Model\nOur people-first culture prioritizes the benefits of flexibility and collaboration, whether that happens in person or remotely.\n• If this position is listed as remote or hybrid, you’ll periodically work from a Booz Allen or client site facility.\n• If this position is listed as onsite, you’ll work with colleagues and clients in person, as needed for the specific role.\n\nCommitment to Non-Discrimination\n\nAll qualified applicants will receive consideration for employment without regard to disability, status as a protected veteran or any other status protected by applicable federal, state, local, or international law.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Java",
        "C++",
        "AI",
        "Docker"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": null,
      "url": "https://www.indeed.com/viewjob?jk=b98faafe8e8f0f46&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Python developer",
      "source": "JSearch API"
    },
    {
      "id": "P2-2vPIvfTV3IVz2AAAAAA==",
      "title": "Python Developer (Full Stack)",
      "company": "Futrend Technology, Inc.",
      "location": "Bethesda, MD",
      "description": "Futrend Technology, Inc. is an innovative business and technology solutions provider. Our primary focus and core competencies are in Healthcare IT, Federal Financial Management, and Grants Management. We excel at providing customers with high-value solutions that support their missions and meet their most critical objectives and business needs. We provide full life-cycle IT services to Federal agencies with recognized excellence in complex real-time system integration and enterprise-wide system implementation.\n\nDescription:\n\nFutrend Technology is looking for a Sr Python Developer to join our team of industry leading professionals with significant upward promotion probability.\n\nRoles and Responsibilities:\n• Migrate legacy applications to python\n• Analyze legacy applications code and Learn the legacy applications’ functionalities\n• Maintain existing applications, and provide support to users\n• Design new applications independently and/or work architect\n• Provide vision for new applications from functionalities, to front end UI design\n• Interact with end users, and Government Lead, managers to understand new application’ requirements and support needs\n• Reverse engineer the legacy application if necessary\n• Use customers’ systems to maintain code\n\nQualifications\nRequired\n• Bachelor’s degree in engineering, Computer Science or a related field\n• 5+ years of engineering experience with a proven track record of building consumer web applications or services\n• Expert in Python (Django) and responsive front-end design (Bootstrap, Foundation, etc.)\n• Experience with version control systems (git) and cloud-based services (AWS, Linode, etc.)\n• Self-motivated and accountable\n• Strong communication skills (verbal and written)\n• Experience with JavaScript, jQuery and Backbone.js\n• Proficiency with databases Oracle, MySQL, SQL Server (MSSQL)\n• High attention to detail to maintain design integrity throughout the build process\n• Excellent communication and problem-solving skills\n• Ability to clearly and professionally interact with clients\n• Unix/Linux experience\n• Knowledge of deployment frameworks\n• Experience with scripting, scheduling jobs etc.\n\nPreferred experience\n• Experience working on Government contracts\n• Skills in Ruby, Perl, and ColdFusion\n• Experience with responsive design\n• Experience with Java\n• Experience with Django CMS or Ruby on Rails\n• Experience with JavaScript frameworks (Grunt, Angular)\n\nLocation: NIH campus in Bethesda MD, Rockville MD\n\nFutrend Technology, Inc. is an Equal Opportunity Employer. All qualified applicants receive consideration for employment without regard to race, religion, color, national origin, gender, sexual orientation, gender identity, age, status as a protected veteran, or status as a qualified individual with a disability.\n\nFutrend Technology, Inc. uses E-Verify to validate all new hires' ability to legally work in the United States\n\nFutrend Technology, Inc. uses E-Verify to validate all new hires' ability to legally work in the United States\n\nFutrend is a VEEVRA Federal Contractor",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "JavaScript",
        "Java",
        "Ruby",
        "Go",
        "Angular",
        "Django",
        "AI",
        "SQL",
        "Git",
        "AWS"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": null,
      "url": "https://www.indeed.com/viewjob?jk=a71d6549ecb4368b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Python developer",
      "source": "JSearch API"
    },
    {
      "id": "DlPgV25Th_tDIOCCAAAAAA==",
      "title": "Python Developer with Java & Testing-5",
      "company": "Realign LLC",
      "location": "McLean, VA",
      "description": "Job Type: Contract\n\nJob Category: IT\n\nJob Title: Python Developer with Java & Testing\nLocation: McLean, VA (Onsite interview required – Face-to-Face)\nJob Type: Full-Time / Contract (specify based on need)\n\nJob Description: We are seeking a skilled and motivated Python Developer with a strong background in Java and software testing to join our team in McLean, VA. The ideal candidate will be responsible for developing robust applications, contributing to backend services, and participating in comprehensive testing efforts to ensure software quality.\n\nKey Responsibilities:\n\nDesign, develop, and maintain applications using Python and Java.\n\nWrite efficient, reusable, and testable code for backend services.\n\nDevelop and execute unit, integration, and functional tests.\n\nCollaborate with cross-functional teams including QA, DevOps, and product managers.\n\nTroubleshoot and resolve issues across development, test, and production environments.\n\nParticipate in code reviews and adhere to best development practices.\n\nContribute to continuous integration and continuous deployment (CI/CD) processes.\n\nRequired Skills\n\nJAVA / API\n\nJAVA ARCHITECT WITH AZURE\n\nJAVA DEVELOPER WITH AWS",
      "job_type": "Contractor",
      "required_skills": [
        "Python",
        "Java",
        "Go",
        "AI",
        "AWS",
        "Azure"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-10T00:00:00.000Z",
      "url": "https://www.indeed.com/viewjob?jk=dffd715be18af849&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Python developer",
      "source": "JSearch API"
    },
    {
      "id": "TZo2PEjyAjoL-wJJAAAAAA==",
      "title": "Python Fullstack Developer( Python ,Angular and AWS)",
      "company": "Pyramid Consulting, Inc",
      "location": "McLean, VA",
      "description": "Immediate need for a talented Python Fullstack Developer( Python ,Angular and AWS). This is a 06 months contract opportunity with long-term potential and is located in Mclean, VA(Hybrid). Please review the job description below and contact me ASAP if you are interested.\n\nJob ID: 25-89100\n\nPay Range: $60 - $65/hour. Employee benefits include, but are not limited to, health insurance (medical, dental, vision), 401(k) plan, and paid sick leave (depending on work location).\n\nKey Responsibilities:\n• Develop and maintain scalable backend services using Python and AWS (Lambda, Glue, DynamoDB, SQS).\n• Collaborate with cross-functional teams to design and implement enhanced monitoring and vulnerability remediation for Expense Management systems.\n• Lead and support migration projects, including Gen3 migration and OTEL instrumentation.\n• Build and maintain front-end components using Angular, JavaScript, TypeScript, and CSS.\n• Contribute to the full software development lifecycle: design, development, testing, deployment, and support.\n• Participate in code reviews, mentoring, and knowledge sharing within the team.\n• Adapt to evolving business needs and technical challenges in both Expense Management and Lending domains.\n\nKey Requirements and Technology Experience:\n• Key Skills; Python, AWS , Angular , Javascript / Typescript\n• Strong proficiency in Python development.\n• Hands-on experience with AWS services, including Lambda, Glue, DynamoDB (DDB), and SQS.\n• Solid front-end development skills with Angular, JavaScript, TypeScript, and CSS.\n• Familiarity with cloud migration processes and monitoring solutions.\n• Experience working in agile development environments.\n• Ability to work independently and collaboratively in a fast-paced, capacity-constrained setting.\n• Strong problem-solving and communication skills.\n• Previous experience in financial services or lending platforms.\n• Knowledge of OpenTelemetry (OTEL) or similar monitoring frameworks.\n• Exposure to vulnerability management and security best practices.\n\nOur client is a leading Financial Industry, and we are currently interviewing to fill this and other similar contract positions. If you are interested in this position, please apply online for immediate consideration.\n\nPyramid Consulting, Inc. provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\n\nBy applying to our jobs you agree to receive calls, AI-generated calls, text messages, or emails from Pyramid Consulting, Inc. and its affiliates, and contracted partners. Frequency varies for text messages. Message and data rates may apply. Carriers are not liable for delayed or undelivered messages. You can reply STOP to cancel and HELP for help. You can access our privacy policy here.",
      "job_type": "Contractor",
      "required_skills": [
        "Python",
        "JavaScript",
        "Java",
        "Angular",
        "AI",
        "AWS",
        "CSS"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-14T00:00:00.000Z",
      "url": "https://www.linkedin.com/jobs/view/python-fullstack-developer-python-angular-and-aws-at-pyramid-consulting-inc-4314821875?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Python developer",
      "source": "JSearch API"
    },
    {
      "id": "HRUHx_84jEqcw5fzAAAAAA==",
      "title": "Python Developer – Test Suites",
      "company": "Infomatics Corp",
      "location": "Bethesda, MD",
      "description": "About the Role\n\nWe are seeking a Python Developer with strong experience in building and maintaining automated test suites to join our engineering team in Bethesda, MD. The ideal candidate will work closely with QA engineers, DevOps, and product teams to design robust test frameworks, validate software quality, and ensure seamless releases.\n\nResponsibilities\n• Design, implement, and maintain automated test frameworks and test cases using Python.\n• Develop unit, integration, regression, and system-level tests for web applications, APIs, and backend services.\n• Collaborate with developers and QA engineers to identify test requirements and improve coverage.\n• Integrate test suites into CI/CD pipelines (e.g., Jenkins, GitHub Actions, GitLab CI).\n• Debug test failures, analyze logs, and report detailed findings.\n• Contribute to test strategies and documentation to ensure reliability and scalability.\n• Stay up to date with best practices in test automation and software quality assurance.\n\nQualifications\n\nRequired:\n• Bachelor’s degree in Computer Science, Engineering, or related field (or equivalent experience).\n• Strong proficiency in Python (5+ years).\n• Hands-on experience with pytest, unittest, or Robot Framework.\n• Familiarity with API testing (REST, GraphQL) and tools such as Postman or curl.\n• Experience with CI/CD tools (Jenkins, GitLab, CircleCI, etc.).\n• Knowledge of Git and version control best practices.\n• Strong debugging and problem-solving skills.\n\nPreferred:\n• Experience with Selenium or Playwright for UI testing.\n• Knowledge of Docker, Kubernetes, or cloud platforms (AWS, Azure, GCP).\n• Exposure to performance testing tools (Locust, JMeter).\n• Familiarity with Agile/Scrum methodologies.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "AI",
        "Git",
        "Docker",
        "Kubernetes",
        "AWS",
        "Azure",
        "GCP",
        "GraphQL"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-09-19T00:00:00.000Z",
      "url": "https://www.linkedin.com/jobs/view/python-developer-%E2%80%93-test-suites-at-infomatics-corp-4302773198?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Python developer",
      "source": "JSearch API"
    },
    {
      "id": "voCJvnl-ZL9ecgblAAAAAA==",
      "title": "Data Scientist, Mid level",
      "company": "Planet Technologies",
      "location": "Washington, DC",
      "description": "Planet Technologies, the Nation’s leading Microsoft services provider to the public sector, is looking for a highly motivated individual to join our growing team as  Mid level Data Scientist . In this role, you will be supporting impactful projects that make a difference for our country.\n\nResponsibilities\n• Builds, maintains, and improves dashboards, applications, and automations.\n• Connects to APIs, system-to-system connections, and manual data transfers for ETL.\n• Builds predictive risk models using statistical analysis.\n• Applies AI/ML to extract insights from unstructured documentation.\n• Develops and carries out full-service data calls, including data normalization and visualization.\n• Creates business intelligence analysis and visualizations for management.\n• Improves methodologies and tools for risk assessment.\n• Researches and recommends business data storage/integration solutions.\n• Develops user guides and documentation for BI products.\n• Incorporates data science tools (SQL, R, Python, etc.) into services.\n\nQualifications\n• Strong proficiency with Power Platform, SharePoint, and InfoPath required.\n• Excellent understanding of machine learning techniques and algorithms.\n• Experience with common data science toolkits (R, Weka, NumPy, MATLAB, etc.) and BI tools (Power BI, Anaconda, SPSS).\n• Experience connecting to and manipulating data from federal systems preferred.\n• In absence of years of experience, certifications or past work may be used.\n• Ability to work on site 5 days per week\n• Ability to hold and maintain a Top-Secret level clearance\n• #CJ\n\nPlanet Technologies is the leading provider of Microsoft Consulting Services to public sector and commercial organizations. Planet has significant experience in deploying business intelligence, cloud services, unified communications, and systems management with an emphasis building, deploying, and managing custom solutions that transform the business operations of federal government agencies.\n\nPlanet Technologies does not discriminate in employment opportunities, terms and conditions of employment, or practices. All qualified applicants will receive consideration for employment without regard to race, age, gender, religious or political beliefs, national origin or heritage, disability, sexual orientation, protected veteran status, or any characteristic protected by law. Federal Agency Clearance Requirements may require up to a 10-year background investigation - US Citizenship (clearable) is required.\n\nSalaries for Data Scientist, Mid at Planet Technologies range from $125,000 and $200,000. Several factors will impact final pay offered to a successful candidate including but not limited to the type and years of experience within the job, clearance level, the type of years and experience within the industry, education, training, etc.\n\nVisit  www.go-planet.com  to learn more about us. Details about our benefits can be found here  Planet Technologies Benefit Guide 2025-2026\n\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "Machine Learning",
        "AI",
        "SQL"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-15T00:00:00.000Z",
      "url": "https://www.linkedin.com/jobs/view/data-scientist-mid-level-at-planet-technologies-4312413851?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "AHeke2HyX2lXQZyWAAAAAA==",
      "title": "Senior Data Scientist - Arlington, VA",
      "company": "Serco North America",
      "location": "Arlington, VA",
      "description": "Position Description :\n\nAs a Senior Data Scientist, you will support our Maritime Engineering, Technology & Sustainment (METS) Business Unit which is responsible for industry-leading capabilities in naval ship and submarine design, systems and engineering services, and production support, logistics and in-service sustainment.\n\nThis position is contingent upon your ability to obtain/maintain/transfer an active DoD Secret security clearance.\n\nHybrid opportunity in the National Capital Region/Washington, DC.\n\nThis position complements Serco’s other engineering capabilities in shipboard, shore and systems installation and upgrade services to the Navy. You will join a team that is responsible for a multitude of various design efforts using software development tools which will include different US Navy Programs and contracts, as well as commercial vessels and systems. In your role, you will be utilizing a variety of different tools and software programs possibly involving disparate databases and software applications. You will also assist in the preparation of reports to describe your analysis and design efforts and being responsible for summarizing results for customers and higher authorities.\n\nThis is an exciting hybrid opportunity to join a highly engaged and collaborative engineering team.\n\nIn this role, you will:\n• Perform ETL (Extract, Transform, Load) operations on multiple data sources and data types across multiple types of databases with various access controls. Data types include text documents, text documents with figures and plots, drawings in different formats, e.g., MS Office (Word, PowerPoint, Excel, Visio) and PDFs (documents, drawings).\n• The documents are related to USN Requirements which are managed in IBM DOORS NextGen.\n• Develop and apply natural language processing (NLP), machine learning, and potentially Large Language Models (LLMs), e.g., GPT, RAG, BERT, to documents and data.\n\nMeet your Recruiter:\n\nQualifications:\n\nTo be successful in this role, you will have:\n• A United States citizenship and able to obtain a DoD Secret security clearance.\n• A Bachelor of Science in Data Science or equivalent degree from an accredited university.\n• At least 5 years of industry experience spanning:\n• Extract, Transform, Load (ETL) operations on multiple types of databases and data categories; experience with Sharepoint, MS 365, SQL, and Power Platform.\n• Experience developing and applying natural language processing tools and machine learning tools to find, parse, and extract patterns or targeted data sets.\n• Knowledge of some or all of these Python libraries/frameworks: nltk, spacy, pandas, scikit-learn, seaborn, NumPy, scikit-learn, matplotlib, PyTorch, Stanford Core NLP.\n• To be self-motivated with a strong work initiative and attention to detail.\n• A strong customer service, critical thinking, and problem-solving skills.\n• To be able to work and collaborate with multiple engineering disciplines across multiple disciplines and basic understanding of physical systems technical requirements.\n• To be proficient in programming languages (one of the following): SQL, R, or Python.\n• The ability to work independently, spot opportunities to streamline tasks, and make recommendations.\n• To be skilled at presenting findings to both technical and non-technical audiences.\n• The ability to travel 10%.\n\nAdditional desired experience and skills:\n• Active Secret Clearance.\n• Master’s degree in data science or equivalent from an accredited University.\n• Development and application of APIs including REST across multiple types of databases and data types.\n• Programming Languages: Python, Java, C++.\n• Development of macros in Excel and Word.\n• Ability to create clear and compelling data visualizations using tools like MATLAB, Tableau, Power BI, or Plotly.\n• Develop or use APIs (e.g., REST) across multiple heterogeneous database types and data categories.\n• Experience with data mining and use of Graph databases (e.g.,Neo4j, MarkLogic).\n• Experience with IBM DOORS NextGen and developing scripts for DOORS NextGen/use of DOORS NextGen API and Dassault’s Cameo Systems Modeler.\n• Experience working within an Agile (Kanban, Scrum) environment.\n• Experience with SySML or UML and JavaScript.\n\nIf you are interested in supporting and working with our military and sailors and a passionate Serco team - then submit your application now for immediate consideration. It only takes a few minutes and could change your career!\n\nIn compliance with state and local laws regarding pay transparency, the salary for this role is $97,787.27 to $162,978.79, however, Serco considers several factors when extending an offer, including but not limited to, the role and associated responsibilities, a candidate's work experience, education/training, and key skills.\nCompany Overview :\n\nSerco Inc. (Serco) is the Americas division of Serco Group, plc. In North America, Serco’s 9,000+ employees strive to make an impact every day across 100+ sites in the areas of Defense, Citizen Services, and Transportation. We help our clients deliver vital services more efficiently while increasing the satisfaction of their end customers. Serco serves every branch of the U.S. military, numerous U.S. Federal civilian agencies, the Intelligence Community, the Canadian government, state, provincial and local governments, and commercial clients. While your place may look a little different depending on your role, we know you will find yours here. Wherever you work and whatever you do, we invite you to discover your place in our world. Serco is a place you can count on and where you can make an impact because every contribution matters.\n\nTo review Serco benefits please visit: https://www.serco.com/na/careers/benefits-of-choosing-serco. If you require an accommodation with the application process please email: careers@serco-na.com or call the HR Service Desk at 800-628-6458, option 1. Please note, due to EEOC/OFCCP compliance, Serco is unable to accept resumes by email.\n\nCandidates may be asked to present proof of identify during the selection process. If requested, this will require presentation of a government-issued I.D. (with photo) with name and address that match the information entered on the application. Serco will not take possession of or retain/store the information provided as proof of identity. For more information on how Serco uses your information, please see our Applicant Privacy Policy and Notice.\n\nSerco does not accept unsolicited resumes through or from search firms or staffing agencies without being a contracted approved vendor. All unsolicited resumes will be considered the property of Serco and will not be obligated to pay a placement or contract fee. If you are interested in becoming an approved vendor at Serco, please email Agencies@serco-na.com.\n\nSerco is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "JavaScript",
        "Java",
        "C++",
        "Go",
        "Machine Learning",
        "AI",
        "SQL",
        "AWS"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-14T00:00:00.000Z",
      "url": "https://www.indeed.com/viewjob?jk=6eeef2c51245aceb&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "sVN7GdaK9dPIWhrtAAAAAA==",
      "title": "Sr. Data Scientist, CRM",
      "company": "General Motors",
      "location": "Washington, DC",
      "description": "This role is categorized as hybrid. This means the successful candidate is expected to report to Warren, MI or Austin, TX three times per week, at minimum [or other frequency dictated by the business if more than 3 days].\n\nThe Role\n\nThe Marketing Applied Sciences team is responsible for developing analytics-driven solutions to help GM Marketing Organizations achieve their business goals. The Senior Data Scientist will work as part of this multi-disciplinary team that will be driving solution design, development, and deployment of analytic models in support of marketing strategies. They are knowledgeable in methodology and practice of marketing analytics with an emphasis on inferential and prescriptive methods. This individual has experience with website, email, and media measurement.\n\nThis person will work closely with teammates in Marketing Applied Sciences and stakeholders in GM’s Marketing organization to ensure objective performance evaluation and optimization of media strategy. This senior data scientist will assist in the research and development of advanced marketing models, drawing insights, and creating scalable products across owned & paid channels. They will be part of a team focused on delivering future-focused, consumer-centric, prescriptive solutions that allow GM to stay proactive and nimble in our exciting transition to EVs\n\nWhat You'll Do\n• Work on a diverse, cross-functional team (technical and non-technical) to help implement high-impact, data-driven solutions to address business challenges in the vehicle brand marketing teams, ensuring that project deliverables fulfill business needs and timing.  \n• Possess contextual business knowledge and functional domain expertise in the advertising and media space as well as familiarity with marketing media measurement techniques including site/clickstream measurement, A/B testing, and various industry measurement media platforms.  \n• Partner with CRM, Marketing, and Data Science teams to design and execute advanced measurement frameworks that evaluate campaign effectiveness, incremental revenue impact, and consumer engagement across lifecycle stages.\n• Apply advanced data-driven modeling techniques to inform decision making and solve complex business problems: preprocessing multisource data; and presenting complex information using data visualization techniques.  \n• Demonstrate an ability for using data, analytics, and insights driving business-impact.  \n• Exhibit a perspective of constrained curiosity, asking why, and suggesting experimentation to drive incremental impact.  \n• Effectively communicate through telling a succinct, data-driven story in any forum, tailoring delivery to a wide range of stakeholder levels from analyst to senior executive.  \n• Apply advanced modeling and analytics techniques to optimize campaign targeting, channel strategy, and customer journey orchestration.\n\nYour Skills & Abilities (Required Qualifications)\n• 5+ years of experience as a data Scientist or in a related role, developing, deploying, and monitoring performance of large analytic data sets and machine learning based models \n• 2+ years of experience working with CRM, marketing analytics, or lifecycle management.\n• Expertise with fundamental statistical concepts and considerations for selecting an appropriate modeling technique. \n• Expertise with statistical concepts and methods for campaign measurement, including uplift/net lift modeling, treatment/control designs, and causal inference.\n• Proficient writing Python/R (modeling) and SQL/Spark (data), working with Pandas, StatsModels, PYMC, TensorFlow, Pytorch, Spark/ML, sklearn, numpy and related packages.  \n• Ability to prioritize and manage multiple tasks and projects at once without sacrificing quality.  \n\nWhat Can Give You a Competitive Advantage (Preferred Qualifications)  \n• Master’s Degree or Ph.D. in Marketing Science, Econometrics, Statistics, Psychometrics, (Bio)Statistics, Applied Mathematics, Operations Research, or another quantitative field. \n• Experience with cloud compute platforms such as Azure with Databricks experience being especially valuable.  \n• Familiarity with advanced methods such as: customer lifetime value, media mix modeling (MMM), multi-touch attribution (MTA), consumer choice  (multinomial logit), time-series forecasting, hierarchical bayes, panel-data methods (fixed/random effects), censored/truncated regressions, selection models, non-random treatment effects, hazard /survival models, structural equation modeling, item response theory, latent class regression. \n• Prior experience with paid, earned, and owned media and/or marketing analytics \n\nCompensation:\n• The expected base compensation for this role is: $130,800 - $211,200. Actual base compensation within the identified range will vary based on factors relevant to the position.\n• Bonus Potential: An incentive pay program offers payouts based on company performance, job level, and individual performance.\n• Benefits : GM offers a variety of health and wellbeing benefit programs. Benefit options include medical, dental, vision, Health Savings Account, Flexible Spending Accounts, retirement savings plan, sickness and accident benefits, life insurance, paid vacation & holidays, tuition assistance programs, employee assistance program, GM vehicle discounts and more.\n\nGM DOES NOT PROVIDE IMMIGRATION-RELATED SPONSORSHIP FOR THIS ROLE. DO NOT APPLY FOR THIS ROLE IF YOU WILL NEED GM IMMIGRATION SPONSORSHIP NOW OR IN THE FUTURE. THIS INCLUDES DIRECT COMPANY SPONSORSHIP, ENTRY OF GM AS THE IMMIGRATION EMPLOYER OF RECORD ON A GOVERNMENT FORM, AND ANY WORK AUTHORIZATION REQUIRING A WRITTEN SUBMISSION OR OTHER IMMIGRATION SUPPORT FROM THE COMPANY (e.g., H-1B, OPT, STEM OPT, CPT, TN, J-1, etc.)\n\n#LI-CC1",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "Machine Learning",
        "AI",
        "SQL",
        "Git",
        "Azure"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-07T00:00:00.000Z",
      "url": "https://search-careers.gm.com/en/jobs/jr-202517474/sr-data-scientist-crm/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "FMbi7Wez3KccbHrXAAAAAA==",
      "title": "Data Scientist SME",
      "company": "Leidos",
      "location": "Alexandria, VA",
      "description": "Description\n\nLeidos National Security Sector combines technology-enabled services and mission software capabilities in the areas of cyber, logistics, security operations, and decision analytics to support our defense and intel customers’ mission to defend against evolving threats around the world. Our team’s focus is to ensure our customers have the right tools, technologies, and tactics to keep pace with an ever-evolving security landscape and succeed in their pursuit to protect people and critical assets.\n\nThe Intelligence Production Solutions Division (IPSD), part of the Decision Advantage Solutions Business Area, is seeking a Data Scientist Subject Matter Expert (SME) for the Chinook program. In this highly specialized role, you will lead complex, mission-critical projects that leverage advanced data science techniques, machine learning, and artificial intelligence to address key intelligence challenges. As a SME, you will apply deep expertise in data science and geospatial analytics to help solve high-stakes problems related to national security, defense, and geospatial intelligence.\n\nThis role requires both a strategic and hands-on approach, providing subject matter leadership and guidance to teams while working closely with customer stakeholders and mission experts. If you are an experienced data scientist with expertise in geospatial intelligence (GEOINT), machine learning, and Artificial Intelligence (AI), we want you to be part of our growing team!\n\nPosition may be performed in the following locations below. Please note Gaithersburg, MD is the primary work location for the program.\n• Gaithersburg, MD\n• Alexandria, VA\n• Chantilly, VA\n• Aurora, CO\n• St. Louis, MO\n\nClearance Level Required:\n\nTop Secret with the ability to obtain SCI, as well as a Polygraph.\n\nPrimary Responsibilities:\n• Serve as the technical SME in data science and geospatial analytics, providing high-level guidance on complex technical problems related to the GEOINT mission.\n• Lead the design and development of sophisticated data science models and machine learning algorithms to analyze large, multi-source geospatial data sets (e.g., satellite imagery, sensor data, geospatial databases).\n• Apply deep knowledge of GEOINT, remote sensing, and spatial analysis to develop and implement solutions that enhance data-driven decision-making capabilities.\n• Provide strategic recommendations for leveraging new and emerging technologies, including machine learning, AI, and cloud platforms, to improve analytical workflows, efficiency, and mission outcomes.\n• Mentor and train junior data scientists and analysts, ensuring the application of best practices in data science and the development of mission-relevant expertise.\n• Work closely with GEOINT analysts, program managers, engineers, and other stakeholders to identify critical requirements, define technical approaches, and ensure that solutions align with mission objectives.\n• Conduct applied research to explore innovative data science techniques and emerging trends (e.g., deep learning, reinforcement learning, advanced geospatial algorithms) that can be applied to solve real-world intelligence problems.\n• Oversee the deployment and operationalization of data science models, ensuring they are scalable, reliable, and deliver actionable insights to GEOINT decision-makers.\n• Maintain high-quality documentation for models, methodologies, and analysis processes to support reproducibility, training, and knowledge transfer.\n\nBasic Qualifications:\n• US citizenship is required per contract.\n• Bachelor’s degree in Data Science, Computer Science, Geospatial Science or related field and 12-15 years of prior relevant experience or Master’s with 10-13 years of prior relevant experience. May possess a Doctorate in technical domain.\n• 10+ years of professional experience in data science.\n• 5+ years of experience with GEOINT or geospatial data analysis.\n• Proven expertise in developing and implementing machine learning and AI models, particularly in context of geospatial or remote sensing.\n• Deep knowledge of geospatial analytics tools (e.g., GIS, ArcGIS), remote sensing techniques, and the application of data science in the IC.\n• Expert proficiency in Python (or similar languages) and experience with data science libraries (TensorFlow, PyTorch, Pandas, NumPy).\n• Strong experience with big data processing tools (e.g., Spark, Hadoop, AWS or Azure cloud platforms).\n• Expertise in working with geospatial data formats (e.g., GeoTIFF, Shapefiles, WMS, WFS) and spatial libraries (e.g., GeoPandas, Rasterio, GDAL).\n• Advance experience in developing and operationalizing AI/ML models and algorithms for geospatial data (e.g., object detection from satellite imagery, spatial clustering, predictive analytics).\n• Strong background in data visualization and reporting tools (e.g., Tableau, PowerBI).\n• Strong leadership, communication, and collaboration skills, with the ability to work directly with senior government officials, analysts, and technical teams.\n• Excellent problem-solving and analytical skills with a demonstrated ability to translate technical challenges into actionable insights.\n\nPreferred Qualifications:\n• Advanced certifications in data science or machine learning.\n• Familiarity with the customer mission and specific geospatial intelligence challenges.\n• Expertise in advanced deep learning techniques, particularly in computer vision and image analysis for geospatial applications.\n• Experience with cloud-native applications and distributed computing in a geospatial context.\n• Familiarity with satellite data analysis, and remoting sensing models.\n• Published research or technical papers in geospatial intelligence, machine learning, or data science.\n\n#Chinook\n\nCome break things (in a good way). Then build them smarter.\n\nWe're the tech company everyone calls when things get weird. We don’t wear capes (they’re a safety hazard), but we do solve high-stakes problems with code, caffeine, and a healthy disregard for “how it’s always been done.”\n\nOriginal Posting:\nOctober 9, 2025\n\nFor U.S. Positions: While subject to change based on business needs, Leidos reasonably anticipates that this job requisition will remain open for at least 3 days with an anticipated close date of no earlier than 3 days after the original posting date as listed above.\n\nPay Range:\nPay Range $126,100.00 - $227,950.00\n\nThe Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "Machine Learning",
        "Deep Learning",
        "AI",
        "Data Analysis",
        "AWS",
        "Azure"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-09T00:00:00.000Z",
      "url": "https://careers.leidos.com/jobs/16894311-data-scientist-sme?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "peC6eceNXP4OSLceAAAAAA==",
      "title": "Data Scientist - Marketing Analytics",
      "company": "Marketbridge",
      "location": "Washington, DC",
      "description": "Who We Are\nMarketbridge is a growth consulting and marketing firm dedicated to helping modern leaders accelerate performance with no signal loss from strategy through execution. We combine management consultancy with marketing agency expertise, all backed by marketing science, creative problem-solving, and technological know-how. Our integrated approach brings together teams, technology, data, strategies, processes, and plans to fuel sustainable revenue growth and build deeper, more resonant customer relationships. We partner with some of the world’s largest and most ambitious brands, providing innovative solutions that drive commercial agility and long-term success.\n\nWho We’re Looking For\nMarketbridge is looking for a Data Scientist to support program strategy and execution to help clients improve their marketing and sales outcomes. The Data Scientist will be part of a project team and play a key role in helping our clients measure marketing’s effectiveness and optimize marketing mix to drive results. You will quickly work with clients to solve some of their most pressing problems, leveraging a variety of tools and methods including quantitative analysis, model development, and market research.\n\nResponsibilities\n• Model Development: Investigate, suggest, and attempt new model builds including Marketing Mix Models (MMM) and Multi-Touch Attribution (MTA)\n• Project and Client Management: Communicate with clients regarding data outputs, create technical slides for project deliverables, and flag roadblocks that may impede on-time delivery\n• Internal Collaboration: Participate in brainstorms and troubleshooting, partner with Lead Data Scientist and Project Manager to outline modeling approach and data sources, and support and mentor junior Analysts\n\nQualifications\nThis position is for those with significant analytics experience who are looking for an opportunity to use data, research, and best practices to help improve clients’ sales and marketing strategies while increasing the responsibility and autonomy over their workstreams. We are looking for someone who:\n• Has 2+ years of experience in data-driven consulting, market research, and data science\n• Has a background in highly quantitative hard sciences (advanced math, computer science, or economics) or highly quantitative social sciences\n• Is comfortable using big or small data environments to answer questions and then develop an overall story about what the analysis means\n• Can integrate stimulus, response, and control data from a variety of sources including agencies, internal systems, and technology platforms\n• Has experience in econometric techniques, including panel data, ridge regression, and multiple functional forms as well as machine learning techniques\n• Demonstrates strong coding skills in R and/or Python, including data munging\n• Is adept at creating reproducible deliverables (Rmarkdown, notebooks, etc.)\n• Has experience with version control (git, github, etc.) and modern data storage (MapReduce, Spark)\n\nNote: This position requires the ability to work in the United States without visa sponsorship. MarketBridge is an Equal Opportunity Employer.\n\nThe ideal candidate will:\n• Can balance multiple projects at one time, under tight deadlines\n• Has excellent written and oral communication, presentation, and analytical skills\n• Is extremely conscientious, with a strong attention to detail and excellent organizational skills\n• Be proactive and start projects with little prodding\n\nOur Culture\nAt Marketbridge, we pride ourselves on fostering an entrepreneurial culture filled with intellectually curious, high-spirited individuals committed to making a tangible impact each day. We value our people as our greatest asset, offering a workplace where high performers are acknowledged and rewarded. Working here means joining a team of the brightest minds in the industry, in an environment that champions professional growth and development through a mix of personal initiatives and company-supported learning. We believe in empowering our employees to own their career paths, supported by management guidance and organizational resources.\nWe are proud to have been named one of The Washington Post's 2024 Top Workplaces in the Washington, D.C. area!\nWe provide a benefits experience centered around wellness. It is important to us that every Marketbridger feels cared for and valued.\n• Industry competitive compensation and performance-based bonuses\n• Generous paid time off including vacation, holidays, sick leave, maternity/paternity leave, and Friday Summer hours\n• A wide array of healthcare options including medical, dental, and vision coverage\n• 401(k) savings plan with company match\n• Marketbridge-led Social Committee\n• Referral bonus program\n• Mentor program for new hires\n\nThis role is a hybrid role based out of our Bethesda, MD office.\nThe salary range for this role is $100,000-$125,000 with an eligible annual bonus of up to 15%.\n\nGAx4a88YF4",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Machine Learning",
        "AI",
        "Git"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-03T00:00:00.000Z",
      "url": "https://www.indeed.com/viewjob?jk=b0ecadaaa233eb06&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "Z_jlRNdMNvpMoYITAAAAAA==",
      "title": "Data Scientist Jobs",
      "company": "IO Associates",
      "location": "Washington, VA",
      "description": "A leading AI Analytics startup is looking to hire a Data Scientist to work on their latest AI products. Their cutting-edge platform turns complex data into actionable insights with intuitive AI tools and advanced visualization features, empowering users to make informed decisions effortlessly. Trusted by top defense agencies and Fortune 500 companies, They are expanding rapidly and are looking for a talented Data Scientist to join their dynamic team!\n\nWhat You’ll Do:\n\nDesign, implement, and deliver AI-powered solutions tailored to meet client needs using advanced analytics tools.\n\nCollaborate closely with clients to guide AI solutions from concept to full-scale deployment.\n\nUtilize big data tools and platforms, such as Databricks, to create scalable and efficient AI-driven solutions.\n\nWhat You’ll Bring:\n\nActive TS/SCI security clearance and the ability to work from a SCIF.\n\nBased in Washington DC/Northern Virginia with occasional travel to client sites.\n\nA degree in Computer Science or a related field.\n\n3+ years of hands-on experience with Python coding (pandas, numpy, sklearn, TensorFlow, PyTorch, etc.).\n\nProven experience deploying machine learning models into production environments.\n\nProficiency with SQL/NoSQL databases, version control tools (e.g., Git), Docker, and Kubernetes.\n\nStrong ownership, accountability, and communication skills.\n\nBonus Points For:\n\nExperience leading projects in SCIF environments.\n\nExpertise in Cyber Analytics, PCAP, or network monitoring.\n\nFamiliarity with Spark, Dask, Snowpark, Kafka, or task schedulers like Airflow and Celery.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Rust",
        "Machine Learning",
        "AI",
        "SQL",
        "Git",
        "Docker",
        "Kubernetes"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-17T14:00:00.000Z",
      "url": "https://www.clearancejobs.com/jobs/8337730/data-scientist?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "RVwRCXJtCpPyWt4BAAAAAA==",
      "title": "Data Scientist - Mid level",
      "company": "Nalley Consulting",
      "location": "Washington, DC",
      "description": "Join the Nalley Consulting team as a Data Scientist at DIA Headquarters.\n\nPosition: Data Scientist\n\nLCAT: Mid\n\nLocations: DIAC, Joint Base Anacostia Bolling\n\nShift: No\n\nRequired clearance: Active TS/SCI clearance\nRequired education: Bachelor's degree\n\nBasic Qualifications:\n• Python experience.\n• 3+ years of experience with data exploration, data cleaning, data analysis, data visualization, or data mining\n• 3+ years of experience with analyzing structured and unstructured data sources\n• Experience with statistical and general-purpose programming languages for data analysis\n• Experience with developing predictive data models, quantitative analyses, and visualization of target data sources\n• Experience with leading the development of solutions to complex problems\n• Experience with natural language processing, text mining, or machine learning techniques\n• Experience implementing automation in processing, presenting, or manipulating data\n• Active TS/SCI clearance; willingness to take a polygraph exam\n• Bachelor's degree\n\nAdditional Qualifications / Nice to have:\n• Experience in the development of algorithms leveraging Python and SQL\n• Experience with developing solutions incorporating Large Language Models\n• Experience with Python data science and visualization packages\n• Experience with Excel MBA\n• An active CI polygraph\n\nABOUT NALLEY CONSULTING\n\nNalley Consulting is a Service Disabled Veteran Owned Small Business working with prime partners to staff Department of Defense and Intelligence Community positions. Created by a U.S. Navy intelligence veteran, Nalley Consulting has grown to include multiple IDIQ vehicles in several states.\n\nNalley Consulting fringe benefits include:\n• Excellent medical, dental, and vision benefits\n• PTO\n• 11 paid federal holidays\n• Tuition assistance\n• Paid military-reserve leave\n• Paid parental leave for birth or adoption\n• 401k matching up to 5 percent of the base salary\n• Flex time\n• Company-paid short-term disability, long-term disability, and life insurance.\n\nAvDxIrOOVX",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "Machine Learning",
        "AI",
        "Data Analysis",
        "SQL"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-04T00:00:00.000Z",
      "url": "https://www.indeed.com/viewjob?jk=907a13bcf9a9148a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "EaqWHgepBE_bZuMyAAAAAA==",
      "title": "Data Scientist, Devices Economic Value",
      "company": "Amazon",
      "location": "Arlington, VA",
      "description": "Description\n\nAmazon's Devices Economic Value team enables measurement and optimization of Amazon Devices long-term value to help Amazon build better products for their customers. Delivering lasting value to customers is in Amazon's DNA and we are at the core of how the Devices business prioritizes its investments in innovation and optimization on behalf of customers.\n\nJoin us to be a part of the team that is at the core of understanding how Amazon Devices drive deeper customer engagement and helps the business make decisions about how to optimize and balance between short term monetization and long term value creation for Amazon Device users. We are seeking a skilled Data Scientist to help us build the future of Devices and Services marketing measurement and its impacts on long term free cash flow for our business.\n\nKey job responsibilities\n\nWe are looking for a Data Scientist to drive the development of Devices and Services own Marketing Mix Models, connecting marketing spend and impressions to their effects on long term free cash flow. The Data Scientist will be responsible for partnering to develop the MMM framework that adapts to the unique characteristics of the Devices and Services business model, to drive marketing investment decisions across the Devices business. We expect the Data Scientist to drive marketing measurement innovation, leveraging current advances in machine learning and other modeling frameworks.\n\nAbout The Team\n\nDevices Science team’s mission is to drive measurement and optimization of long term economic value of the Devices business that balances short term and long term tradeoffs across product lifecycle, and drive clear value for Amazon shoppers. We leverage science advancements across causal inference, structural modeling and machine learning, to solve challenging business problems in Amazon Devices. The team spans scientists across a wide range of seniority, tenure and specialization, including economists, data and applied scientists, with dedicated product and engineering partners.\n\nBasic Qualifications\n• 3+ years of data querying languages (e.g. SQL), scripting languages (e.g. Python) or statistical/mathematical software (e.g. R, SAS, Matlab, etc.) experience\n• 2+ years of data scientist experience\n• 3+ years of machine learning/statistical modeling data analysis tools and techniques, and parameters that affect their performance experience\n• Bachelor's degree\n• Experience applying theoretical models in an applied environment\n\nPreferred Qualifications\n• Experience in Python, Perl, or another scripting language\n• Experience in a ML or data scientist role with a large technology company\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $125,500/year in our lowest geographic market up to $212,800/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.\n\nCompany - Amazon.com LLC\n\nJob ID: A3070257",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Machine Learning",
        "AI",
        "Data Analysis",
        "SQL"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-16T00:00:00.000Z",
      "url": "https://www.linkedin.com/jobs/view/data-scientist-devices-economic-value-at-amazon-4294350111?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "NsGpTBQXBklMIBYEAAAAAA==",
      "title": "GEOINT Data Scientist (Intelligence Center)",
      "company": "MITRE",
      "location": "McLean, VA",
      "description": "Why choose between doing meaningful work and having a fulfilling life? At MITRE, you can have both. That's because MITRE people are committed to tackling our nation's toughest challenges—and we're committed to the long-term well-being of our employees. MITRE is different from most technology companies. We are a not-for-profit corporation chartered to work for the public interest, with no commercial conflicts to influence what we do. The R&D centers we operate for the government create lasting impact in fields as diverse as cybersecurity, healthcare, aviation, defense, and enterprise transformation. We're making a difference every day—working for a safer, healthier, and more secure nation and world. Our workplace reflects our values. We offer competitive benefits, exceptional professional development opportunities for career growth, and a culture of innovation that embraces adaptability, collaboration, technical excellence, and people in partnership. If this sounds like the choice you want to make, then choose MITRE - and make a difference with us.\n\nMITRE’s Multi-Int Exploitation Mission Enabler department effectively combines the deep technical knowledge required to develop capabilities with critical domain knowledge to harness and shape those capabilities to meet multiple sponsor mission needs. We have the technical depth and breadth to thrive in mission focused R&D/S&T organizations and the well-earned sponsor credibility to execute work programs relating to research, analysis, prototyping, T&E, etc.\n\nWe seek motivated individuals who are interested in applying sensors, data science, AI/ML systems, and data engineering for the exploitation of multiple data types to include remote sensing data. Remote Sensing data refers to those collected using infrared imagery (OPIR), hyperspectral imagery (HSI), radar (SAR/GMTI), full motion video (FMV), Wide Are Motion Imagery (WAMI), and 3D data from a range of sources.\n\nJoin a team that is committed to strong collaboration, intellectual rigor, and prototyping “game-changing” and “tip-of-the-spear” operational solutions for our government sponsors. The ideal candidate will bring a consistent track record of success in delivery of high-impact technical solutions, the integration and application of knowledge and skills in enterprise transformation and related disciplines, proven ability to provide technical and/or project team leadership within challenging customer environments, and passion for contributing to growing technical capabilities in enterprise architecture, innovation, analytics and optimization. The successful candidate will be expected to continue to develop and expand their individual expertise, to lead and/or contribute to fast-paced projects as a member of high-performing multi-disciplinary teams, to provide subject matter expertise, technical mentoring and coaching for less experienced staff, and to lead/contribute to the development, evolution, and application of emerging technical capabilities. As an individual contributor and technical advisor, you will provide senior leaders with advice and an understanding of techniques and effective approaches to enterprise level architecture and design, governance, and supporting technologies.\n\nRoles & Responsibilities:\n• Engage with key decision-makers, government researchers, and mission-focused analysts in the field of GEOINT.\n• Advance analytic tradecraft that integrates and utilizes automated methods.\n• Run experiments comparing state-of-the-art methods with a strong focus on performance when these methods are applied to sponsor driven data and real-world conditions\n• Adapt research done in academia and industry to our sponsors’ uniquely challenging data sources and problem sets\n• Analyzing data, tools, and reports from cutting-edge sensor systems including video, infrared, hyperspectral, radar, and others\n• Brainstorming/problem solving with experienced technical staff to develop solutions for challenging problems and working with leading teams to implement those solutions\n• Work closely with sponsor leadership, data science teams, managed service providers, and mission users to ensure new initiatives align with organizational vision and strategic objectives\n• Collaborate with data analysts, data scientists, and other stakeholders to understand data requirements and deliver solutions to improve performance, reliability, and scalability\n• Review issues and make recommendations for process improvements\n\nBasic Qualifications:\n• Typically requires a minimum of 8 years of related experience with a Bachelor’s degree; or 6 years and a Master’s degree; or a PhD with 3 years’ experience; or equivalent combination of related education and work experience. Prior professional experience in the US Intelligence, Space, or Defense Community\n• Active TS/SCI with poly.\n• Strong program and stakeholder management skills\n• Strong Microsoft Office Skills (Word, Excel, PowerPoint) Proficiency in use of Microsoft Office including Outlook, Excel, and Word\n• Familiarity with Python, R, or MatLab\n• Strong problem-solving skills and capable of working with scientists, analysts, and technical software developers\n• Domain knowledge of remote sensing and ISR, particularly: Radar, SAR, MTI, GMTI, FMV, and WAMI\n• This position has an on-site requirement of 5 days a week on-site.\n\nPreferred Qualifications:\n• Prior professional experience with GEOINT sensors and data sources\n• Prior professional experience with NGA\n• Demonstrated ability to deliver impactful results to customers\n• Understanding of and ability to implement AI/ML solutions to data\n\nPrior experience leading multidisciplinary teams of researchers, analysts, and engineers\n\nThis requisition requires the candidate to have a minimum of the following clearance(s):\n\nTop Secret/SCI/Polygraph\n\nThis requisition requires the hired candidate to have or obtain, within one year from the date of hire, the following clearance(s):\n\nTop Secret/SCI/Polygraph\n\nWork Location Type:\n\nOnsite\n\nCommitment to Non-Discrimination\n\nAll qualified applicants will receive consideration for employment without regard to disability, status as a protected veteran or any other status protected by applicable federal, state, local or international law.\n\nMITRE intends to maintain a website that is fully accessible to all individuals. If you are unable to search or apply for jobs and would like to request a reasonable accommodation for any part of MITRE’s employment process, please email recruitinghelp@mitre.org for general support and collegerecruiting@mitre.org for intern positions. This service is for individuals requiring reasonable accommodation requests. Please note that vendor solicitations will not receive a reply.\n\nBenefits information may be found here.\n\nCopyright © 1997-2025, The MITRE Corporation. All rights reserved. MITRE is a registered trademark of The MITRE Corporation. Material on this site may be copied and distributed with permission only.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "AI"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-15T00:00:00.000Z",
      "url": "https://www.linkedin.com/jobs/view/geoint-data-scientist-intelligence-center-at-mitre-4315374605?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "ok_JuNIFMMWW0XLQAAAAAA==",
      "title": "Data Scientist, Product Analytics",
      "company": "Meta",
      "location": "Washington, DC",
      "description": "As a Data Scientist at Meta, you will shape the future of people-facing and business-facing products we build across our entire family of applications (Facebook, Instagram, Messenger, WhatsApp, Oculus). By applying your technical skills, analytical mindset, and product intuition to one of the richest data sets in the world, you will help define the experiences we build for billions of people and hundreds of millions of businesses around the world. You will collaborate on a wide array of product and business problems with a wide-range of cross-functional partners across Product, Engineering, Research, Data Engineering, Marketing, Sales, Finance and others. You will use data and analysis to identify and solve product development's biggest challenges. You will influence product strategy and investment decisions with data, be focused on impact, and collaborate with other teams. By joining Meta, you will become part of a world-class analytics community dedicated to skill development and career growth in analytics and beyond.Product leadership: You will use data to shape product development, quantify new opportunities, identify upcoming challenges, and ensure the products we build bring value to people, businesses, and Meta. You will help your partner teams prioritize what to build, set goals, and understand their product's ecosystem.Analytics: You will guide teams using data and insights. You will focus on developing hypotheses and employ a varied toolkit of rigorous analytical approaches, different methodologies, frameworks, and technical approaches to test them.Communication and influence: You won't simply present data, but tell data-driven stories. You will convince and influence your partners using clear insights and recommendations. You will build credibility through structure and clarity, and be a trusted strategic partner.\n\nData Scientist, Product Analytics Responsibilities:\n• Work with large and complex data sets to solve a wide array of challenging problems using different analytical and statistical approaches\n• Apply technical expertise with quantitative analysis, experimentation, data mining, and the presentation of data to develop strategies for our products that serve billions of people and hundreds of millions of businesses\n• Identify and measure success of product efforts through goal setting, forecasting, and monitoring of key product metrics to understand trends\n• Define, understand, and test opportunities and levers to improve the product, and drive roadmaps through your insights and recommendations\n• Partner with Product, Engineering, and cross-functional teams to inform, influence, support, and execute product strategy and investment decisions\n\nMinimum Qualifications:\n• Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience\n• Bachelor's degree in Mathematics, Statistics, a relevant technical field, or equivalent\n• 4+ years of work experience in analytics, data querying languages such as SQL, scripting languages such as Python, and/or statistical mathematical software such as R (minimum of 2 years with a Ph.D.)\n• 4+ years of experience solving analytical problems using quantitative approaches, understanding ecosystems, user behaviors & long-term product trends, and leading data-driven projects from definition to execution [including defining metrics, experiment, design, communicating actionable insights]\n\nPreferred Qualifications:\n• Master's or Ph.D. Degree in a quantitative field\n\nAbout Meta:\n\nMeta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n\nMeta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.\n\nMeta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.\n\n$145,000/year to $204,000/year + bonus + equity + benefits\n\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "Rust",
        "Machine Learning",
        "AI",
        "SQL",
        "Git"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": null,
      "url": "https://www.indeed.com/viewjob?jk=7576388cec01c434&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "UfBIJfzz7Y_C7l_GAAAAAA==",
      "title": "Data Science Engineer, Professional (AWS)",
      "company": "Freddie Mac",
      "location": "McLean, VA",
      "description": "At Freddie Mac, our mission of Making Home Possible is what motivates us, and it’s at the core of everything we do. Since our charter in 1970, we have made home possible for more than 90 million families across the country. Continue your career journey where your work contributes to a greater purpose.\n\nPosition Overview:\n\nOur team builds and manages the AWS infrastructure that supports Model (ML) development across the company. Our platforms run on Kubernetes and leverage AWS tooling to provide highly scalable and dynamic platform features used by data scientists daily. You will directly drive the results for the team and own components of the platform from design through deployment.\n\nOur Impact:\n\nOur platforms are used across all business lines for Data Science development and deployment work as well as data exploration. This team is highly visible and works directly with emerging AI and ML technologies.\n\nYour Impact:\n\nYou will design, develop and own product solutions from start to finish. On a day-to-day basis you will interact with data scientists to identify issues and new product solutions. You will continually be researching and testing new AI/ML tools and procedures to offer to offer to the wider company.\n\nQualifications:\n• Bachelor’s degree in Computer Science, Engineering (any field), Information Technology Management, or related discipline\n• 2-4 years of progressively responsible experience in a software engineering occupation.\n• 2-4 years of experience working with Java, JavaScript, python, HTML and CSS;\n• 2-4 years of experience working with Cloud Technologies (AWS, Kubernetes, Docker, or similar container technologies);\n• 2-4 years of experience deploying application solutions;\n• 3 years of developing experience with REST APIs;\n• 3 years of experience with code repository GIT and Bitbucket; and,\n• Demonstrated knowledge of software design principles.\n\nKeys to Success in this Role:\n• Demonstrate a strong desire to learn new technologies and tools in the AI/ML space\n• Quickly identify solutions to issues raised by Data Scientists\n• Have a strong understanding of the varies AWS components needed to run AI/ML infrastructure\n• Ability to help junior team members grow their knowledge and abilities\n\nWe consider all applicants for all positions without regard to gender, race, color, religion, national origin, age, marital status, veteran status, sexual orientation, gender identity/expression, physical and mental disability, pregnancy, ethnicity, genetic information or any other protected categories under applicable federal, state or local laws. We will ensure that individuals are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.\n\nFreddie Mac offers a comprehensive total rewards package to include competitive compensation and market-leading benefit programs. Information on these benefit programs is available on our Careers site.\n\nThis position has an annualized market-based salary range of $103,000 - $155,000 and is eligible to participate in the annual incentive program. The final salary offered will generally fall within this range and is dependent on various factors including but not limited to the responsibilities of the position, experience, skill set, internal pay equity and other relevant qualifications of the applicant.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "JavaScript",
        "Java",
        "Go",
        "AI",
        "Git",
        "Docker",
        "Kubernetes",
        "AWS",
        "HTML",
        "CSS",
        "REST API"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-16T00:00:00.000Z",
      "url": "https://careers.freddiemac.com/us/en/job/JR15964/Data-Science-Engineer-Professional-AWS?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "LOw0FmpxOd27Oa4vAAAAAA==",
      "title": "Machine Learning Engineer - Fraud Data",
      "company": "Plaid",
      "location": "Washington, DC",
      "description": "We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.\n\nWe’re the Data team within Plaid’s Fraud organization, and we’re on a mission to stop fraud before it happens. Our team builds the machine learning systems that power Plaid’s most advanced fraud detection products, harnessing the scale and richness of Plaid’s network data to protect consumers and businesses alike. We own the full ML lifecycle — from feature pipelines and model training to deployment and monitoring — ensuring our systems are reliable, scalable, and ready to support hundreds of customers as Plaid continues to grow.\n\nAs a Machine Learning Engineer on Plaid’s Fraud Data team, you’ll play a key role in shaping the future of fraud prevention. You’ll develop new features and machine learning models that enhance the accuracy and effectiveness of our fraud detection systems, while building reliable data and model pipelines to power both experimentation and production workflows. Working closely with data science, infrastructure, and product teams, you’ll help design and deliver scalable, high-quality ML systems that protect Plaid’s customers at scale. You’ll also have the opportunity to explore and prototype GenAI-driven capabilities that push the boundaries of our fraud modeling and investigation tools.\n• **We are open to remote candidates for this role***\n\nResponsibilities\n• Build and deploy end-to-end ML solutions — from feature engineering to production deployment\n• Scale and optimize machine learning systems in a real-world, high-traffic environment\n• Explore and apply cutting-edge LLMs and generative AI to strengthen fraud prevention and investigation\n• Grow your career in a fast-paced, collaborative environment\n\nQualifications\n• 3-5 years total experience, with at least 2 years of hands-on work in ML systems, modeling, or data engineering\n• Proven experience building and deploying end-to-end machine learning system\n• Strong foundation in Python and core ML principles\n• Demonstrated curiosity and adaptability — comfortable working across both modeling and infrastructure\n• Nice to have - experience in fraud detection, risk modeling, or related domains\n• Nice to have - familiarity with large language models (LLMs) or generative AI frameworks\n\n$202,800 - $279,600 a year\n\nThe target base salary for this position ranges from $202,800/year to $279,600/year in Zone 1. The target base salary will vary based on the job's location.\n\nOur Geographic Zones Are As Follows\n\nZone 1 - New York City and San Francisco Bay Area\n\nZone 2 - Los Angeles, Seattle, Washington D.C.\n\nZone 3 - Austin, Boston, Denver, Houston, Portland, Sacramento, San Diego\n\nZone 4 - Raleigh-Durham and all other US cities\n\nAdditional compensation in the form(s) of equity and/or commission are dependent on the position offered. Plaid provides a comprehensive benefit plan, including medical, dental, vision, and 401(k). Pay is based on factors such as (but not limited to) scope and responsibilities of the position, candidate's work experience and skillset, and location. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nOur mission at Plaid is to unlock financial freedom for everyone. To support that mission, we seek to build a diverse team of driven individuals who care deeply about making the financial ecosystem more equitable. We recognize that strong qualifications can come from both prior work experiences and lived experiences. We encourage you to apply to a role even if your experience doesn't fully match the job description. We are always looking for team members that will bring something unique to Plaid!\n\nPlaid is proud to be an equal opportunity employer and values diversity at our company. We do not discriminate based on race, color, national origin, ethnicity, religion or religious belief, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, military or veteran status, disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state, and local laws. Plaid is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance with your application or interviews due to a disability, please let us know at accommodations@plaid.com.\n\nPlease review our Candidate Privacy Notice here .",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "Machine Learning",
        "AI",
        "AWS"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-17T21:00:00.000Z",
      "url": "https://www.linkedin.com/jobs/view/machine-learning-engineer-fraud-data-at-plaid-4316394846?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Machine learning",
      "source": "JSearch API"
    },
    {
      "id": "Pt0JYfbCRXfwC9drAAAAAA==",
      "title": "Senior Manager, Machine Learning Engineering",
      "company": "Capital One",
      "location": "McLean, VA",
      "description": "Senior Manager, Machine Learning Engineering\n\nAs a Capital One Machine Learning Engineer (MLE), you'll be part of an Agile team dedicated to productionizing machine learning applications and systems at scale. You’ll participate in the detailed technical design, development, and implementation of machine learning applications using existing and emerging technology platforms. You’ll focus on machine learning architectural design, develop and review model and application code, and ensure high availability and performance of our machine learning applications. You'll have the opportunity to continuously learn and apply the latest innovations and best practices in machine learning engineering.\n\nThis team is responsible for building, operationalizing, monitoring, and maintaining the machine learning models that power our credit card recoveries division. In this role you will manage a small team of machine learning engineers focusing on ML operations and partner with data science teams to enable critical business decisions. We leverage tools like Python, PySpark, AWS, Kubernetes (Kubeflow), XG Boost, and scikit-learn.\n\nWhat you’ll do in the role:\n\nThe MLE role overlaps with many disciplines, such as Ops, Modeling, and Data Engineering. In this role, you'll be expected to perform many ML engineering activities, including one or more of the following:\n• Design, build, and/or deliver ML models and components that solve real-world business problems, while working in collaboration with the Product and Data Science teams.\n• Inform your ML infrastructure decisions using your understanding of ML modeling techniques and issues, including choice of model, data, and feature selection, model training, hyperparameter tuning, dimensionality, bias/variance, and validation).\n• Solve complex problems by writing and testing application code, developing and validating ML models, and automating tests and deployment.\n• Collaborate as part of a cross-functional Agile team to create and enhance software that enables state-of-the-art big data and ML applications.\n• Retrain, maintain, and monitor models in production.\n• Leverage or build cloud-based architectures, technologies, and/or platforms to deliver optimized ML models at scale.\n• Construct optimized data pipelines to feed ML models.\n• Leverage continuous integration and continuous deployment best practices, including test automation and monitoring, to ensure successful deployment of ML models and application code.\n• Ensure all code is well-managed to reduce vulnerabilities, models are well-governed from a risk perspective, and the ML follows best practices in Responsible and Explainable AI.\n• Use programming languages like Python, Scala, or Java.\n\nBasic Qualifications:\n• Bachelor’s degree\n• At least 8 years of experience designing and building data-intensive solutions using distributed computing (Internship experience does not apply)\n• At least 4 years of experience programming with Python, Scala, or Java\n• At least 3 years of experience building, scaling, and optimizing ML systems\n• At least 2 years of experience leading teams developing ML solutions\n• At least 4 years of people management experience.\n\nPreferred Qualifications:\n• Master's or doctoral degree in computer science, electrical engineering, mathematics, or a similar field\n• 4+ years of on-the-job experience with an industry recognized ML framework such as scikit-learn, PyTorch, Dask, Spark, or TensorFlow\n• 3+ years of experience developing performant, resilient, and maintainable code\n• 3+ years of experience with data gathering and preparation for ML models\n• Experience developing and deploying ML solutions in a public cloud such as AWS, Azure, or Google Cloud Platform\n• 3+ years of experience building production-ready data pipelines that feed ML models\n• Ability to communicate complex technical concepts clearly to a variety of audiences\n• ML industry impact through conference presentations, papers, blog posts, open source contributions, or patents\n\nCapital One will consider sponsoring a new qualified applicant for employment authorization for this position.\n\nThe minimum and maximum full-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\n\nMcLean, VA: $225,400 - $257,200 for Sr. Mgr, Machine Learning Engineering\n\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter.\n\nThis role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part-time status, exempt or non-exempt status, and management level.\n\nThis role is expected to accept applications for a minimum of 5 business days.\n\nNo agencies please. Capital One is an equal opportunity employer (EOE, including disability/vet) committed to non-discrimination in compliance with applicable federal, state, and local laws. Capital One promotes a drug-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\n\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
      "job_type": "Full-time and Part-time",
      "required_skills": [
        "Python",
        "Java",
        "Go",
        "Machine Learning",
        "AI",
        "Kubernetes",
        "AWS",
        "Azure"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-13T00:00:00.000Z",
      "url": "https://www.capitalonecareers.com/job/mclean/senior-manager-machine-learning-engineering/1732/87261093456?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Machine learning",
      "source": "JSearch API"
    },
    {
      "id": "E8KnFlGcdfjtSTqlAAAAAA==",
      "title": "AI & Machine Learning Engineer - Manager - Consulting - Open Location",
      "company": "EY",
      "location": "Washington, DC",
      "description": "Location: Anywhere in Country\n\nAt EY, we’re all in to shape your future with confidence.\n\nWe’ll help you succeed in a globally connected powerhouse of diverse teams and take your career wherever you want it to go. Join EY and help to build a better working world.\n\nTechnology – Data and Decision Science – AI Native Engineering\n\n​AI/Machine Learning Engineer, Manager Consultant\n\nThe opportunity\nOur Artificial Intelligence and Data team helps apply cutting edge technology and techniques to bring solutions to our clients. As part of that, you'll sit side-by-side with clients and diverse teams from EY to create a well-rounded approach to advising and solving challenging problems, some of which have not been solved before. No two days will be the same, and with constant research and development, you'll find yourself building knowledge that can be applied across a wide range of projects now, and in the future. You'll need to have a passion for continuous learning, stay ahead of the trends, and influence new ways of working so you can position solutions in the most relevant and innovative way for our clients. You can expect heavy client interaction in a fast-paced environment and the opportunity to develop your own career path for your unique skills and ambitions.\n\nIn this role, you will research, build, and implement scalable artificial intelligence systems that learn and make predictions tailored to business requirements across various environments, including cloud and on-premises. You will enhance data pipelines and storage, ensuring data is clean, accurate, and optimized for XOps processes. Additionally, you will monitor and evaluate learning processes to continuously improve high-performance models, collaborating with other data and analytics professionals to industrialize analysis into effective analytics solutions.\n\nYour key responsibilities\nAs a Manager in AI Native Engineering, you will play a pivotal role in delivering innovative solutions that drive business success. You will work with a wide variety of clients to deliver the latest data science and big data technologies. Your teams will design and build scalable solutions that unify, enrich, and derive insights from varied data sources across a broad technology landscape. You will help our clients navigate the complex world of modern data science, analytics, and software engineering. We'll look to you to provide guidance and perform technical development tasks to ensure data science solutions are properly engineered and maintained to support the ongoing business needs of our clients.\n\nYou will be joining a dynamic and interdisciplinary team of scientists and engineers who love to tackle the most challenging computational problems for our clients. We love to think creatively, build applications efficiently, and collaborate in both the ideation of solutions and the pursuit of new opportunities. Many on our team have advanced academic degrees or equivalent experience in industry.\n\nYour responsibilities will include:\n• Leading workstream delivery and ensuring the effective management of processes and projects.\n• Continuously improving processes by identifying innovative solutions through research and analysis.\n• Managing professional employees and supervising teams to deliver complex technical initiatives, with accountability for performance and results.\n• Engaging actively with clients, participating in daily working sessions, and leading workstreams from planning through execution to closure.\n• Identifying opportunities for additional services and managing engagement economics.\n\nSkills and attributes for success\nTo excel in this role, you will need a blend of technical expertise and strong interpersonal skills. This role will work to deliver tech at speed, innovate at scale and put humans at the center. Provide technical guidance and share knowledge with team members with diverse skills and backgrounds. Consistently deliver quality client services focusing on more complex, judgmental and/or specialized issues surrounding emerging technology. Demonstrate technical capabilities and professional knowledge. Learn about EY and its service lines and actively assess and present ways to apply knowledge and services\nThe following attributes will make a significant impact:\n• Proven ability to develop solutions to complex problems and recommend changes to policies and procedures.\n• Strong judgment in selecting methods and techniques for obtaining results.\n• Experience in managing client relationships and delivering high-quality service.\n• Ability to lead teams effectively and manage change within the organization.\n\nTo qualify for the role, you must have\n• A Bachelor’s degree required (4-year degree).\n• 6-10 years of relevant experience of full-time working experience in AI, Data Science, and/or Machine Learning\n• 2-4 years of experience directly managing technical teams\n• Strong skills in Python.\n• Experience using Generative AI models and frameworks e.g. OpenAI family, open source LLMs, Dall-e, LlamaIndex, Langchain, Retrieval Augmented Generation (RAG).\n• Experience working with popular ML packages such as scikit-learn, Pytorch and ONNX, or related ML libraries.\n• Extensive experience using DevOps tools like GIT, Azure Devops and Agile tools such as Jira to develop and deploy analytical solutions with multiple features, pipelines, and releases.\n• A solid understanding of Machine Learning (ML) workflows including ingesting, analysing, transforming data and evaluating results to make meaningful predictions.\n• Experience with MLOps methods and platforms such as MLFlow.\n• Experience with CI/CD and test-driven development.\n• Experience designing, building, and maintaining ML models, frameworks, and pipelines.\n• Experience designing and deploying end to end ML workflows on at least one major cloud computing platform.\n• Understanding of data structures, data modelling and software engineering best practices.\n• Proficiency using data manipulation tools and libraries such as SQL, Pandas, and Spark.\n• Clearly communicating findings, recommendations, and opportunities to improve data systems and solutions.\n• Experience with containerization and scaling models.\n• Integrating models and feedback from downstream consumption systems - reporting and dashboards, AI driven applications.\n• Deep Learning expertise.\n• Proficiency in Mathematics, Statistics, and Operations Research.\n• Experience with Machine Learning techniques.\n• Knowledge of Data Architecture Design and Modelling.\n• Familiarity with Cloud Computing environments.\n• Skills in Technical Design Optimization.\n• Experience with Continuous Integration and Continuous Delivery/Deployment.\n• Understanding of Natural Language Processing and Generation.\n• Knowledge in Image Processing and Analysis.\n• Skills in Speech and Audio Processing and Analysis.\n• Ability to scale models effectively.\n• Strong relationship-building skills.\n• Demonstrated client trust and value.\n• Effective communication skills with impact.\n• Digital fluency and emotional agility.\n• Experience in hybrid collaboration.\n• Commercial acumen and negotiation skills.\n• Proven ability to lead teams and manage change.\n• Strong mathematical and quantitative skills including calculus, linear algebra, and statistics.\n• Willingness to travel to meet client obligations.\n\nIdeally, you’ll also have\n• A deep understanding of and ability to teach concepts, tools, features, functions, and benefits of different approaches to apply them.\n• Master's degree Computer Science, Mathematics, Physical Sciences, or other quantitative field.\n• Experience working with diverse teams to deliver complex solutions.\n• Strong skills in languages beyond Python: R, JavaScript, Java, C++, C.\n• Experience fine-tuning Generative AI models.\n• Experience in managing complex projects with multiple stakeholders.\n• A strong understanding of industry trends and emerging technologies.\n• Skills in data visualization and storytelling with data.\n\nWhat we look for\nWe seek individuals who are not only technically proficient but also possess the ability to think critically and creatively. Top performers demonstrate a commitment to excellence, a collaborative spirit, and a passion for driving innovation in the field of AI and data science. Your ability to collaborate effectively and communicate with clarity will set you apart as a leader in our team.\n\n#FY26NATAID\n\n#FY26NATAID\n\nWhat we offer you\nAt EY, we’ll develop you with future-focused skills and equip you with world-class experiences. We’ll empower you in a flexible environment, and fuel you and your extraordinary talents in a diverse and inclusive culture of globally connected teams. Learn more.\n• We offer a comprehensive compensation and benefits package where you’ll be rewarded based on your performance and recognized for the value you bring to the business. The base salary range for this job in all geographic locations in the US is $124,300 to $227,900. The base salary range for New York City Metro Area, Washington State and California (excluding Sacramento) is $149,200 to $259,000. Individual salaries within those ranges are determined through a wide variety of factors including but not limited to education, experience, knowledge, skills and geography. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options.\n• Join us in our team-led and leader-enabled hybrid model. Our expectation is for most people in external, client serving roles to work together in person 40-60% of the time over the course of an engagement, project or year.\n• Under our flexible vacation policy, you’ll decide how much vacation time you need based on your own personal circumstances. You’ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.\n\nAre you ready to shape your future with confidence? Apply today.\nEY accepts applications for this position on an on-going basis.\n\nFor those living in California, please click here for additional information.\n\nEY focuses on high-ethical standards and integrity among its employees and expects all candidates to demonstrate these qualities.\n\nEY | Building a better working world\n\nEY is building a better working world by creating new value for clients, people, society and the planet, while building trust in capital markets.\n\nEnabled by data, AI and advanced technology, EY teams help clients shape the future with confidence and develop answers for the most pressing issues of today and tomorrow.\n\nEY teams work across a full spectrum of services in assurance, consulting, tax, strategy and transactions. Fueled by sector insights, a globally connected, multi-disciplinary network and diverse ecosystem partners, EY teams can provide services in more than 150 countries and territories.\n\nEY provides equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, pregnancy, genetic information, national origin, protected veteran status, disability status, or any other legally protected basis, including arrest and conviction records, in accordance with applicable law. \n\nEY is committed to providing reasonable accommodation to qualified individuals with disabilities including veterans with disabilities. If you have a disability and either need assistance applying online or need to request an accommodation during any part of the application process, please call 1-800-EY-HELP3, select Option 2 for candidate related inquiries, then select Option 1 for candidate queries and finally select Option 2 for candidates with an inquiry which will route you to EY’s Talent Shared Services Team (TSS) or email the TSS at ssc.customersupport@ey.com.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "JavaScript",
        "Java",
        "C++",
        "Go",
        "Rust",
        "Machine Learning",
        "Deep Learning",
        "AI",
        "SQL",
        "Git",
        "Azure"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-10T00:00:00.000Z",
      "url": "https://careers.ey.com/ey/job/New-York-AI-&-Machine-Learning-Engineer-Manager-Consulting-Open-Location-NY-10001-8604/1214642901/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Machine learning",
      "source": "JSearch API"
    },
    {
      "id": "RXI5fOZtqAUhO2OiAAAAAA==",
      "title": "Associate Research Director – Artificial Intelligence & Machine Learning",
      "company": "Two Six Technologies",
      "location": "Arlington, VA",
      "description": "At Two Six Technologies, we build, deploy, and implement innovative products that solve the world’s most complex challenges today. Through unrivaled collaboration and unwavering trust, we push the boundaries of what’s possible to empower our team and support our customers in building a safer global future.\nWhat You Will Do Working with technical leaders to set strategic direction for AI/ML R&D project portfolio Cultivating relationships with DARPA Program Managers and other customers Identifying new R&D opportunities and overseeing capture Cultivating our AI/ML/Data Science talent team in collaboration with other team leaders, identifying/hiring new team members and line management of key contributors Technical marketing of Two Six Technologies’ AI/ML/Data Science services and capabilities to new and existing Government clients Required Experience And Skills A four-year degree in Mathematics, Computer Science, or related technical domain Ten or more years of professional experience in R&D Leadership Past performance as a Principal Investigator on fast‑paced, innovation‑driven, advanced technology R&D projects for Government clients, especially DARPA Proven track record of capturing Government R&D contracts/programs DoD and/or IC domain experience and knowledge Active TS clearance with SCI eligibility Nice To Have Skills Advanced degree (Master’s or PhD) in Mathematics, Computer Science, or related technical domain Academic and/or industry publications in relevant fields Experience as a Principal Investigator for a DARPA program Experience collaborating across teams of specialists to produce innovative new scientific or technological capabilities Experience with the full research lifecycle (proposal to publication/transition) and software development lifecycle (from concept to prototype and production) Experience developing AI/ML solutions and products as well as software development & deployment Proven experience leading rapidly growing teams Clearance Active TS clearance with SCI eligibility\n\nTwo Six Technologies is committed to providing competitive and comprehensive compensation packages that reflect the value we place on our employees and their contributions. Our offerings include medical, dental, vision, life and disability insurance, retirement benefits, paid leave, tuition assistance and professional development.\n\nSalary Range: $174,200 – $261,300 USD\n\nTwo Six Technologies is an Equal Opportunity Employer and does not discriminate in employment opportunities or practices based on race, color, religion, national origin, sex (including pregnancy, childbirth or related medical conditions and lactation), sexual orientation, gender identity or expression, age (40 and over), marital status, disability, genetic information, protected veteran status, or any other characteristic protected by applicable federal, state, or local law.\n\n#J-18808-Ljbffr",
      "job_type": "Full-time",
      "required_skills": [
        "Go",
        "Rust",
        "AI"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-16T00:00:00.000Z",
      "url": "https://www.whatjobs.com/jobs/machine-learning?id=2202817859&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Machine learning",
      "source": "JSearch API"
    },
    {
      "id": "gGXZRQPGGEUsFyueAAAAAA==",
      "title": "Generative AI & Machine Learning Engineer",
      "company": "Thomson Reuters",
      "location": "McLean, VA",
      "description": "Are you passionate about the chance to bring your data quality improvement experience to a world class organization that is leading the way in both content and technology to serve and protect our citizens home and abroad? Do you have the skills necessary to manage, understand, and analyze inhouse and customer data including text mining, developing predictive systems, risk scoring, creating efficient algorithms, data quality improvement and other related activities? Then Thomson Reuters Special Services (TRSS) is looking for you!\n\nAbout the Role\nAs a Generative AI and Machine Learning Engineer, you will be responsible for supporting product development efforts that range from generative AI and machine learning application development and deployment to model development and monitoring, ML management and DevOps. You will be a contributing member of a Software Engineering team that supports production applications and also helping to develop new features and models.\n\nThe role will interface with internal and external stakeholders and provide continuity of technical and data-exploration expertise to ensure we are delivering a workable solution that meets the customer requirements and technical capabilities. The position requires a proactive, mission-oriented person who strives to produce the best possible work for the customer.\n\nAs a Generative AI and Machine Learning Engineer, you will:\n• Experiment and Develop: You will drive the end-to-end model development lifecycle, championing best practices to ensure reproducible research and well-managed software delivery.\n• Collaborate: Working on a collaborative cross-functional team, you will share information, value diverse ideas, and partner effectively with colleagues across the globe. You will elevate and mentor teammates. You will work closely with product teams to see your work integrated and deployed into production environments.\n• Deliver: With a sense of urgency and the desire to work in a fast-paced, dynamic environment, you will translate complex business problems into projects with clearly defined scope. Our problems are complex; our solutions are right-sized. You will be accountable for timely, well-managed deliverables.\n• Innovate: You will be empowered to try new approaches and learn new technologies. You will foster innovative ideas to solve real-world challenges. You will iterate on improvement rapidly with a mindset for failing fast and learning continuously from data.\n• Inspire: You will be a proactive communicator who is excited to share your work. You will be articulate and compelling in describing ideas to both technical and non-technical audiences. You will help lead the way in the adoption of AI across the enterprise.\n\nAbout you\nYou're a good fit for the role of Generative AI & Machine Learning Engineer if you have:\n• Master’s or Bachelor’s in a relevant discipline. Relevant experience will be considered in lieu of a degree\n• Proficiency in Python\n• At least 3+ years practical, relevant experience building AI/ML products and applications and recent demonstratable experience using Generative AI technologies such as RAG patterns, ReAct, LangChain etc for performing document summarization, knowledge graphs, information extraction, or analysis.\n• Solid software engineering skills and experience\n• Experience as a technical leader, leading aspects of the following :aiding in the ideation with product stakeholders, comfort in dealing with uncertainty and ambiguity in problem statements and paths to success, breaking down complex problems into tractable components with iterative improvements, formulating research and development plans, coordinating and working with others, communication of progress and plans with varied stakeholders\n• Hands on coding experience on AI/ML projects in current role and experience in designing, developing, and implementing machine learning models and algorithms\n• Ability to obtain and maintain a U.S. national security clearance\n• U.S. Citizenship essential to comply with government contract/agency or department of Federal Government requirements\n\nThe following skills and tools are preferred, but not required\n• 6+ years practical experience using AI and ML to solve diverse and/or ambiguous problems in academia or industry\n• Experience with AI Agent frameworks and patterns\n• Familiarity with common NLP use cases such as chatbot development and information retrieval (RAG), language translation, NER, summarization and topic modeling\n• Familiarity with LLM training and efficient finetuning (PEFT, LoRA, Quantization)\n• Experience with NLP/CV libraries such as PyTorch, TensorFlow, Scikit-learn, spaCy, HuggingFace Transformers/Diffusers, OpenAI, LangChain, Semantic Kernel & OpenCV\n• Experience using Cloud solutions (AWS, Azure, etc.) for building and deploying applications\n• Experience in a fast-paced, agile environment managing uncertainty and ambiguity.\n• Proficiency in Python and experience delivering minimum viable products in a large enterprise environment\n• Experience developing libraries and APIs for others to use\n• Outstanding communication and data-driven decision-making collaboration with Product + Business Stakeholders\n• Diverse experiences across problem spaces, companies and cultures\n\n#LI-CS1\n\nWhat’s in it For You?\n• Hybrid Work Model: We’ve adopted a flexible hybrid working environment (2-3 days a week in the office depending on the role) for our office-based roles while delivering a seamless experience that is digitally and physically connected.\n• Flexibility & Work-Life Balance: Flex My Way is a set of supportive workplace policies designed to help manage personal and professional responsibilities, whether caring for family, giving back to the community, or finding time to refresh and reset. This builds upon our flexible work arrangements, including work from anywhere for up to 8 weeks per year, empowering employees to achieve a better work-life balance.\n• Career Development and Growth: By fostering a culture of continuous learning and skill development, we prepare our talent to tackle tomorrow’s challenges and deliver real-world solutions. Our Grow My Way programming and skills-first approach ensures you have the tools and knowledge to grow, lead, and thrive in an AI-enabled future.\n• Industry Competitive Benefits: We offer comprehensive benefit plans to include flexible vacation, two company-wide Mental Health Days off, access to the Headspace app, retirement savings, tuition reimbursement, employee incentive programs, and resources for mental, physical, and financial wellbeing.\n• Culture: Globally recognized, award-winning reputation for inclusion and belonging, flexibility, work-life balance, and more. We live by our values: Obsess over our Customers, Compete to Win, Challenge (Y)our Thinking, Act Fast / Learn Fast, and Stronger Together.\n• Social Impact: Make an impact in your community with our Social Impact Institute. We offer employees two paid volunteer days off annually and opportunities to get involved with pro-bono consulting projects and Environmental, Social, and Governance (ESG) initiatives.\n• Making a Real-World Impact: We are one of the few companies globally that helps its customers pursue justice, truth, and transparency. Together, with the professionals and institutions we serve, we help uphold the rule of law, turn the wheels of commerce, catch bad actors, report the facts, and provide trusted, unbiased information to people all over the world.\n\nIn the United States, Thomson Reuters offers a comprehensive benefits package to our employees. Our benefit package includes market competitive health, dental, vision, disability, and life insurance programs, as well as a competitive 401k plan with company match. In addition, Thomson Reuters offers market leading work life benefits with competitive vacation, sick and safe paid time off, paid holidays (including two company mental health days off), parental leave, sabbatical leave. These benefits meet or exceeds the requirements of paid time off in accordance with any applicable state or municipal laws. Finally, Thomson Reuters offers the following additional benefits: optional hospital, accident and sickness insurance paid 100% by the employee; optional life and AD&D insurance paid 100% by the employee; Flexible Spending and Health Savings Accounts; fitness reimbursement; access to Employee Assistance Program; Group Legal Identity Theft Protection benefit paid 100% by employee; access to 529 Plan; commuter benefits; Adoption & Surrogacy Assistance; Tuition Reimbursement; and access to Employee Stock Purchase Plan.\n\nThomson Reuters complies with local laws that require upfront disclosure of the expected pay range for a position. The base compensation range varies across locations.\nEligible office location(s) for this role include one or more of the following: New York City, San Francisco, Los Angeles, and/or Irvine, CA; McLean, VA; Washington, DC. The base compensation range for the role in any of those locations is $134,680 - $250,120.\nThis role may also be eligible for an Annual Bonus based on a combination of enterprise and individual performance.\nBase pay is positioned within the range based on several factors including an individual’s knowledge, skills and experience with consideration given to internal equity. Base pay is one part of a comprehensive Total Reward program which also includes flexible and supportive benefits and other wellbeing programs.\n\nAbout Us\n\nThomson Reuters informs the way forward by bringing together the trusted content and technology that people and organizations need to make the right decisions. We serve professionals across legal, tax, accounting, compliance, government, and media. Our products combine highly specialized software and insights to empower professionals with the data, intelligence, and solutions needed to make informed decisions, and to help institutions in their pursuit of justice, truth, and transparency. Reuters, part of Thomson Reuters, is a world leading provider of trusted journalism and news.\n\nWe are powered by the talents of 26,000 employees across more than 70 countries, where everyone has a chance to contribute and grow professionally in flexible work environments. At a time when objectivity, accuracy, fairness, and transparency are under attack, we consider it our duty to pursue them. Sound exciting? Join us and help shape the industries that move society forward.\n\nAs a global business, we rely on the unique backgrounds, perspectives, and experiences of all employees to deliver on our business goals. To ensure we can do that, we seek talented, qualified employees in all our operations around the world regardless of race, color, sex/gender, including pregnancy, gender identity and expression, national origin, religion, sexual orientation, disability, age, marital status, citizen status, veteran status, or any other protected classification under applicable law. Thomson Reuters is proud to be an Equal Employment Opportunity Employer providing a drug-free workplace.\n\nWe also make reasonable accommodations for qualified individuals with disabilities and for sincerely held religious beliefs in accordance with applicable law. More information on requesting an accommodation here.\n\nLearn more on how to protect yourself from fraudulent job postings here.\n\nMore information about Thomson Reuters can be found on thomsonreuters.com.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "Rust",
        "React",
        "Machine Learning",
        "AI",
        "Git",
        "AWS",
        "Azure"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-09-27T00:00:00.000Z",
      "url": "https://careers.thomsonreuters.com/us/en/job/JREQ193871/Generative-AI-Machine-Learning-Engineer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Machine learning",
      "source": "JSearch API"
    },
    {
      "id": "Uyf2mt0GbHb2xLwfAAAAAA==",
      "title": "Machine Learning Engineer-Secret Clearance",
      "company": "Talent Stack LLC",
      "location": "Washington, DC",
      "description": "Job Title: Machine Learning Engineer-Member of Technical Staff\n\nClearance Level: DOD Secret Clearance needed (TS/SCI preferred)\n\nLocation: Washington, DC (Hybrid, SCIF access required)\n\nSalary: $150K - $215K + Equity 5,000 Shares\n\nAbout the Company\n\nThis role bridges machine learning, data engineering, and software development, driving innovation in high-impact AI applications that support mission-critical work. Ideal candidates thrive in fast-paced, collaborative environments where implementation and problem-solving are central.\n\nAbout the Role:\n\nSeeking a versatile engineer who excels at the intersection of ML and software engineering. The ideal candidate has production ML deployment experience, strong Python skills with data libraries, and experience with big data technologies. They should be comfortable tackling performance optimization challenges and have exceptional problem-solving capabilities. Experience with government/defense applications is highly valued.\n\nWhat You’ll Do:\n• Spearhead platform upgrades to keep solutions at the forefront of innovation.\n• Build and manage dynamic dashboards using Python SDKs to deliver intuitive, actionable insights.\n• Optimize data access patterns to ensure system efficiency and performance.\n• Troubleshoot and resolve runtime performance issues for responsive, stable applications.\n• Architect robust, scalable, and user-friendly applications with an eye toward growth.\n• Collaborate with product managers and technical stakeholders to deliver usability enhancements.\n\nWhat You Won’t Do:\n• Be siloed into one area—this role requires versatility across ML, data, and software engineering.\n• Focus solely on research without implementation—this is a hands-on engineering role.\n\nQualifications:\n• Active and/or Transferable U.S. Government DOD Security Clearance (minimum Secret, TS/SCI preferred).\n• Bachelors Degree in Computer Science (Masters Degree preferred)\n• 4+ years of experience in ML engineering, data engineering, or software development.\n• 4+ years in Python-based data engineering Stack (pandas, numpy, scikit- learn, pytorch, plotly, etc. )\n• Experience with the production deployment of ML solutions (preferably in secure or classified environments).\n• Experience collaborating with cross-functional teams in mission-driven projects.\n• Familiarity with Docker, Kubernetes, and Git.\n• Proven track record of deploying software into production environments.\n• Experience with big data technologies and frameworks (Spark, Databricks, Snowflake, etc).\n• Exceptional problem-solving skills and a keen sense of ownership.\n• Excellent communication skills in English, both written and verbal.\n\nPreferred Skills:\n• Experience in Machine Learning Engineering roles and the end-to-end lifecycle of AI applications, from model development to deployment.\n• Experience with Predictive Maintenance, US AF System of Record Data Sources, Supply Chain, Scheduling Optimization, etc.\n• Experience with Cyber Analytics, PCAP and network monitoring, CVEs and Cyber Vulnerabilities, etc.\n• 1+ year of experience with technologies like task schedulers (e.g. Celery, Airflow, Prefect, etc.) and web-app development stacks (e.g. Flask/Django) or app building kits like Streamlit/Plotly Dash.\n\nWork Environment & Benefits:\n• 40-hour work week with flexible start/end times (core hours 10am–4pm).\n• Hybrid schedule in the DMV area with the expectation of working in SCIFs as required: Travel requirements include weekly visits to SCIFs in the DC/Northern Virginia area.\n• Travel to customer sites outside this area occurs approximately once every quarter, six months, or a year.\n• Open to occasional travel to headquarters in Pasadena, CA, or other U.S. customer sites.\n• Competitive compensation package.\n• Growth opportunities into senior engineering or technical leadership roles.\n\nCompensation and Benefits:\n\nSalary: $150K - $215K + Equity 5,000 Shares\n• Competitive salary/equity/bonus based on experience and education.\n• Comprehensive benefits package including medical, dental, and vision.\n• Unlimited paid time off.\n\nAdditional Details:\n• Full-time role.\n• U.S. Citizenship required.\n• Visa sponsorship not available.\n\nRecruitment Agencies Disclaimer: This position is posted for direct applicants only. We kindly request that external recruiters, staffing agencies, or search firms refrain from submitting candidates. Unsolicited resumes will be treated as direct applications, and no agency fees will be honored.\n\nJob Reference: P5",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "Django",
        "Flask",
        "Machine Learning",
        "AI",
        "Git",
        "Docker",
        "Kubernetes"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-15T00:00:00.000Z",
      "url": "https://www.linkedin.com/jobs/view/machine-learning-engineer-secret-clearance-at-talent-stack-llc-4305126116?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Machine learning",
      "source": "JSearch API"
    },
    {
      "id": "R1LwgWIZ9CnZtpzHAAAAAA==",
      "title": "Staff Machine Learning EngineerNew Washington, DC - Remote",
      "company": "Angie's List",
      "location": "Washington, DC",
      "description": "About the position\n\nResponsibilities\n• Lead development of machine learning models and algorithms to improve search ranking and consumer-pro matching.\n• Implement robust MLOps practices for seamless deployment and scalability of machine learning models.\n• Collaborate with engineers, data scientists, product managers, and designers to build scalable machine learning systems.\n• Foster innovation within the team by exploring new approaches to solve complex business problems.\n• Guide junior team members and promote a culture of continuous learning and technical excellence.\n\nRequirements\n• Master's or Ph.D. in a quantitative field (e.g., Computer Science, Statistics, Mathematics, or related fields).\n• 7+ years of experience in data science & machine learning, focusing on real-time ML models, preferably in tech industry & marketplace environments.\n• Expertise in machine learning and deep learning, with knowledge of large language models.\n• Proven track record of deploying impactful machine learning models into production environments.\n• Proficiency in SQL and Python, with experience in cloud ML solutions.\n• Excellent communication skills to convey complex technical concepts to non-technical stakeholders.\n\nBenefits\n• Salary band ranging from \\$200,000 - \\$280,000 commensurate with experience and performance.\n• Eligibility for a competitive year-end performance bonus & equity package.\n• Full medical, dental, vision package.\n• Flexible vacation policy.\n• Pet discount plans.\n• Retirement plan with company match (401K).",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "Machine Learning",
        "Deep Learning",
        "SQL"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": null,
      "url": "https://www.tealhq.com/job/staff-machine-learning-engineer-new-washington-dc-remote_b91ac995-fb18-4f48-ad93-f246bea3b738?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Machine learning",
      "source": "JSearch API"
    },
    {
      "id": "LG8YFPj7Hc_7Yng7AAAAAA==",
      "title": "Senior Applied Machine Learning Engineer, Frontier AI",
      "company": "Anduril Industries",
      "location": "Washington, DC",
      "description": "Anduril Industries is a defense technology company with a mission to transform U.S. and allied military capabilities with advanced technology. By bringing the expertise, technology, and business model of the 21st century’s most innovative companies to the defense industry, Anduril is changing how military systems are designed, built and sold. Anduril’s family of systems is powered by Lattice OS, an AI-powered operating system that turns thousands of data streams into a realtime, 3D command and control center. As the world enters an era of strategic competition, Anduril is committed to bringing cutting-edge autonomy, AI, computer vision, sensor fusion, and networking technology to the military in months, not years.\n\nAbout The Team\n\nAnduril’s Lattice software platform integrates together many sensors into a single cohesive view of the world, providing needed context for our users. AI Engineers on Anduril’s Frontier AI team build edge-compatible, generative AI systems into the Lattice software platform to provide features and products that improve autonomy and reduce cognitive burden on the warfighter. Specific applications include but are not limited to automating mission planning, battle-space understanding, voice-control of assets, and enabling higher-levels of autonomy.\n\nWhat You'll Do\n• Distill and fine-tune transformer architectures so they can be deployed onto edge devices or compute denied environments\n• Propose and prototype LLM-based Agentic systems that help solve real world problems, leveraging the latest state-of-the-art techniques in the field\n• Develop and maintain mission relevant benchmarks\n• Work cross-functionally with different business lines across Anduril to help discover and scope new research problems.\n\nRequired Qualifications\n• BS in Computer Science, Machine Learning, Electrical Engineering, or related field\n• 5+ years experience developing and benchmarking ML algorithms\n• Experience pushing and maintaining ML algorithms in production\n• Strong Python skills with experience in ML frameworks such as PyTorch\n• Must be a U.S. Citizen and eligible to obtain and maintain a U.S. Government clearance\n\nPreferred Qualifications\n• Experience fine-tuning transformer-based model\n• Experience deploying deep-learning based models to edge devices or air gapped environments\n• Prior experience in defense tech or start-up\n\nUS Salary Range\n\n$220,000—$292,000 USD\n\nHealthcare Benefits\n\nThe salary range for this role is an estimate based on a wide range of compensation factors, inclusive of base salary only. Actual salary offer may vary based on (but not limited to) work experience, education and/or training, critical skills, and/or business considerations. Highly competitive equity grants are included in the majority of full time offers; and are considered part of Anduril's total compensation package. Additionally, Anduril offers top-tier benefits for full-time employees, including:\n• US Roles: Comprehensive medical, dental, and vision plans at little to no cost to you.\n• UK & AUS Roles: We cover full cost of medical insurance premiums for you and your dependents.\n• IE Roles: We offer an annual contribution toward your private health insurance for you and your dependents.\n\nAdditional Benefits\n• Income Protection: Anduril covers life and disability insurance for all employees.\n• Generous time off: Highly competitive PTO plans with a holiday hiatus in December. Caregiver & Wellness Leave is available to care for family members, bond with a new baby, or address your own medical needs.\n• Family Planning & Parenting Support: Coverage for fertility treatments (e.g., IVF, preservation), adoption, and gestational carriers, along with resources to support you and your partner from planning to parenting.\n• Mental Health Resources: Access free mental health resources 24/7, including therapy and life coaching. Additional work-life services, such as legal and financial support, are also available.\n• Professional Development: Annual reimbursement for professional development\n• Commuter Benefits: Company-funded commuter benefits based on your region.\n• Relocation Assistance: Available depending on role eligibility.\n\nRetirement Savings Plan\n• US Roles: Traditional 401(k), Roth, and after-tax (mega backdoor Roth) options.\n• UK & IE Roles: Pension plan with employer match.\n• AUS Roles: Superannuation plan.\n\nThe recruiter assigned to this role can share more information about the specific compensation and benefit details associated with this role during the hiring process.\n\nTo view Anduril's candidate data privacy policy, please visit https://anduril.com/applicant-privacy-notice/.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "Machine Learning",
        "AI"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-10T00:00:00.000Z",
      "url": "https://www.linkedin.com/jobs/view/senior-applied-machine-learning-engineer-frontier-ai-at-anduril-industries-4302828531?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Machine learning",
      "source": "JSearch API"
    },
    {
      "id": "_pqrBZmp-8gt7d6eAAAAAA==",
      "title": "Machine Learning Engineer - Medical NLP",
      "company": "Newwave Telecom & Technologies",
      "location": "Columbia, MD",
      "description": "Description:\n\nWe have an upcoming project that will be short term development of Proof of Concept, and when successful, will bring opportunity for long term. We need a talented machine learning engineer focused on medical natural language processing, implementing AI models for clinical document analysis and medical text understanding. If this is you, read on.\n\nKey Responsibilities:\n• Develop machine learning models for medical document processing and clinical text analysis\n• Implement natural language processing pipelines for healthcare data extraction\n• Create AI-powered medical document categorization and clinical coding systems\n• Develop medical entity recognition and clinical concept extraction models\n• Implement machine learning model deployment and monitoring for healthcare applications\n• Create AI model validation and testing frameworks for medical NLP applications\n• Optimize machine learning model performance and scalability for healthcare data\n• Coordinate with data engineers for AI model integration and deployment\nRequirements:\n• Master's degree in Machine Learning, Computer Science, or related field\n• 7+ years of machine learning experience with 3+ years in medical NLP and healthcare AI\n• Expert knowledge of natural language processing and medical text analysis\n• Experience with machine learning frameworks and healthcare AI model development\n• Strong background in clinical text processing and medical terminology extraction\n• Knowledge of healthcare data standards and medical coding systems\n• Experience with AI model deployment and monitoring for healthcare applications\n• Understanding of healthcare regulations and AI model validation requirements\n\nPreferred Qualifications:\n• Degree in Machine Learning or related field with healthcare focus\n• Experience with clinical decision support systems and medical AI applications\n• Background in medical informatics and clinical data analysis\n• Knowledge of medical imaging AI and multimodal healthcare AI application",
      "job_type": "Full-time",
      "required_skills": [
        "Go",
        "Machine Learning",
        "AI",
        "Data Analysis"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-15T00:00:00.000Z",
      "url": "https://www.ziprecruiter.com/c/Newwave-Telecom-&-Technologies/Job/Machine-Learning-Engineer-Medical-NLP/-in-Columbia,MD?jid=c9f810a7e0e0ec6b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Machine learning",
      "source": "JSearch API"
    },
    {
      "id": "iX7u3Hv6kqfHqgiAAAAAAA==",
      "title": "Agentic AI & Machine Learning Engineer",
      "company": "Phase2 Technology",
      "location": "Alexandria, VA",
      "description": "The Opportunity\n\nAs an experienced machine learning engineer, you understand good software is more than just a good user experience. To compete in today's technical landscape, mission-oriented machine learning solutions must be architected, designed, and built to handle fast-moving data, seamlessly scale with infrastructure based on system usage, and expand based on evolving mission requirements. We're looking for an engineer like you to create artificial intelligence and machine learning enabled solutions that help solve our toughest challenges facing the health sector.\n\nOn our team, you'll design, create, and implement complete AI systems that will transform client operations, increase data accessibility, and optimize AI and ML systems. You'll ensure that your team's solutions consider the broader ecosystem and operating environment as well as future functionality and enhancements. Additionally, you'll deepen your skill set in areas like software engineering, machine learning and AI operations (MLOps and AIOps), and software deployment and integration into a health mission environment.\n\nJoin us. The world can't wait.\nYou Have\n• 5+ years of experience designing, developing, and deploying AI or ML applications\n• 1+ years of experience with multi-agent systems, orchestration frameworks, or agentic AI architecture\n• Experience integrating LLMs such as OpenAI, Anthropic, LLaMA, or Mistral into production systems using APIs, fine-tuning, and embeddings\n• Experience implementing agent communication protocols such as MCP, A2A, or tool integrations and designing stateful workflows with runtime adaptability\n• Experience working in cloud platforms such as AWS, Azure, or GCP, using Git for versioning and collaboration, and with MLOps practices, including containerization, orchestration, and CI/CD for AI workloads\n• Experience incorporating external tools and APIs, including database, search, vector stores, or cloud services, into agent workflows for real-world problem solving\n• Experience evaluating architectural tradeoffs and designing robust service-based software applications for scalable use\n• Ability to architect with Python and modern AI development stacks, including LangChain, LangGraph, or Haystack\n• Ability to obtain and maintain a Public Trust or Suitability/Fitness determination based on client requirements\n• Bachelor's degree in a Computer Science, Machine Learning, or Data Science field\n\nNice If You Have\n• Experience with Agile methodologies and best practices\n• Experience in federal or highly regulated environments with compliance standards such as FedRAMP or HIPAA\n• Knowledge of data governance, compliance, and ethical AI practices\n• Ability to implement controls for bias, lineage, and auditability\n• Ability to adapt in a rapidly changing environment\n• Ability to optimize prompt engineering, tool selection, and orchestration strategies for cost and latency\n• Ability to collaborate across multi-disciplinary teams of data scientists, engineers, product owners, and domain experts\n• Possession of excellent written and verbal communication skills\n• Possession of excellent interpersonal, analytical, problem-solving, and organizational skills\n• Master's degree\n\nVetting\n\nApplicants selected will be subject to a government investigation and may need to meet eligibility requirements of the U.S. government client.\nCompensation\n\nAt Booz Allen, we celebrate your contributions, provide you with opportunities and choices, and support your total well-being. Our offerings include health, life, disability, financial, and retirement benefits, as well as paid leave, professional development, tuition assistance, work-life programs, and dependent care. Our recognition awards program acknowledges employees for exceptional performance and superior demonstration of our values. Full-time and part-time employees working at least 20 hours a week on a regular basis are eligible to participate in Booz Allen's benefit programs. Individuals that do not meet the threshold are only eligible for select offerings, not inclusive of health benefits. We encourage you to learn more about our total benefits by visiting the Resource page on our Careers site and reviewing Our Employee Benefits page.\n\nSalary at Booz Allen is determined by various factors, including but not limited to location, the individual's particular combination of education, knowledge, skills, competencies, and experience, as well as contract-specific affordability and organizational requirements. The projected compensation range for this position is $99,000.00 to $225,000.00 (annualized USD). The estimate displayed represents the typical salary range for this position and is just one component of Booz Allen's total compensation package for employees. This posting will close within 90 days from the Posting Date.\nIdentity Statement\n\nAs part of the application process, you are expected to be on camera during interviews and assessments. We reserve the right to take your picture to verify your identity and prevent fraud.\nWork Model\n\nOur people-first culture prioritizes the benefits of flexibility and collaboration, whether that happens in person or remotely.\n• If this position is listed as remote or hybrid, you'll periodically work from a Booz Allen or client site facility.\n• If this position is listed as onsite, you'll work with colleagues and clients in person, as needed for the specific role.\nCommitment to Non-Discrimination\n\nAll qualified applicants will receive consideration for employment without regard to disability, status as a protected veteran or any other status protected by applicable federal, state, local, or international law.",
      "job_type": "Full-time and Part-time",
      "required_skills": [
        "Python",
        "Go",
        "Rust",
        "Machine Learning",
        "AI",
        "Git",
        "AWS",
        "Azure",
        "GCP"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-12T00:00:00.000Z",
      "url": "https://jobs.womenforhire.com/job/usa/alexandria-va/agentic-ai-machine-learning-engineer-708707/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Machine learning",
      "source": "JSearch API"
    }
  ],
  "total": 31,
  "scraped_at": "2025-10-18T15:51:03.026132",
  "errors": []
}