{
  "jobs": [
    {
      "id": "bTzUv-8Qb52PoibxAAAAAA==",
      "title": "Python Developer (SAS Experience) - REMOTE",
      "company": "KATMAI",
      "location": "Washington, DC",
      "description": "Job Description:\n\nSUMMARY\n\nProvide support to the U.S. Census Bureau's Demographic Systems Division (DSD) by offering Python development services in support of DSD’s migration of survey processing systems from Statistical Analysis System (SAS) to Python.\n\nESSENTIAL DUTIES & RESPONSIBILITIES\n• Assist with the development and documentation of the rewrite of The Survey of Income and Program Participation (SIPP) production processing system into a Python codebase. The scope of the SIPP Production processing consists of 200+ edit programs. (Revamp SIPP system, named SIPP Seamless, is currently in its planning phase).\n• Support the ongoing SIPP production system and the SIPP Seamless system.\n• Assist DSD with the implementation of Python code solutions using efficient methodologies to utilize the language’s strengths.\n• Assist DSD in analyzing existing SAS-based system to glean functional requirements to develop optimized, Python-based solutions.\n• Write high quality code that is well-documented and easy to read, use, and maintain.\n• Use Python to read and reformat large datasets.\n• Improve Python code performance.\n• Attend branch meetings and share technical knowledge clearly.\n• Work with customers and subject matter experts to capture and document business needs and processes through meetings and requirements gathering.\n• Make recommendations concerning the feasibility of revising existing applications or developing new approaches to utilize resources more effectively.\n• Troubleshoot issues as needed and work with appropriate resources to resolve problems.\n• Assist DSD with developing proof-in-concepts, pilots, and alternatives analysis.\n• Provide thorough documentation based on Census Bureau and/or DSD standards. Documentation includes but is not limited to formal specifications and/or systems logical diagrams, training, and in-code documentation.\n• Participate in code and peer reviews, as well as formal walkthroughs as directed.\n• Conduct formal presentations and provide written documents outlining any issues and concerns to Census Management.\n• Utilize DSD version control system regularly to ensure all developed code is readily available to Census staff.\n• Review the existing software systems and make recommendations to improve the design.\n• Provide weekly and/or daily status reports in requested format to tasks manager or as directed.\n• Work with and train designated Census Bureau IT specialists to ensure that the system is fully understood by those designated individuals responsible for maintaining the system once released to production.\n• Maintain regular communications with team as required.\n• Complete tasks using, but not limited to, technologies such as:\n• Python related packages, tools, and products such as NumPy, Pandas, Anaconda, Jupyter Notebook, and VS code\n• SAS Software such as Advanced Base SAS, SAS Macro Language, and SAS ODS software\n• PostgreSQL Databases and related languages, tools, and products such as pgAdmin, and PL/pgSQL\n• Version control software such as Git, GitLab or GitHub\n• Linux terminal or other tools to allow for executing from the command line\n• Microsoft suite including Word, Excel, PowerPoint, SharePoint, and Teams\n• The following deliverables are required:\n• Finalized Python modules and code for performing identified, demographic edits for the SIPP survey\n• ISPB Python Programming Standards and Guidelines document\n• Regular status reports\n• Presentation and training material\n• Evaluation and recommendation for database implementation\n• Python code stored a version control software, such as SVN or GitLab\n• Maintain regular and punctual attendance.\n• Perform other duties as assigned.\n\nSUPERVISORY RESPONSIBILITIES\n\nNone.\n\nJob Requirements:\n\nMINIMUM QUALIFICATIONS\n• Bachelor’s degree in computer science or related field is preferred.\n• Five (5) to seven (7) years of related experience with backend and front-end development, relational database and developing applications or equivalent combination of experience preferred.\n• Knowledge of using GitLab or GitHub to configure pipelines for CI/CD.\n• Experience using Python to read and reformat large data files.\n• Experience improving code performance: able to profile and refactor code and find bottlenecks and overheads, preferably on production code.\n• Experience writing high quality code: well-documented and easy to read, use, maintain, and extend.\n• Experienced with Linux, able to perform basic commands as an end user.\n• Experience with data validation in a statistical processing environment.\n• Familiarity with SAS code.\n• Familiarity with database designs that balance usability with functionality.\n• Must pass the Census Bureau Security Investigation / background investigation.\n• Must obtain and maintain any necessary security access and/or background checks.\n\nDESIRED QUALIFICATIONS & SKILLS\n• Cloud computing, preferably with Amazon Web Service is a plus.\n• Statistical Analysis System (SAS) programming experience is a plus.\n• Excellent verbal and written communication skills.\n\nWORK SCHEDULE\n\nFull-time. May be required to work additional hours as needed to complete assignment or project.\n\nTRAVEL\n\nNone.\n\nDRIVING REQUIREMENTS\n\nNone.\n\nWORK ENVIRONMENT\n\nWork is expected to be remote; however, the company reserves the right to require onsite work.\n\nPHYSICAL DEMANDS\n\nPosition consists of sitting for long periods of time, using hands/ fingers, handling, reaching with hands and arms, speaking, or translating. Periods of walking, standing, bending, kneeling, stooping, crouching, and lifting equipment weighing up to 10 pounds. Moderate to extended periods of office work with heavy periods of computer usage. It is Katmai’s business philosophy and practice to provide reasonable accommodations, according to applicable state and federal laws, to all qualified individuals with physical or mental disabilities.\n\nCOMPENSATION & BENEFITS PACKAGE\n• Pay range: $145k to $150k per year.\n• Eligible Benefits: Medical, Dental, Vision, Life & AD&D Insurance, Long-Term & Short-Term Disability Insurance, 401(k) Savings Plan, Employee Assistance Program (EAP), Paid Time Off (PTO), 11 Paid Federal Holidays, and Leave of Absence.\n\nCompliance:\n\nTo be considered for this position, all applicants must apply on the company website, https://katmaicorp.com/life-at-katmai/\n\nWe are a VEVRAA Federal Contractor\n\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity or national origin, disability status, protected veteran status, marital status, familial status or any other characteristic protected by law. https://katmaicorp.com/life-at-katmai/#equal_opportunity Preference will be given to Ouzinkie Shareholders, Descendants of Shareholders and Spouses of Shareholders in accordance with Title 43 U.S. Code 1626(g) and Title 42 U.S. Code 2000e - 2(i).",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "AI",
        "SQL",
        "Git",
        "AWS",
        "PostgreSQL"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": null,
      "url": "https://www.indeed.com/viewjob?jk=54911db3e75a34eb&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Python developer",
      "source": "JSearch API"
    },
    {
      "id": "eUVpWgQ53P8omNfwAAAAAA==",
      "title": "Full Stack Developer - Python",
      "company": "DRC Systems",
      "location": "McLean, VA",
      "description": "Only W2 (No H1B, No C2C, No Third Party)\n\nTitle: Full Stack Developer-Python\n\nLocation: McLean, VA (5 days - Onsite)\n\nStart Date: ASAP! Apply Now\n\nNote: Only Local candidate with Finance/ Banking experience\n\nPosition Summary\n\nWe are seeking a highly experienced hands-on Full Stack Engineer to design and development of cutting-edge AI Agents, Agentic Workflows, and Gen AI Applications that solve complex business problems. This role requires advanced proficiency in Angular for front-end development and Python-based microservices for the orchestration layer deployed to AWS EKS (Kubernetes). You will serve as a hands-on engineer, working alongside Gen AI scientists, UX designers, product managers, and data engineers to shape and implement enterprise-grade Gen AI solutions.\n\nDeveloper-Full Stack Senior\n\nDevelopment of microservices based on Python, Pyspark, AWS EKS, AWS Postgres for a data-oriented modernization project\n\nNew System: Python and PySpark, AWS Postgres DB, Behave/Cucumber for automation, and Pytest\n\nPerform System, functional and data analysis on the current system and create technical/functional requirement documents.\n\nCurrent System: Informatica, SAS, AutoSys, DB2\n\nWrite automated tests using Behave/cucumber, based on the new micro-services-based architecture\n\nPromote top code quality and solve issues related to performance tuning and scalability.\n\nStrong skills in DevOps, Docker/container-based deployments to AWS EKS using Jenkins and experience with SonarQube and Fortify\n\nAble to communicate and engage with business teams and analyze the current business requirements (BRS documents) and create necessary data mappings.\n\nPreferred strong skills and experience in reporting applications development and data analysis.\n\nKnowledge in Agile methodologies and technical documentation.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Angular",
        "AI",
        "Data Analysis",
        "Docker",
        "Kubernetes",
        "AWS"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-15T00:00:00.000Z",
      "url": "https://www.linkedin.com/jobs/view/full-stack-developer-python-at-drc-systems-4315341603?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Python developer",
      "source": "JSearch API"
    },
    {
      "id": "TZo2PEjyAjoL-wJJAAAAAA==",
      "title": "Python Fullstack Developer( Python ,Angular and AWS)",
      "company": "Pyramid Consulting, Inc",
      "location": "McLean, VA",
      "description": "Immediate need for a talented Python Fullstack Developer( Python ,Angular and AWS). This is a 06 months contract opportunity with long-term potential and is located in Mclean, VA(Hybrid). Please review the job description below and contact me ASAP if you are interested.\n\nJob ID: 25-89100\n\nPay Range: $60 - $65/hour. Employee benefits include, but are not limited to, health insurance (medical, dental, vision), 401(k) plan, and paid sick leave (depending on work location).\n\nKey Responsibilities:\n• Develop and maintain scalable backend services using Python and AWS (Lambda, Glue, DynamoDB, SQS).\n• Collaborate with cross-functional teams to design and implement enhanced monitoring and vulnerability remediation for Expense Management systems.\n• Lead and support migration projects, including Gen3 migration and OTEL instrumentation.\n• Build and maintain front-end components using Angular, JavaScript, TypeScript, and CSS.\n• Contribute to the full software development lifecycle: design, development, testing, deployment, and support.\n• Participate in code reviews, mentoring, and knowledge sharing within the team.\n• Adapt to evolving business needs and technical challenges in both Expense Management and Lending domains.\n\nKey Requirements and Technology Experience:\n• Key Skills; Python, AWS , Angular , Javascript / Typescript\n• Strong proficiency in Python development.\n• Hands-on experience with AWS services, including Lambda, Glue, DynamoDB (DDB), and SQS.\n• Solid front-end development skills with Angular, JavaScript, TypeScript, and CSS.\n• Familiarity with cloud migration processes and monitoring solutions.\n• Experience working in agile development environments.\n• Ability to work independently and collaboratively in a fast-paced, capacity-constrained setting.\n• Strong problem-solving and communication skills.\n• Previous experience in financial services or lending platforms.\n• Knowledge of OpenTelemetry (OTEL) or similar monitoring frameworks.\n• Exposure to vulnerability management and security best practices.\n\nOur client is a leading Financial Industry, and we are currently interviewing to fill this and other similar contract positions. If you are interested in this position, please apply online for immediate consideration.\n\nPyramid Consulting, Inc. provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\n\nBy applying to our jobs you agree to receive calls, AI-generated calls, text messages, or emails from Pyramid Consulting, Inc. and its affiliates, and contracted partners. Frequency varies for text messages. Message and data rates may apply. Carriers are not liable for delayed or undelivered messages. You can reply STOP to cancel and HELP for help. You can access our privacy policy here.",
      "job_type": "Contractor",
      "required_skills": [
        "Python",
        "JavaScript",
        "Java",
        "Angular",
        "AI",
        "AWS",
        "CSS"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-14T00:00:00.000Z",
      "url": "https://www.linkedin.com/jobs/view/python-fullstack-developer-python-angular-and-aws-at-pyramid-consulting-inc-4314821875?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Python developer",
      "source": "JSearch API"
    },
    {
      "id": "S1PCayOulbDNX10CAAAAAA==",
      "title": "Python Senior Software Engineer",
      "company": "Walmart",
      "location": "Washington, DC",
      "description": "Position Summary...\n\nWhat you'll do...\n\nAs a part of Walmart Global Tech, you’ll build industry defining reusable customer and partner facing services and products to lead differentiated experiences and revenue. You will be in the unique position to be of service to both our customers (1P as well as 3P) and our associates as a member of this organization supporting all segments of Walmart. If you are the type of person who feels a personal stake in everything that you work on, has a love for data, enjoys solving complex problems, has a passion for privacy, knows how to foster strong relationships and build trust, and works for the success of the entire team.\n\nAbout Team:\nOur team works closely with our US stores and eCommerce business to better serve customers by empowering team members, stores, and merchants with technological innovation. From groceries and entertainment to sporting goods and crafts, Walmart U.S. offers an extensive selection that our customers value, whether they shop online at Walmart.com, through one of our mobile apps, or in-store. Focus areas include customers, stores and employees, in-store service, merchant tools, merchant data science, and search and personalization.\n\nWhat you'll do:\n• Design, build, and maintain high-performance front-end applications for our 1P and 3P customers.\n• Develop robust, maintainable, reusable code for managing functionality, configuration, deployment, monitoring, performance, scalability, availability, security, and alerting for software test, integration, and production environments.\n• Plan and implement a series of steps which potentially includes reconfiguration, integration, removal, or addition of application components to enhance the application's functionality, resiliency, usability, and security.\n• Understand the Business/Stakeholder/Technical requirements and assist in analyzing the existing solutions to address the needs. Assist in creation of simple, modular, extensible functional design for the product/solution in adherence to the requirements.\n• Assess gaps/ updates/ modifications between the customer/business expectations and the existing product/solutions.\n• Analyze defects from past projects/solutions to avoid recurrence of similar defects.\n• Analyze system performance impacting the complete product for non-functional requirements like reliability, operability, performance efficiency and security. Troubleshoot performance and availability bottlenecks for the application.\n• Develop, maintain, and enhance automated test cases (adopting Shift Left practice) and deployment procedures.\n• Follow coding and design best practices developed by the teams and contribute towards their continuous improvement.\n• Plan Hardware Capacity for high traffic business Events.\n• Design Build and maintain Observability aspects of application.\n• Review Peer Code and help create a culture of continuous improvements on the architecture.\n• Work with relevant stakeholders on launching AB tests for different functionalities getting rolled out.\n\nWhat you'll bring:\n• Experience in creating user interfaces using appropriate and relevant technologies (e.g., HTML 5 coding, CSS (Cascading Style Sheets) libraries like Bootstrap, etc.) using best practices and appropriate design patterns.\n• Relevant front end programming experience in relevant languages and frameworks (e.g., Java, Python, JavaScript, Spring, Node, React, Angular etc.)\n• Experience integrating with scalable back-end services (e.g., REST / graph-QL).\n• Experience in functional, integration and E2E (End 2 End) testing tools and practices.\n• Experience with code repositories and version control practices.\n• Experience with CI/CD pipelines and best practices. Automated deployment experience is a plus.\n• Experience in software quality and operational excellence practices.\n• Experience in agile development methodology.\n• Good analytical and problem-solving skills.\n\nAbout Walmart Global Tech\nImagine working in an environment where one line of code can make life easier for hundreds of millions of people. That’s what we do at Walmart Global Tech. We’re a team of software engineers, data scientists, cybersecurity expert's and service professionals within the world’s leading retailer who make an epic impact and are at the forefront of the next retail disruption. People are why we innovate, and people power our innovations. We are people-led and tech-empowered. We train our team in the skillsets of the future and bring in experts like you to help us grow. We have roles for those chasing their first opportunity as well as those looking for the opportunity that will define their career. Here, you can kickstart an illustrious career in tech, gain new skills and experience for virtually every industry, or leverage your expertise to innovate at scale, impact millions and reimagine the future of retail.\n\nFlexible, hybrid work:\nWe use a hybrid way of working that is primarily in the office coupled with virtual when not onsite. Our campuses serve as a hub to enhance collaboration, bring us together for purpose and deliver on business needs. This approach helps us make quicker decisions, remove location barriers across our global team and be more flexible in our personal lives.\n\n#MPAcceleration\n\nAt Walmart, we offer competitive pay as well as performance-based bonus awards and other great benefits for a happier mind, body, and wallet. Health benefits include medical, vision and dental coverage. Financial benefits include 401(k), stock purchase and company-paid life insurance. Paid time off benefits include PTO (including sick leave), parental leave, family care leave, bereavement, jury duty, and voting. Other benefits include short-term and long-term disability, company discounts, Military Leave Pay, adoption and surrogacy expense reimbursement, and more.\n\n‎\n\n‎\n\n‎\nYou will also receive PTO and/or PPTO that can be used for vacation, sick leave, holidays, or other purposes. The amount you receive depends on your job classification and length of employment. It will meet or exceed the requirements of paid sick leave laws, where applicable.\n\n‎\n\nFor information about PTO, see https://one.walmart.com/notices.\n\n‎\n\n‎\nLive Better U is a Walmart-paid education benefit program for full-time and part-time associates in Walmart and Sam's Club facilities. Programs range from high school completion to bachelor's degrees, including English Language Learning and short-form certificates. Tuition, books, and fees are completely paid for by Walmart.\n\n‎\nEligibility requirements apply to some benefits and may depend on your job classification and length of employment. Benefits are subject to change and may be subject to a specific plan or program terms.\n\n‎\n\nFor information about benefits and eligibility, see One.Walmart.\n\n‎\nThe annual salary range for this position is $108,000.00-$216,000.00\n\n‎\nAdditional compensation includes annual or quarterly performance bonuses.\n\n‎\nAdditional compensation for certain positions may also include:\n\n‎\n\n‎\n- Stock\n\n‎\n\n‎\n\nMinimum Qualifications...\n\nOutlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications.\n\nOption 1: Bachelor's degree in computer science, computer engineering, computer information systems, software engineering, or related area and 3 years’ experience in software engineering or related area.Option 2: 5 years’ experience in software engineering or related area.\n\nPreferred Qualifications...\n\nOutlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications.\n\nMaster’s degree in Computer Science, Computer Engineering, Computer Information Systems, Software Engineering, or related area and 1 year's experience in software engineering or related area., We value candidates with a background in creating inclusive digital experiences, demonstrating knowledge in implementing Web Content Accessibility Guidelines (WCAG) 2.2 AA standards, assistive technologies, and integrating digital accessibility seamlessly. The ideal candidate would have knowledge of accessibility best practices and join us as we continue to create accessible products and services following Walmart’s accessibility standards and guidelines for supporting an inclusive culture.\n\nPrimary Location...\n\n10790 Parkridge Dr. Suite 200, Reston, VA 20191, United States of America\n\nWalmart and its subsidiaries are committed to maintaining a drug-free workplace and has a no tolerance policy regarding the use of illegal drugs and alcohol on the job. This policy applies to all employees and aims to create a safe and productive work environment.",
      "job_type": "Full-time and Part-time",
      "required_skills": [
        "Python",
        "JavaScript",
        "Java",
        "Go",
        "Rust",
        "React",
        "Angular",
        "Spring",
        "AI",
        "Git",
        "AWS",
        "HTML",
        "CSS"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-12T00:00:00.000Z",
      "url": "https://www.ziprecruiter.com/c/Walmart/Job/Python-Senior-Software-Engineer/-in-Washington,DC?jid=0ae1337c72cef315&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Python developer",
      "source": "JSearch API"
    },
    {
      "id": "DlPgV25Th_tDIOCCAAAAAA==",
      "title": "Python Developer with Java & Testing-5",
      "company": "Realign LLC",
      "location": "McLean, VA",
      "description": "Job Type: Contract\n\nJob Category: IT\n\nJob Title: Python Developer with Java & Testing\nLocation: McLean, VA (Onsite interview required – Face-to-Face)\nJob Type: Full-Time / Contract (specify based on need)\n\nJob Description: We are seeking a skilled and motivated Python Developer with a strong background in Java and software testing to join our team in McLean, VA. The ideal candidate will be responsible for developing robust applications, contributing to backend services, and participating in comprehensive testing efforts to ensure software quality.\n\nKey Responsibilities:\n\nDesign, develop, and maintain applications using Python and Java.\n\nWrite efficient, reusable, and testable code for backend services.\n\nDevelop and execute unit, integration, and functional tests.\n\nCollaborate with cross-functional teams including QA, DevOps, and product managers.\n\nTroubleshoot and resolve issues across development, test, and production environments.\n\nParticipate in code reviews and adhere to best development practices.\n\nContribute to continuous integration and continuous deployment (CI/CD) processes.\n\nRequired Skills\n\nJAVA / API\n\nJAVA ARCHITECT WITH AZURE\n\nJAVA DEVELOPER WITH AWS",
      "job_type": "Contractor",
      "required_skills": [
        "Python",
        "Java",
        "Go",
        "AI",
        "AWS",
        "Azure"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-10T00:00:00.000Z",
      "url": "https://www.indeed.com/viewjob?jk=dffd715be18af849&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Python developer",
      "source": "JSearch API"
    },
    {
      "id": "P2-2vPIvfTV3IVz2AAAAAA==",
      "title": "Python Developer (Full Stack)",
      "company": "Futrend Technology, Inc.",
      "location": "Bethesda, MD",
      "description": "Futrend Technology, Inc. is an innovative business and technology solutions provider. Our primary focus and core competencies are in Healthcare IT, Federal Financial Management, and Grants Management. We excel at providing customers with high-value solutions that support their missions and meet their most critical objectives and business needs. We provide full life-cycle IT services to Federal agencies with recognized excellence in complex real-time system integration and enterprise-wide system implementation.\n\nDescription:\n\nFutrend Technology is looking for a Sr Python Developer to join our team of industry leading professionals with significant upward promotion probability.\n\nRoles and Responsibilities:\n• Migrate legacy applications to python\n• Analyze legacy applications code and Learn the legacy applications’ functionalities\n• Maintain existing applications, and provide support to users\n• Design new applications independently and/or work architect\n• Provide vision for new applications from functionalities, to front end UI design\n• Interact with end users, and Government Lead, managers to understand new application’ requirements and support needs\n• Reverse engineer the legacy application if necessary\n• Use customers’ systems to maintain code\n\nQualifications\nRequired\n• Bachelor’s degree in engineering, Computer Science or a related field\n• 5+ years of engineering experience with a proven track record of building consumer web applications or services\n• Expert in Python (Django) and responsive front-end design (Bootstrap, Foundation, etc.)\n• Experience with version control systems (git) and cloud-based services (AWS, Linode, etc.)\n• Self-motivated and accountable\n• Strong communication skills (verbal and written)\n• Experience with JavaScript, jQuery and Backbone.js\n• Proficiency with databases Oracle, MySQL, SQL Server (MSSQL)\n• High attention to detail to maintain design integrity throughout the build process\n• Excellent communication and problem-solving skills\n• Ability to clearly and professionally interact with clients\n• Unix/Linux experience\n• Knowledge of deployment frameworks\n• Experience with scripting, scheduling jobs etc.\n\nPreferred experience\n• Experience working on Government contracts\n• Skills in Ruby, Perl, and ColdFusion\n• Experience with responsive design\n• Experience with Java\n• Experience with Django CMS or Ruby on Rails\n• Experience with JavaScript frameworks (Grunt, Angular)\n\nLocation: NIH campus in Bethesda MD, Rockville MD\n\nFutrend Technology, Inc. is an Equal Opportunity Employer. All qualified applicants receive consideration for employment without regard to race, religion, color, national origin, gender, sexual orientation, gender identity, age, status as a protected veteran, or status as a qualified individual with a disability.\n\nFutrend Technology, Inc. uses E-Verify to validate all new hires' ability to legally work in the United States\n\nFutrend Technology, Inc. uses E-Verify to validate all new hires' ability to legally work in the United States\n\nFutrend is a VEEVRA Federal Contractor",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "JavaScript",
        "Java",
        "Ruby",
        "Go",
        "Angular",
        "Django",
        "AI",
        "SQL",
        "Git",
        "AWS"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": null,
      "url": "https://www.indeed.com/viewjob?jk=a71d6549ecb4368b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Python developer",
      "source": "JSearch API"
    },
    {
      "id": "LAqXgCOC1oTOSdo6AAAAAA==",
      "title": "Python Backend Engineer",
      "company": "The Oakleaf Group",
      "location": "Washington, DC",
      "description": "The Oakleaf Group is a mortgage and financial services consulting firm with expertise in risk management and financial modeling for the mortgage and banking industries. Our clients are banks and non-bank mortgage firms, government agencies, law firms, insurance companies, institutional asset managers, and hedge funds.\n\nWe differentiate ourselves through our approach to the relationships with our clients. We begin with the belief that each client relationship will be ongoing, spanning multiple projects/engagements. We invest in communication and research to ensure that we fully understand the drivers of every client's short- and long-term success. We align our goals with those of our clients, and we continuously monitor and adjust to ensure that the relationship stays strong.\n\nWe are seeking an experienced Senior Python Engineer with strong software design expertise to join our team. This role goes beyond traditional full-stack development, requiring the ability to integrate multiple Python applications and design robust back-end databases. You will be involved in all phases of the software development lifecycle and play a key role in mentoring junior developers.\n\nKey Responsibilities:\n• Develop clean, efficient, and scalable Python code for back-end applications\n• Design and implement functional requirements and modular software components\n• Architect and build high-performance, low-latency, and highly available applications\n• Design database schemas and integrate multiple component applications into a unified system\n• Write well-tested, maintainable, and readable code following best practices\n• Debug and optimize applications to ensure reliability and performance\n• Collaborate closely with UX/UI designers to translate designs into functional features\n• Integrate front-end elements with server-side logic\n• Participate in code reviews to maintain high code quality and share knowledge across the team\n• Lead software design reviews for junior developers, providing guidance on architecture and best practices\n• Support test automation through thoughtful software design\n\nQualifications:\n• Minimum 5 years of experience as a Backend Engineer or similar role, with a proven track record in designing and implementing complex back-end systems\n• Strong software design skills including modular architecture and back-end database design\n• Proficient in Python and familiar with frameworks such as Flask, Django, or CherryPy\n• Experience with front-end technologies like JavaScript, HTML5, and CSS3 is a plus\n• Master's degree in Computer Science, Engineering, or a related field preferred\n• Experience working in Agile environments (Scrum, Kanban) in fast-paced settings\n• Contributions to open-source projects or active involvement in developer communities is a plus\n• Knowledge of additional back-end languages like Node.js, Java, or Ruby is beneficial\n• Strong understanding of RESTful APIs, microservices architecture, and asynchronous messaging (e.g., RabbitMQ, Kafka)\n• Experience with relational (MySQL, PostgreSQL) and NoSQL databases (MongoDB), including schema design and query optimization\n• Familiarity with cloud platforms (AWS, Azure, Google Cloud) and container technologies (Docker, Kubernetes) is desirable\n• This is a hybrid role requiring to go into the Washington, DC office 3X a week. Candidates in the DMV area are preferred.\n\nPay Range\n$75—$100 USD\n\nCompensation & Benefits\n\nThe Oakleaf Group offers a competitive compensation based on the candidate's skills and experience. Oakleaf offers healthcare benefits to include health, dental, and vision plans as well as other benefits in accordance with applicable Federal or State law.\n\nEqual Employment Opportunity\n\nThe Oakleaf Group is an equal opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture. The Oakleaf Group does not discriminate on the basis of race, ethnicity, religion, sex, color, national origin, age, sexual orientation, gender identify or expression, mental or physical disability, genetic information, veteran status or any other basis prohibited by applicable law.\n\nAccommodations\n\nOakleaf is committed to providing equal employment opportunity to all job seekers. Reasonable accommodations for job seekers with disabilities will be provided. Individuals with a disability that are unable to use our online tools to search and/or apply for jobs should email accomodations@Oakleaf.com, include \"Applicant Accommodation\" in the subject line of the email, and specify the assistance needed in the body of the email. Please note that this mailbox is reserved for job seekers who need to request an accommodation to apply for a job. Emails, for any other reason, will not receive a response.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "JavaScript",
        "Java",
        "Ruby",
        "Go",
        "Node.js",
        "Django",
        "Flask",
        "AI",
        "SQL",
        "Docker",
        "Kubernetes",
        "AWS",
        "Azure",
        "HTML",
        "CSS",
        "MongoDB",
        "PostgreSQL"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-08T00:00:00.000Z",
      "url": "https://www.ziprecruiter.com/c/The-Oakleaf-Group/Job/Python-Backend-Engineer/-in-Washington,DC?jid=ac2c153ef3b3fcdb&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Python developer",
      "source": "JSearch API"
    },
    {
      "id": "Cvs7R7Jm3HmALod7AAAAAA==",
      "title": "Python Developer for Financial Model Risk Management Systems",
      "company": "Intelagile",
      "location": "Washington, DC",
      "description": "JOB INFORMATION\n\nThe project is to develop a Model Risk Management System to use Advanced Analytics and Data Science techniques to establish an efficient, integrated approach to managing risks associated with model development, implementation, and use, better connecting model reviewers with model owners. This position will participate in the full development process for this system with an emphasis on implementation with Python.\n\nKEY JOB FUNCTIONS\n• Play a key role in the requirements generation, analysis, design, implementation, and testing of the Model Risk Management system with Python and other tools necessary.\n• Enhance the delivery of useful information to those who need it to manage model risks\n• Use Advanced Analytics and Data Science techniques to efficiently execute automated information governance tasks.\n\nQUALIFICATIONS\n• Bachelor’s degrees in Computer Science, Engineering, Applied Mathematics, Statistics, Economics, Finance, or a related discipline preferred.\n• Master’s or Ph.D. preferred\n• Strong programming experience, preferably including Open Source languages such as Python and R, and familiarity with tools available in the Amazon Web Services (AWS) environment.\n• Unix/Linux, SQL, and AWS experience preferred.\n• Knowledge of Machine Learning modeling techniques, particularly as applied to Natural Language Processing and content analytics, preferred\n• Experience using graph databases and queries to establish a Knowledge Base and execute intelligent internal search preferred\n\nType: Full-time, Consulting\n\nClient: Fannie Mae or Freddie Mac\n\nLocation: 1100 15th St., N.W., Washington DC 20005\n\nH1B: sponsored\n\nContact: victor@entagile.com\n\nPython Developer for Financial Model Risk Management system",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "Machine Learning",
        "AI",
        "SQL",
        "AWS"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": null,
      "url": "https://www.indeed.com/viewjob?jk=ca3b8c762a628cd0&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Python developer",
      "source": "JSearch API"
    },
    {
      "id": "HRUHx_84jEqcw5fzAAAAAA==",
      "title": "Python Developer – Test Suites",
      "company": "Infomatics Corp",
      "location": "Bethesda, MD",
      "description": "About the Role\n\nWe are seeking a Python Developer with strong experience in building and maintaining automated test suites to join our engineering team in Bethesda, MD. The ideal candidate will work closely with QA engineers, DevOps, and product teams to design robust test frameworks, validate software quality, and ensure seamless releases.\n\nResponsibilities\n• Design, implement, and maintain automated test frameworks and test cases using Python.\n• Develop unit, integration, regression, and system-level tests for web applications, APIs, and backend services.\n• Collaborate with developers and QA engineers to identify test requirements and improve coverage.\n• Integrate test suites into CI/CD pipelines (e.g., Jenkins, GitHub Actions, GitLab CI).\n• Debug test failures, analyze logs, and report detailed findings.\n• Contribute to test strategies and documentation to ensure reliability and scalability.\n• Stay up to date with best practices in test automation and software quality assurance.\n\nQualifications\n\nRequired:\n• Bachelor’s degree in Computer Science, Engineering, or related field (or equivalent experience).\n• Strong proficiency in Python (5+ years).\n• Hands-on experience with pytest, unittest, or Robot Framework.\n• Familiarity with API testing (REST, GraphQL) and tools such as Postman or curl.\n• Experience with CI/CD tools (Jenkins, GitLab, CircleCI, etc.).\n• Knowledge of Git and version control best practices.\n• Strong debugging and problem-solving skills.\n\nPreferred:\n• Experience with Selenium or Playwright for UI testing.\n• Knowledge of Docker, Kubernetes, or cloud platforms (AWS, Azure, GCP).\n• Exposure to performance testing tools (Locust, JMeter).\n• Familiarity with Agile/Scrum methodologies.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "AI",
        "Git",
        "Docker",
        "Kubernetes",
        "AWS",
        "Azure",
        "GCP",
        "GraphQL"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-09-19T00:00:00.000Z",
      "url": "https://www.linkedin.com/jobs/view/python-developer-%E2%80%93-test-suites-at-infomatics-corp-4302773198?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Python developer",
      "source": "JSearch API"
    },
    {
      "id": "i6fqHqt3Yxr4lN6zAAAAAA==",
      "title": "Python Developer",
      "company": "Alasus Technologies",
      "location": "McLean, VA",
      "description": "Responsibilities:\n• Design, build, and maintain scalable backend applications using Python and the Django framework\n• Implement RESTful APIs and integrate third-party services\n• Deploy models and data applications on AWS or similar cloud platforms\n• Work closely with business analysts and data scientists to automate financial workflows and support underwriting and credit modelling\n• Optimize code for performance and scalability; participate in code reviews and collaborative design discussions\n• Work with relational and NoSQL databases (PostgreSQL, Oracle, MongoDB, etc.) and optimize database queries.\n• Support full software development lifecycle: requirement gathering, architecture, development, testing, deployment, and documentation\n• Employ version control (Git), CI/CD pipelines, Containerisation (Jenkins, Docker, Kubernetes) and deployment, and automated testing best practices\n• Troubleshoot and maintain core data pipelines and APIs for loss mitigation, credit models, and financial services applications\n\nQualifications:\n• Bachelor’s or master’s degree in computer science, Engineering, or related quantitative field\n• 6+ years’ experience in professional software development with Python and Django required (preferably in finance, data, or enterprise domains)\n• Deep knowledge of Python libraries (NumPy, Pandas), REST API development, and backend system integration\n• Cloud deployment experience (AWS preferred); Docker, Jenkins, and CI/CD tools highly desired\n• SQL database expertise (PostgreSQL, MySQL) and understanding of data ETL concepts\n• Experience with frontend technologies (Angular, React, JavaScript) is a plus\n• Strong communication skills and ability to work in cross-functional Agile team\n• Commitment to security, privacy, and regulatory standards\n\nKey Skills to Highlight\nTechnical Skills\n• Python programming: Advanced proficiency in software development and scripting\n• Django framework: Building REST APIs, scalable web applications, and modular backend systems\n• Cloud technologies: Experience with AWS or comparable cloud platforms for deployment and scaling\n• Database management: Work with relational and NoSQL databases (PostgreSQL, Oracle, MongoDB, etc.) and optimize database queries.\n• Version control and CI/CD: Git(GitHub Actions, GitLab CI), Jenkins, Docker, Kubernetes for seamless development workflows. Familiarity with containerization (Docker, Kubernetes)\n• Automated testing: Unit, integration, and system testing for reliable code\n• Data analysis libraries: Experience with Pandas, NumPy, and related tools\n\nPreferred :\n• Experience in financial services / mortgage industry or highly regulated environments.\n• Knowledge of asynchronous frameworks (Celery, RabbitMQ, Kafka).\n• Familiarity with front-end frameworks (React, Angular, or Vue.js).\n• Exposure to data engineering or machine learning integration with Python.\n• Understanding of security best practices (OAuth2, JWT, SSL, SAML).\n\nvdY4asiJ5G",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "JavaScript",
        "Java",
        "Go",
        "React",
        "Vue",
        "Angular",
        "Django",
        "Machine Learning",
        "AI",
        "Data Analysis",
        "SQL",
        "Git",
        "Docker",
        "Kubernetes",
        "AWS",
        "REST API",
        "MongoDB",
        "PostgreSQL"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": null,
      "url": "https://www.indeed.com/viewjob?jk=e520db1f0400ba93&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Python developer",
      "source": "JSearch API"
    },
    {
      "id": "voCJvnl-ZL9ecgblAAAAAA==",
      "title": "Data Scientist, Mid level",
      "company": "Planet Technologies",
      "location": "Washington, DC",
      "description": "Planet Technologies, the Nation’s leading Microsoft services provider to the public sector, is looking for a highly motivated individual to join our growing team as  Mid level Data Scientist . In this role, you will be supporting impactful projects that make a difference for our country.\n\nResponsibilities\n• Builds, maintains, and improves dashboards, applications, and automations.\n• Connects to APIs, system-to-system connections, and manual data transfers for ETL.\n• Builds predictive risk models using statistical analysis.\n• Applies AI/ML to extract insights from unstructured documentation.\n• Develops and carries out full-service data calls, including data normalization and visualization.\n• Creates business intelligence analysis and visualizations for management.\n• Improves methodologies and tools for risk assessment.\n• Researches and recommends business data storage/integration solutions.\n• Develops user guides and documentation for BI products.\n• Incorporates data science tools (SQL, R, Python, etc.) into services.\n\nQualifications\n• Strong proficiency with Power Platform, SharePoint, and InfoPath required.\n• Excellent understanding of machine learning techniques and algorithms.\n• Experience with common data science toolkits (R, Weka, NumPy, MATLAB, etc.) and BI tools (Power BI, Anaconda, SPSS).\n• Experience connecting to and manipulating data from federal systems preferred.\n• In absence of years of experience, certifications or past work may be used.\n• Ability to work on site 5 days per week\n• Ability to hold and maintain a Top-Secret level clearance\n• #CJ\n\nPlanet Technologies is the leading provider of Microsoft Consulting Services to public sector and commercial organizations. Planet has significant experience in deploying business intelligence, cloud services, unified communications, and systems management with an emphasis building, deploying, and managing custom solutions that transform the business operations of federal government agencies.\n\nPlanet Technologies does not discriminate in employment opportunities, terms and conditions of employment, or practices. All qualified applicants will receive consideration for employment without regard to race, age, gender, religious or political beliefs, national origin or heritage, disability, sexual orientation, protected veteran status, or any characteristic protected by law. Federal Agency Clearance Requirements may require up to a 10-year background investigation - US Citizenship (clearable) is required.\n\nSalaries for Data Scientist, Mid at Planet Technologies range from $125,000 and $200,000. Several factors will impact final pay offered to a successful candidate including but not limited to the type and years of experience within the job, clearance level, the type of years and experience within the industry, education, training, etc.\n\nVisit  www.go-planet.com  to learn more about us. Details about our benefits can be found here  Planet Technologies Benefit Guide 2025-2026\n\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "Machine Learning",
        "AI",
        "SQL"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-15T00:00:00.000Z",
      "url": "https://www.linkedin.com/jobs/view/data-scientist-mid-level-at-planet-technologies-4312413851?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "sVN7GdaK9dPIWhrtAAAAAA==",
      "title": "Sr. Data Scientist, CRM",
      "company": "General Motors",
      "location": "Washington, DC",
      "description": "This role is categorized as hybrid. This means the successful candidate is expected to report to Warren, MI or Austin, TX three times per week, at minimum [or other frequency dictated by the business if more than 3 days].\n\nThe Role\n\nThe Marketing Applied Sciences team is responsible for developing analytics-driven solutions to help GM Marketing Organizations achieve their business goals. The Senior Data Scientist will work as part of this multi-disciplinary team that will be driving solution design, development, and deployment of analytic models in support of marketing strategies. They are knowledgeable in methodology and practice of marketing analytics with an emphasis on inferential and prescriptive methods. This individual has experience with website, email, and media measurement.\n\nThis person will work closely with teammates in Marketing Applied Sciences and stakeholders in GM’s Marketing organization to ensure objective performance evaluation and optimization of media strategy. This senior data scientist will assist in the research and development of advanced marketing models, drawing insights, and creating scalable products across owned & paid channels. They will be part of a team focused on delivering future-focused, consumer-centric, prescriptive solutions that allow GM to stay proactive and nimble in our exciting transition to EVs\n\nWhat You'll Do\n• Work on a diverse, cross-functional team (technical and non-technical) to help implement high-impact, data-driven solutions to address business challenges in the vehicle brand marketing teams, ensuring that project deliverables fulfill business needs and timing.  \n• Possess contextual business knowledge and functional domain expertise in the advertising and media space as well as familiarity with marketing media measurement techniques including site/clickstream measurement, A/B testing, and various industry measurement media platforms.  \n• Partner with CRM, Marketing, and Data Science teams to design and execute advanced measurement frameworks that evaluate campaign effectiveness, incremental revenue impact, and consumer engagement across lifecycle stages.\n• Apply advanced data-driven modeling techniques to inform decision making and solve complex business problems: preprocessing multisource data; and presenting complex information using data visualization techniques.  \n• Demonstrate an ability for using data, analytics, and insights driving business-impact.  \n• Exhibit a perspective of constrained curiosity, asking why, and suggesting experimentation to drive incremental impact.  \n• Effectively communicate through telling a succinct, data-driven story in any forum, tailoring delivery to a wide range of stakeholder levels from analyst to senior executive.  \n• Apply advanced modeling and analytics techniques to optimize campaign targeting, channel strategy, and customer journey orchestration.\n\nYour Skills & Abilities (Required Qualifications)\n• 5+ years of experience as a data Scientist or in a related role, developing, deploying, and monitoring performance of large analytic data sets and machine learning based models \n• 2+ years of experience working with CRM, marketing analytics, or lifecycle management.\n• Expertise with fundamental statistical concepts and considerations for selecting an appropriate modeling technique. \n• Expertise with statistical concepts and methods for campaign measurement, including uplift/net lift modeling, treatment/control designs, and causal inference.\n• Proficient writing Python/R (modeling) and SQL/Spark (data), working with Pandas, StatsModels, PYMC, TensorFlow, Pytorch, Spark/ML, sklearn, numpy and related packages.  \n• Ability to prioritize and manage multiple tasks and projects at once without sacrificing quality.  \n\nWhat Can Give You a Competitive Advantage (Preferred Qualifications)  \n• Master’s Degree or Ph.D. in Marketing Science, Econometrics, Statistics, Psychometrics, (Bio)Statistics, Applied Mathematics, Operations Research, or another quantitative field. \n• Experience with cloud compute platforms such as Azure with Databricks experience being especially valuable.  \n• Familiarity with advanced methods such as: customer lifetime value, media mix modeling (MMM), multi-touch attribution (MTA), consumer choice  (multinomial logit), time-series forecasting, hierarchical bayes, panel-data methods (fixed/random effects), censored/truncated regressions, selection models, non-random treatment effects, hazard /survival models, structural equation modeling, item response theory, latent class regression. \n• Prior experience with paid, earned, and owned media and/or marketing analytics \n\nCompensation:\n• The expected base compensation for this role is: $130,800 - $211,200. Actual base compensation within the identified range will vary based on factors relevant to the position.\n• Bonus Potential: An incentive pay program offers payouts based on company performance, job level, and individual performance.\n• Benefits : GM offers a variety of health and wellbeing benefit programs. Benefit options include medical, dental, vision, Health Savings Account, Flexible Spending Accounts, retirement savings plan, sickness and accident benefits, life insurance, paid vacation & holidays, tuition assistance programs, employee assistance program, GM vehicle discounts and more.\n\nGM DOES NOT PROVIDE IMMIGRATION-RELATED SPONSORSHIP FOR THIS ROLE. DO NOT APPLY FOR THIS ROLE IF YOU WILL NEED GM IMMIGRATION SPONSORSHIP NOW OR IN THE FUTURE. THIS INCLUDES DIRECT COMPANY SPONSORSHIP, ENTRY OF GM AS THE IMMIGRATION EMPLOYER OF RECORD ON A GOVERNMENT FORM, AND ANY WORK AUTHORIZATION REQUIRING A WRITTEN SUBMISSION OR OTHER IMMIGRATION SUPPORT FROM THE COMPANY (e.g., H-1B, OPT, STEM OPT, CPT, TN, J-1, etc.)\n\n#LI-CC1",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "Machine Learning",
        "AI",
        "SQL",
        "Git",
        "Azure"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-07T00:00:00.000Z",
      "url": "https://search-careers.gm.com/en/jobs/jr-202517474/sr-data-scientist-crm/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "FMbi7Wez3KccbHrXAAAAAA==",
      "title": "Data Scientist SME",
      "company": "Leidos",
      "location": "Alexandria, VA",
      "description": "Description\n\nLeidos National Security Sector combines technology-enabled services and mission software capabilities in the areas of cyber, logistics, security operations, and decision analytics to support our defense and intel customers’ mission to defend against evolving threats around the world. Our team’s focus is to ensure our customers have the right tools, technologies, and tactics to keep pace with an ever-evolving security landscape and succeed in their pursuit to protect people and critical assets.\n\nThe Intelligence Production Solutions Division (IPSD), part of the Decision Advantage Solutions Business Area, is seeking a Data Scientist Subject Matter Expert (SME) for the Chinook program. In this highly specialized role, you will lead complex, mission-critical projects that leverage advanced data science techniques, machine learning, and artificial intelligence to address key intelligence challenges. As a SME, you will apply deep expertise in data science and geospatial analytics to help solve high-stakes problems related to national security, defense, and geospatial intelligence.\n\nThis role requires both a strategic and hands-on approach, providing subject matter leadership and guidance to teams while working closely with National Geospatial-Intelligence Agency (NGA) stakeholders and mission experts. If you are an experienced data scientist with expertise in geospatial intelligence (GEOINT), machine learning, and Artificial Intelligence (AI), we want you to be part of our growing team!\n\nPosition may be performed in the following locations below. Please note Gaithersburg, MD is the primary work location for the program.\n• Gaithersburg, MD\n• Alexandria, VA\n• Chantilly, VA\n• Aurora, CO\n• St. Louis, MO\n\nClearance Level Required:\n\nTop Secret with the ability to obtain SCI, as well as a Polygraph.\n\nPrimary Responsibilities:\n• Serve as the technical SME in data science and geospatial analytics, providing high-level guidance on complex technical problems related to the GEOINT mission.\n• Lead the design and development of sophisticated data science models and machine learning algorithms to analyze large, multi-source geospatial data sets (e.g., satellite imagery, sensor data, geospatial databases).\n• Apply deep knowledge of GEOINT, remote sensing, and spatial analysis to develop and implement solutions that enhance data-driven decision-making capabilities.\n• Provide strategic recommendations for leveraging new and emerging technologies, including machine learning, AI, and cloud platforms, to improve analytical workflows, efficiency, and mission outcomes.\n• Mentor and train junior data scientists and analysts, ensuring the application of best practices in data science and the development of mission-relevant expertise.\n• Work closely with GEOINT analysts, program managers, engineers, and other stakeholders to identify critical requirements, define technical approaches, and ensure that solutions align with mission objectives.\n• Conduct applied research to explore innovative data science techniques and emerging trends (e.g., deep learning, reinforcement learning, advanced geospatial algorithms) that can be applied to solve real-world intelligence problems.\n• Oversee the deployment and operationalization of data science models, ensuring they are scalable, reliable, and deliver actionable insights to GEOINT decision-makers.\n• Maintain high-quality documentation for models, methodologies, and analysis processes to support reproducibility, training, and knowledge transfer.\n\nBasic Qualifications:\n• US citizenship is required per contract.\n• Bachelor’s degree in Data Science, Computer Science, Geospatial Science or related field and 12-15 years of prior relevant experience or Master’s with 10-13 years of prior relevant experience. May possess a Doctorate in technical domain.\n• 10+ years of professional experience in data science.\n• 5+ years of experience with GEOINT or geospatial data analysis.\n• Proven expertise in developing and implementing machine learning and AI models, particularly in context of geospatial or remote sensing.\n• Deep knowledge of geospatial analytics tools (e.g., GIS, ArcGIS), remote sensing techniques, and the application of data science in the IC.\n• Expert proficiency in Python (or similar languages) and experience with data science libraries (TensorFlow, PyTorch, Pandas, NumPy).\n• Strong experience with big data processing tools (e.g., Spark, Hadoop, AWS or Azure cloud platforms).\n• Expertise in working with geospatial data formats (e.g., GeoTIFF, Shapefiles, WMS, WFS) and spatial libraries (e.g., GeoPandas, Rasterio, GDAL).\n• Advance experience in developing and operationalizing AI/ML models and algorithms for geospatial data (e.g., object detection from satellite imagery, spatial clustering, predictive analytics).\n• Strong background in data visualization and reporting tools (e.g., Tableau, PowerBI).\n• Strong leadership, communication, and collaboration skills, with the ability to work directly with senior government officials, analysts, and technical teams.\n• Excellent problem-solving and analytical skills with a demonstrated ability to translate technical challenges into actionable insights.\n\nPreferred Qualifications:\n• Advanced certifications in data science or machine learning.\n• Familiarity with NGA’s mission and specific geospatial intelligence challenges.\n• Expertise in advanced deep learning techniques, particularly in computer vision and image analysis for geospatial applications.\n• Experience with cloud-native applications and distributed computing in a geospatial context.\n• Familiarity with satellite data analysis, and remoting sensing models.\n• Published research or technical papers in geospatial intelligence, machine learning, or data science.\n\n#Chinook\n\nCome break things (in a good way). Then build them smarter.\n\nWe're the tech company everyone calls when things get weird. We don’t wear capes (they’re a safety hazard), but we do solve high-stakes problems with code, caffeine, and a healthy disregard for “how it’s always been done.”\n\nOriginal Posting:\nOctober 9, 2025\n\nFor U.S. Positions: While subject to change based on business needs, Leidos reasonably anticipates that this job requisition will remain open for at least 3 days with an anticipated close date of no earlier than 3 days after the original posting date as listed above.\n\nPay Range:\nPay Range $126,100.00 - $227,950.00\n\nThe Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "Machine Learning",
        "Deep Learning",
        "AI",
        "Data Analysis",
        "AWS",
        "Azure"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-09T00:00:00.000Z",
      "url": "https://careers.leidos.com/jobs/16894311-data-scientist-sme?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "Jwgsmgi5NQ1-zkdQAAAAAA==",
      "title": "Senior Data Scientist - Arlington, VA",
      "company": "Serco North America",
      "location": "Silver Spring, MD",
      "description": "Position Description\n\nAs a Senior Data Scientist, you will support our Maritime Engineering, Technology & Sustainment (METS) Business Unit which is responsible for industry-leading capabilities in naval ship and submarine design, systems and engineering services, and production support, logistics and in-service sustainment.\n\nThis position is contingent upon your ability to obtain/maintain/transfer an active DoD Secret security clearance.\n\nThis position complements Serco’s other engineering capabilities in shipboard, shore and systems installation and upgrade services to the Navy. You will join a team that is responsible for a multitude of various design efforts using software development tools which will include different US Navy Programs and contracts, as well as commercial vessels and systems. In your role, you will be utilizing a variety of different tools and software programs possibly involving disparate databases and software applications. You will also assist in the preparation of reports to describe your analysis and design efforts and being responsible for summarizing results for customers and higher authorities.\n\nThis is an exciting hybrid opportunity to join a highly engaged and collaborative engineering team.\n\nIn this role, you will:\n• Perform ETL (Extract, Transform, Load) operations on multiple data sources and data types across multiple types of databases with various access controls. Data types include text documents, text documents with figures and plots, drawings in different formats, e.g., MS Office (Word, PowerPoint, Excel, Visio) and PDFs (documents, drawings).\n• The documents are related to USN Requirements which are managed in IBM DOORS NextGen.\n• Develop and apply natural language processing (NLP), machine learning, and potentially Large Language Models (LLMs), e.g., GPT, RAG, BERT, to documents and data.\n\nMeet your Recruiter:\n\nQualifications\n\nTo be successful in this role, you will have:\n• A United States citizenship and able to obtain a DoD Secret security clearance.\n• A Bachelor of Science in Data Science or equivalent degree from an accredited university.\n• At least 5 years of industry experience spanning:\n• Extract, Transform, Load (ETL) operations on multiple types of databases and data categories; experience with Sharepoint, MS 365, SQL, and Power Platform.\n• Experience developing and applying natural language processing tools and machine learning tools to find, parse, and extract patterns or targeted data sets.\n• Knowledge of some or all of these Python libraries/frameworks: nltk, spacy, pandas, scikit-learn, seaborn, NumPy, scikit-learn, matplotlib, PyTorch, Stanford Core NLP.\n• To be self-motivated with a strong work initiative and attention to detail.\n• A strong customer service, critical thinking, and problem-solving skills.\n• To be able to work and collaborate with multiple engineering disciplines across multiple disciplines and basic understanding of physical systems technical requirements.\n• To be proficient in programming languages (one of the following): SQL, R, or Python.\n• The ability to work independently, spot opportunities to streamline tasks, and make recommendations.\n• To be skilled at presenting findings to both technical and non-technical audiences.\n• The ability to travel 10%.\n\nAdditional desired experience and skills:\n• Active Secret Clearance.\n• Master’s degree in data science or equivalent from an accredited University.\n• Development and application of APIs including REST across multiple types of databases and data types.\n• Programming Languages: Python, Java, C++.\n• Development of macros in Excel and Word.\n• Ability to create clear and compelling data visualizations using tools like MATLAB, Tableau, Power BI, or Plotly.\n• Develop or use APIs (e.g., REST) across multiple heterogeneous database types and data categories.\n• Experience with data mining and use of Graph databases (e.g.,Neo4j, MarkLogic).\n• Experience with IBM DOORS NextGen and developing scripts for DOORS NextGen/use of DOORS NextGen API and Dassault’s Cameo Systems Modeler.\n• Experience working within an Agile (Kanban, Scrum) environment.\n• Experience with SySML or UML and JavaScript.\n\nIf you are interested in supporting and working with our military and sailors and a passionate Serco team - then submit your application now for immediate consideration. It only takes a few minutes and could change your career!\n\nIn compliance with state and local laws regarding pay transparency, the salary for this role is $97,787.27 to $162,978.79, however, Serco considers several factors when extending an offer, including but not limited to, the role and associated responsibilities, a candidate's work experience, education/training, and key skills.\n\nCompany Overview\n\nSerco Inc. (Serco) is the Americas division of Serco Group, plc. In North America, Serco’s 9,000+ employees strive to make an impact every day across 100+ sites in the areas of Defense, Citizen Services, and Transportation. We help our clients deliver vital services more efficiently while increasing the satisfaction of their end customers. Serco serves every branch of the U.S. military, numerous U.S. Federal civilian agencies, the Intelligence Community, the Canadian government, state, provincial and local governments, and commercial clients. While your place may look a little different depending on your role, we know you will find yours here. Wherever you work and whatever you do, we invite you to discover your place in our world. Serco is a place you can count on and where you can make an impact because every contribution matters.\n\nTo review Serco benefits please visit: https://www.serco.com/na/careers/benefits-of-choosing-serco. If you require an accommodation with the application process please email: careers@serco-na.com or call the HR Service Desk at 800-628-6458, option 1. Please note, due to EEOC/OFCCP compliance, Serco is unable to accept resumes by email.\n\nCandidates may be asked to present proof of identify during the selection process. If requested, this will require presentation of a government-issued I.D. (with photo) with name and address that match the information entered on the application. Serco will not take possession of or retain/store the information provided as proof of identity. For more information on how Serco uses your information, please see our Applicant Privacy Policy and Notice.\n\nSerco does not accept unsolicited resumes through or from search firms or staffing agencies without being a contracted approved vendor. All unsolicited resumes will be considered the property of Serco and will not be obligated to pay a placement or contract fee. If you are interested in becoming an approved vendor at Serco, please email Agencies@serco-na.com.\n\nSerco is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics.\nQualifications:\n\nTo be successful in this role, you will have:\n• A United States citizenship and able to obtain a DoD Secret security clearance.\n• A Bachelor of Science in Data Science or equivalent degree from an accredited university.\n• At least 5 years of industry experience spanning:\n• Extract, Transform, Load (ETL) operations on multiple types of databases and data categories; experience with Sharepoint, MS 365, SQL, and Power Platform.\n• Experience developing and applying natural language processing tools and machine learning tools to find, parse, and extract patterns or targeted data sets.\n• Knowledge of some or all of these Python libraries/frameworks: nltk, spacy, pandas, scikit-learn, seaborn, NumPy, scikit-learn, matplotlib, PyTorch, Stanford Core NLP.\n• To be self-motivated with a strong work initiative and attention to detail.\n• A strong customer service, critical thinking, and problem-solving skills.\n• To be able to work and collaborate with multiple engineering disciplines across multiple disciplines and basic understanding of physical systems technical requirements.\n• To be proficient in programming languages (one of the following): SQL, R, or Python.\n• The ability to work independently, spot opportunities to streamline tasks, and make recommendations.\n• To be skilled at presenting findings to both technical and non-technical audiences.\n• The ability to travel 10%.\n\nAdditional desired experience and skills:\n• Active Secret Clearance.\n• Master’s degree in data science or equivalent from an accredited University.\n• Development and application of APIs including REST across multiple types of databases and data types.\n• Programming Languages: Python, Java, C++.\n• Development of macros in Excel and Word.\n• Ability to create clear and compelling data visualizations using tools like MATLAB, Tableau, Power BI, or Plotly.\n• Develop or use APIs (e.g., REST) across multiple heterogeneous database types and data categories.\n• Experience with data mining and use of Graph databases (e.g.,Neo4j, MarkLogic).\n• Experience with IBM DOORS NextGen and developing scripts for DOORS NextGen/use of DOORS NextGen API and Dassault’s Cameo Systems Modeler.\n• Experience working within an Agile (Kanban, Scrum) environment.\n• Experience with SySML or UML and JavaScript.\n\nIf you are interested in supporting and working with our military and sailors and a passionate Serco team - then submit your application now for immediate consideration. It only takes a few minutes and could change your career!\n\nIn compliance with state and local laws regarding pay transparency, the salary for this role is $97,787.27 to $162,978.79, however, Serco considers several factors when extending an offer, including but not limited to, the role and associated responsibilities, a candidate's work experience, education/training, and key skills.\nEducation:UNAVAILABLEEmployment Type: FULL_TIME",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "JavaScript",
        "Java",
        "C++",
        "Go",
        "Machine Learning",
        "AI",
        "SQL",
        "AWS"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-15T00:00:00.000Z",
      "url": "https://www.ziprecruiter.com/c/Serco-North-America/Job/Senior-Data-Scientist-Arlington,-VA/-in-Silver-Spring,MD?jid=e68187751c77130a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "NsGpTBQXBklMIBYEAAAAAA==",
      "title": "GEOINT Data Scientist (Intelligence Center)",
      "company": "MITRE",
      "location": "McLean, VA",
      "description": "Why choose between doing meaningful work and having a fulfilling life? At MITRE, you can have both. That's because MITRE people are committed to tackling our nation's toughest challenges—and we're committed to the long-term well-being of our employees. MITRE is different from most technology companies. We are a not-for-profit corporation chartered to work for the public interest, with no commercial conflicts to influence what we do. The R&D centers we operate for the government create lasting impact in fields as diverse as cybersecurity, healthcare, aviation, defense, and enterprise transformation. We're making a difference every day—working for a safer, healthier, and more secure nation and world. Our workplace reflects our values. We offer competitive benefits, exceptional professional development opportunities for career growth, and a culture of innovation that embraces adaptability, collaboration, technical excellence, and people in partnership. If this sounds like the choice you want to make, then choose MITRE - and make a difference with us.\n\nMITRE’s Multi-Int Exploitation Mission Enabler department effectively combines the deep technical knowledge required to develop capabilities with critical domain knowledge to harness and shape those capabilities to meet multiple sponsor mission needs. We have the technical depth and breadth to thrive in mission focused R&D/S&T organizations and the well-earned sponsor credibility to execute work programs relating to research, analysis, prototyping, T&E, etc.\n\nWe seek motivated individuals who are interested in applying sensors, data science, AI/ML systems, and data engineering for the exploitation of multiple data types to include remote sensing data. Remote Sensing data refers to those collected using infrared imagery (OPIR), hyperspectral imagery (HSI), radar (SAR/GMTI), full motion video (FMV), Wide Are Motion Imagery (WAMI), and 3D data from a range of sources.\n\nJoin a team that is committed to strong collaboration, intellectual rigor, and prototyping “game-changing” and “tip-of-the-spear” operational solutions for our government sponsors. The ideal candidate will bring a consistent track record of success in delivery of high-impact technical solutions, the integration and application of knowledge and skills in enterprise transformation and related disciplines, proven ability to provide technical and/or project team leadership within challenging customer environments, and passion for contributing to growing technical capabilities in enterprise architecture, innovation, analytics and optimization. The successful candidate will be expected to continue to develop and expand their individual expertise, to lead and/or contribute to fast-paced projects as a member of high-performing multi-disciplinary teams, to provide subject matter expertise, technical mentoring and coaching for less experienced staff, and to lead/contribute to the development, evolution, and application of emerging technical capabilities. As an individual contributor and technical advisor, you will provide senior leaders with advice and an understanding of techniques and effective approaches to enterprise level architecture and design, governance, and supporting technologies.\n\nRoles & Responsibilities:\n• Engage with key decision-makers, government researchers, and mission-focused analysts in the field of GEOINT.\n• Advance analytic tradecraft that integrates and utilizes automated methods.\n• Run experiments comparing state-of-the-art methods with a strong focus on performance when these methods are applied to sponsor driven data and real-world conditions\n• Adapt research done in academia and industry to our sponsors’ uniquely challenging data sources and problem sets\n• Analyzing data, tools, and reports from cutting-edge sensor systems including video, infrared, hyperspectral, radar, and others\n• Brainstorming/problem solving with experienced technical staff to develop solutions for challenging problems and working with leading teams to implement those solutions\n• Work closely with sponsor leadership, data science teams, managed service providers, and mission users to ensure new initiatives align with organizational vision and strategic objectives\n• Collaborate with data analysts, data scientists, and other stakeholders to understand data requirements and deliver solutions to improve performance, reliability, and scalability\n• Review issues and make recommendations for process improvements\n\nBasic Qualifications:\n• Typically requires a minimum of 8 years of related experience with a Bachelor’s degree; or 6 years and a Master’s degree; or a PhD with 3 years’ experience; or equivalent combination of related education and work experience. Prior professional experience in the US Intelligence, Space, or Defense Community\n• Active TS/SCI with poly.\n• Strong program and stakeholder management skills\n• Strong Microsoft Office Skills (Word, Excel, PowerPoint) Proficiency in use of Microsoft Office including Outlook, Excel, and Word\n• Familiarity with Python, R, or MatLab\n• Strong problem-solving skills and capable of working with scientists, analysts, and technical software developers\n• Domain knowledge of remote sensing and ISR, particularly: Radar, SAR, MTI, GMTI, FMV, and WAMI\n• This position has an on-site requirement of 5 days a week on-site.\n\nPreferred Qualifications:\n• Prior professional experience with GEOINT sensors and data sources\n• Prior professional experience with NGA\n• Demonstrated ability to deliver impactful results to customers\n• Understanding of and ability to implement AI/ML solutions to data\n\nPrior experience leading multidisciplinary teams of researchers, analysts, and engineers\n\nThis requisition requires the candidate to have a minimum of the following clearance(s):\n\nTop Secret/SCI/Polygraph\n\nThis requisition requires the hired candidate to have or obtain, within one year from the date of hire, the following clearance(s):\n\nTop Secret/SCI/Polygraph\n\nWork Location Type:\n\nOnsite\n\nCommitment to Non-Discrimination\n\nAll qualified applicants will receive consideration for employment without regard to disability, status as a protected veteran or any other status protected by applicable federal, state, local or international law.\n\nMITRE intends to maintain a website that is fully accessible to all individuals. If you are unable to search or apply for jobs and would like to request a reasonable accommodation for any part of MITRE’s employment process, please email recruitinghelp@mitre.org for general support and collegerecruiting@mitre.org for intern positions. This service is for individuals requiring reasonable accommodation requests. Please note that vendor solicitations will not receive a reply.\n\nBenefits information may be found here.\n\nCopyright © 1997-2025, The MITRE Corporation. All rights reserved. MITRE is a registered trademark of The MITRE Corporation. Material on this site may be copied and distributed with permission only.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "AI"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-16T00:00:00.000Z",
      "url": "https://www.linkedin.com/jobs/view/geoint-data-scientist-intelligence-center-at-mitre-4315374605?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "RVwRCXJtCpPyWt4BAAAAAA==",
      "title": "Data Scientist - Mid level",
      "company": "Nalley Consulting",
      "location": "Washington, DC",
      "description": "Join the Nalley Consulting team as a Data Scientist at DIA Headquarters.\n\nPosition: Data Scientist\n\nLCAT: Mid\n\nLocations: DIAC, Joint Base Anacostia Bolling\n\nShift: No\n\nRequired clearance: Active TS/SCI clearance\nRequired education: Bachelor's degree\n\nBasic Qualifications:\n• Python experience.\n• 3+ years of experience with data exploration, data cleaning, data analysis, data visualization, or data mining\n• 3+ years of experience with analyzing structured and unstructured data sources\n• Experience with statistical and general-purpose programming languages for data analysis\n• Experience with developing predictive data models, quantitative analyses, and visualization of target data sources\n• Experience with leading the development of solutions to complex problems\n• Experience with natural language processing, text mining, or machine learning techniques\n• Experience implementing automation in processing, presenting, or manipulating data\n• Active TS/SCI clearance; willingness to take a polygraph exam\n• Bachelor's degree\n\nAdditional Qualifications / Nice to have:\n• Experience in the development of algorithms leveraging Python and SQL\n• Experience with developing solutions incorporating Large Language Models\n• Experience with Python data science and visualization packages\n• Experience with Excel MBA\n• An active CI polygraph\n\nABOUT NALLEY CONSULTING\n\nNalley Consulting is a Service Disabled Veteran Owned Small Business working with prime partners to staff Department of Defense and Intelligence Community positions. Created by a U.S. Navy intelligence veteran, Nalley Consulting has grown to include multiple IDIQ vehicles in several states.\n\nNalley Consulting fringe benefits include:\n• Excellent medical, dental, and vision benefits\n• PTO\n• 11 paid federal holidays\n• Tuition assistance\n• Paid military-reserve leave\n• Paid parental leave for birth or adoption\n• 401k matching up to 5 percent of the base salary\n• Flex time\n• Company-paid short-term disability, long-term disability, and life insurance.\n\nAvDxIrOOVX",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "Machine Learning",
        "AI",
        "Data Analysis",
        "SQL"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-04T00:00:00.000Z",
      "url": "https://www.indeed.com/viewjob?jk=907a13bcf9a9148a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "Z_jlRNdMNvpMoYITAAAAAA==",
      "title": "Data Scientist Jobs",
      "company": "IO Associates",
      "location": "Washington, VA",
      "description": "A leading AI Analytics startup is looking to hire a Data Scientist to work on their latest AI products. Their cutting-edge platform turns complex data into actionable insights with intuitive AI tools and advanced visualization features, empowering users to make informed decisions effortlessly. Trusted by top defense agencies and Fortune 500 companies, They are expanding rapidly and are looking for a talented Data Scientist to join their dynamic team!\n\nWhat You’ll Do:\n\nDesign, implement, and deliver AI-powered solutions tailored to meet client needs using advanced analytics tools.\n\nCollaborate closely with clients to guide AI solutions from concept to full-scale deployment.\n\nUtilize big data tools and platforms, such as Databricks, to create scalable and efficient AI-driven solutions.\n\nWhat You’ll Bring:\n\nActive TS/SCI security clearance and the ability to work from a SCIF.\n\nBased in Washington DC/Northern Virginia with occasional travel to client sites.\n\nA degree in Computer Science or a related field.\n\n3+ years of hands-on experience with Python coding (pandas, numpy, sklearn, TensorFlow, PyTorch, etc.).\n\nProven experience deploying machine learning models into production environments.\n\nProficiency with SQL/NoSQL databases, version control tools (e.g., Git), Docker, and Kubernetes.\n\nStrong ownership, accountability, and communication skills.\n\nBonus Points For:\n\nExperience leading projects in SCIF environments.\n\nExpertise in Cyber Analytics, PCAP, or network monitoring.\n\nFamiliarity with Spark, Dask, Snowpark, Kafka, or task schedulers like Airflow and Celery.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Rust",
        "Machine Learning",
        "AI",
        "SQL",
        "Git",
        "Docker",
        "Kubernetes"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-16T22:00:00.000Z",
      "url": "https://www.clearancejobs.com/jobs/8337730/data-scientist?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "bfISY5dGsc262mqBAAAAAA==",
      "title": "Data Scientist (Senior)",
      "company": "Spry Methods, Inc",
      "location": "Washington, DC",
      "description": "Who We’re Looking For (Position Overview:)\n\nSpry Methods is seeking a Senior Scientist to support national security initiatives by delivering actionable data-driven insights. You will collaborate directly with investigators and analysts to understand complex data challenges, apply advanced analytical methods, and deliver results that impact critical missions.\n\nWhat Your Day-To-Day Looks Like (Position Responsibilities):\n• * Possesses and applies a comprehensive knowledge across key tasks and high impact assignments.\n• Plans and leads major technology assignments.\n• Evaluates performance results and recommends major changes affecting short-term project growth and success.\n• Functions as a technical expert across multiple project assignments.\n• May supervise others.\n• Collaborate with non-technical, national security investigators and analysts to understand their data science needs, suggest solutions, and complete the work in a timely manner.\n• Lead and/or design machine learning (ML), statistical analysis, and data analysis tasks.\n• Leverage existing and/or conduct custom Extract Transform Load (ETL) work to aggregate data from multiple repositories and condition the data to provide novel insights.\n• Interpret data, identify features and model variables, assess the quality of model outputs, generate alternatives, and conduct remediation.\n• Find and design new approaches to handling, analyzing, and using large volumes of data and/or data sets, and explore fundamental issues with data handling, search, and retention.\n• Design new software code to improve data search processes, and design, test, and validate the quality of data and data processes.\n• Automate routine workflows and data analysis steps to assist with workflow automation.\n• Report results of analyses and provide actionable recommendations.\n\nWhat You Need to Succeed (Minimum Requirements):\n• * TS/SCI Clearance\n• Eight (8) years of relevant experience with a BS in Data Science, Mathematics, Information Science, Statistics, Engineering, Business Analytics, or related degree\n• OR Four (4) years of relevant experience with an MS degree in Data Science, Engineering, Mathematics, or related degree.\n• High proficiency in Python and a deep understanding of data science tools and methodologies.\n• Proven ability to independently lead complex analytical tasks and mentor junior team members.\n\nIdeally, You Also Have (Preferred Qualifications):\n• * Preferred Experience:\n• Experience supporting national security or law enforcement missions.\n• Familiarity with big data platforms and tools (e.g., Hadoop, Spark, Elasticsearch).\n• Knowledge of data governance, security, and data quality standards in secure environments.\n\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Go",
        "Machine Learning",
        "AI",
        "Data Analysis"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": null,
      "url": "https://www.indeed.com/viewjob?jk=44871d20e5094b34&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "IYq7xKbAzfs6MOWOAAAAAA==",
      "title": "Data Scientist   Identity Focus",
      "company": "PlanIT Group, LLC",
      "location": "Falls Church, VA",
      "description": "Data Scientist – Identity Focus\n\nRequirements\n\nData Scientist with Identity focus dedicated to analyzing data related to fraud as a result of identity verification and validation challenges. This individual will support our existing team with the following requirements:\n• 3+ years of experience as a data engineer / data analyst\n• 3+ years architecting and engineering Machine Learning/AI based solutions to large scale enterprise problems solving anomaly detection, entity behavior evaluation and prediction, and data quality improvement\n• Experience with data platforms and analytics tools (specifically Databricks and Zingg)\n• Experience with NoSQL, R, or Python and Spark\n• Experience with advanced data modeling and how to make that data usable for meeting mission requirements (including entity resolution)\n• Experience implementing of Extract, Transform, Load (ETL) technologies\n• Experience in working with highly structured data\n• Experience with data visualization packages\n• Ability to communicate and collaborate with multiple functional groups\n\nSeeking an individual whose qualifications and/or expertise are exceptional and/or highly specialized or unique; and are typically identified as recognized industry leaders: and typically initiates, supervises, and/or develops requirements from a project’s inception to conclusion for complex to extremely complex programs; and provides strategic and expert advice and technical guidance, to program and project staff.\n\nThis individual also provides detailed analysis, evaluation and recommendations for improvements, optimization development, and/or maintenance efforts for client-specific or mission critical challenges/issues; and consults with client to define needs or challenges; while also supervising studies: leading surveys and performing data collection for analyses used to advise and recommend/suggest solutions.\n• A minimum of eight (8) to twelve (12) years’ relevant experience.\n• A degree from an accredited College/University in the applicable field of services is required. If the individual's degree is not in the applicable field then four additional years of related experience is required.\n• Typically performs all functional duties independently.\n• Note: Special credentials (licenses and/or certifications) may be required at the Task Order level on a case-specific basis.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "Machine Learning",
        "AI",
        "SQL"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-15T00:00:00.000Z",
      "url": "https://www.linkedin.com/jobs/view/data-scientist-identity-focus-at-planit-group-llc-4312248017?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "UfBIJfzz7Y_C7l_GAAAAAA==",
      "title": "Data Science Engineer, Professional (AWS)",
      "company": "Freddie Mac",
      "location": "McLean, VA",
      "description": "At Freddie Mac, our mission of Making Home Possible is what motivates us, and it’s at the core of everything we do. Since our charter in 1970, we have made home possible for more than 90 million families across the country. Continue your career journey where your work contributes to a greater purpose.\n\nPosition Overview:\n\nOur team builds and manages the AWS infrastructure that supports Model (ML) development across the company. Our platforms run on Kubernetes and leverage AWS tooling to provide highly scalable and dynamic platform features used by data scientists daily. You will directly drive the results for the team and own components of the platform from design through deployment.\n\nOur Impact:\n\nOur platforms are used across all business lines for Data Science development and deployment work as well as data exploration. This team is highly visible and works directly with emerging AI and ML technologies.\n\nYour Impact:\n\nYou will design, develop and own product solutions from start to finish. On a day-to-day basis you will interact with data scientists to identify issues and new product solutions. You will continually be researching and testing new AI/ML tools and procedures to offer to offer to the wider company.\n\nQualifications:\n• Bachelor’s degree in Computer Science, Engineering (any field), Information Technology Management, or related discipline\n• 2-4 years of progressively responsible experience in a software engineering occupation.\n• 2-4 years of experience working with Java, JavaScript, python, HTML and CSS;\n• 2-4 years of experience working with Cloud Technologies (AWS, Kubernetes, Docker, or similar container technologies);\n• 2-4 years of experience deploying application solutions;\n• 3 years of developing experience with REST APIs;\n• 3 years of experience with code repository GIT and Bitbucket; and,\n• Demonstrated knowledge of software design principles.\n\nKeys to Success in this Role:\n• Demonstrate a strong desire to learn new technologies and tools in the AI/ML space\n• Quickly identify solutions to issues raised by Data Scientists\n• Have a strong understanding of the varies AWS components needed to run AI/ML infrastructure\n• Ability to help junior team members grow their knowledge and abilities\n\nWe consider all applicants for all positions without regard to gender, race, color, religion, national origin, age, marital status, veteran status, sexual orientation, gender identity/expression, physical and mental disability, pregnancy, ethnicity, genetic information or any other protected categories under applicable federal, state or local laws. We will ensure that individuals are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.\n\nFreddie Mac offers a comprehensive total rewards package to include competitive compensation and market-leading benefit programs. Information on these benefit programs is available on our Careers site.\n\nThis position has an annualized market-based salary range of $103,000 - $155,000 and is eligible to participate in the annual incentive program. The final salary offered will generally fall within this range and is dependent on various factors including but not limited to the responsibilities of the position, experience, skill set, internal pay equity and other relevant qualifications of the applicant.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "JavaScript",
        "Java",
        "Go",
        "AI",
        "Git",
        "Docker",
        "Kubernetes",
        "AWS",
        "HTML",
        "CSS",
        "REST API"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-16T23:00:00.000Z",
      "url": "https://careers.freddiemac.com/us/en/job/JR15964/Data-Science-Engineer-Professional-AWS?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Data scientist",
      "source": "JSearch API"
    },
    {
      "id": "9RY5LAu7gHz17tP5AAAAAA==",
      "title": "Front End Developer",
      "company": "Surge IT",
      "location": "Alexandria, VA",
      "description": "Front-end Developer designs, develops, and implements web-based client applications using a variety front-end tools and technologies to support business requirements. Follows approved Agile life cycle methodologies, adheres to modern JavaScript coding standards, and performs related front-end tasks. Resolves technical issues through debugging, research, and investigation. Interfaces with Business Analysis and UI/UX teams.\n\nRequired Skills:\n• Strong experience developing clientside applications using modern JavaScript frameworks like Ember, React, Vue, or Angular\n• Comfort with REST API architectural style and experience developing frontend ORMs to consume backend data\n• Experience with HTML, Handlebars, CSS, SASS, and Bootstrap\n• Extensive experience writing frontend automated tests using common JavaScript testing frameworks like qunit, mocha, jest, etc.\n• Working knowledge of DevOpsrelated tools like Jenkins, Bitbucket, and Git\n• Familiarity with Amazon Bedrock and its integration for AIpowered frontend experiences (e.g., chatbots, content generation, or personalization).\n• Exposure to Amazon Q for accelerating development workflows and improving UI/UX through AIassisted code suggestions.\n• Collaborate closely with backend and AI/ML teams to bring generative AIdriven features to production applications.\n\nPreferred Skills:\n• TypeScript development experience\n• Experience working within a Scaled Agile (SAFe) development environment\n• Experience with Atlassian Suite of tools, including Jira and Confluence\n• Possession of excellent communication and teamwork skills\n• Experience leading teams\n• Technical expert across multiple project assignments",
      "job_type": "Full-time",
      "required_skills": [
        "JavaScript",
        "Java",
        "React",
        "Vue",
        "Angular",
        "AI",
        "Git",
        "HTML",
        "CSS",
        "REST API"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-15T00:00:00.000Z",
      "url": "https://www.linkedin.com/jobs/view/front-end-developer-at-surge-it-4312424573?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Frontend developer",
      "source": "JSearch API"
    },
    {
      "id": "KH0bHT0-rJbElgceAAAAAA==",
      "title": "Front-End Developer",
      "company": "Peraton",
      "location": "College Park, MD",
      "description": "Required Qualifications:\n• Minimum of a BA/BS and 3 years of relevant experience. We may consider candidates with 4 additional years of experience in lieu of a degree, for a total of 7 years of experience.\n• Experience working with HTML/CSS/JavaScript and related front-end technologies in a professional environment.\n• Comfort utilizing frameworks such as Vue.js, React, Angular.js.\n• Must be able to demonstrate a sound understanding of the syntax and semantics of JavaScript/Typescript.\n• Experience utilizing RESTful API web services in front-end development with an understanding of how API’s work within a full-stack environment.\n• Must have a basic understanding of NoSQL/SQL.\n• TS/SCI clearance with a current/active polygraph is required.\n\nDesired Qualifications\n• Familiarity with Python.\n• Demonstrated ability to quickly acquire knowledge of new technologies.\n• Experience with design, development, test, verification, and certification of operational software.\n\n#MDPM\n\nPeraton Labs is seeking a fully cleared Front-End Developer to work collaboratively within our Network Systems team to build compelling and easy to use applications for a multitude of different projects. You will work closely with other team members as well as directly with our DoD/IC customer, in a fast-paced environment, and you will be challenged to utilize and grow your skills to build interfaces for a diverse set of applications. For this role you should be creative, passionate about process improvement, be self-sufficient, and have a desire to continuously learn.\n\nThis position requires full time on-site work out of College Park, MD or Laurel, MD.",
      "job_type": "Full-time",
      "required_skills": [
        "Python",
        "JavaScript",
        "Java",
        "React",
        "Vue",
        "Angular",
        "SQL",
        "HTML",
        "CSS"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-14T00:00:00.000Z",
      "url": "https://www.careers.peraton.com/jobs/front-end-developer-college-park-maryland-153775-jobs--cms-scientific-research-analysis--?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Frontend developer",
      "source": "JSearch API"
    },
    {
      "id": "iyKUD8x3pO5dxlaSAAAAAA==",
      "title": "Staff Software Engineer (Frontend)",
      "company": "Twenty",
      "location": "Washington, DC",
      "description": "Twenty is seeking a Staff Frontend Engineer in its Arlington, VA office to help build the next generation of cyber technologies that protect democracies worldwide. We're looking for someone with 8+ years of experience in developing scalable frontend applications, with deep expertise in React.js, TypeScript, and modern web technologies, plus proven leadership experience mentoring engineers and driving technical initiatives. In this role, you'll architect and develop sophisticated, high-performance user interfaces that visualize complex cyber operation data in real-time, lead frontend technical design decisions, mentor junior engineers, and establish engineering best practices across our UI development. You'll join a world-class product and engineering team that delivers mission-critical solutions for U.S. national security, working in both cloud and on-premises environments to build systems that operate at machine speed. If you're passionate about solving complex technical challenges while leading engineering teams and making a direct impact on national security, we want to talk to you.\n\nAbout The Company\n\nAt Twenty, we're taking on one of the most critical challenges of our time: ensuring democracies prevail in the digital age. We develop revolutionary technologies that operate at the intersection of cyber and electromagnetic domains, where the speed and complexity of operations exceeds human cognition. Our team doesn't just solve problems – we deliver game-changing outcomes that directly improve national security. We're pragmatic optimists who know that while our mission of defending America and its allies is challenging, we can succeed.\n\nRole Details\n\nTechnical Leadership & Architecture\n• Lead the design and architecture of scalable frontend solutions using React and TypeScript that enhance cyber operators' decision-making and response capabilities\n• Evaluate and recommend engineering courses of action for new UI features and frontend system enhancements\n• Drive technical decision-making for complex data visualization challenges and performance optimizations\n• Architect interactive data visualization systems using D3.js, Chart.js, or similar libraries for real-time cyber operation data\n• Lead the implementation of responsive, accessible user interfaces that work across devices and screen sizes\n• Establish frontend architecture patterns and component libraries for consistent, maintainable code\n\nTeam Leadership & Mentorship\n• Mentor and provide technical guidance to junior frontend engineers, conducting thorough code reviews and knowledge transfer\n• Organize frontend development efforts and assign tasks across engineering teams to optimize workflow and delivery\n• Manage project timelines and coordinate cross-functional collaboration with backend, product, design, and operations teams\n• Establish and maintain frontend engineering best practices, coding standards, and development processes\n• Lead technical discussions and facilitate architectural decision-making sessions for UI/UX implementations\n\nDevelopment & Operations\n• Develop high-performance React applications with advanced state management and optimization techniques\n• Implement efficient data models and queries using graph databases to support complex relationship mapping in the UI\n• Create and maintain comprehensive automated testing suites using Jest, React Testing Library, and Cypress\n• Contribute to Go backend services when needed to support full-stack feature development\n• Design and implement CI/CD pipelines for frontend applications that enable rapid, secure deployment\n• Troubleshoot complex performance issues and lead incident response efforts for frontend systems\n• Research and evaluate emerging frontend technologies and frameworks that could enhance our cyber operations capabilities\n\nQualifications\n\nTechnical Skills & Experience\n• 8+ years of professional frontend software development experience\n• Expert-level proficiency in React.js with demonstrated ability to write clean, efficient, and maintainable component architectures\n• Advanced knowledge of modern JavaScript/TypeScript, HTML5, and CSS3\n• Proven experience leading frontend technical projects and mentoring junior developers\n• Expert experience with frontend build tools, bundlers (Webpack, Vite), and modern development workflows\n• Deep knowledge of web accessibility standards (WCAG) and performance optimization techniques\n• Extensive experience with frontend testing frameworks (Jest, React Testing Library, Cypress, Playwright)\n• Experience with graph databases (Neo4j or similar) and understanding of graph query patterns\n• Proficiency with cloud platforms, preferably AWS\n• Strong understanding of UX/UI principles and proven collaboration with design teams\n• Expert understanding of security best practices, secure coding principles, and frontend security patterns\n• Experience with performance profiling, optimization, and scalability engineering for frontend systems\n\nLeadership & Management Skills\n• Demonstrated experience mentoring frontend engineers and leading technical teams\n• Proven ability to organize development workflows and manage project delivery\n• Strong communication skills with ability to explain complex technical concepts to diverse audiences\n• Experience conducting thorough code reviews and establishing frontend development standards\n• Track record of driving technical decision-making and architectural improvements\n\nEducation\n• Bachelor's degree in Computer Science, Software Engineering, or related fields, or equivalent practical experience\n\nSecurity Requirements\n• Must be eligible to obtain a U.S. Government security clearance\n\nDistinguishing Qualifications\n• Track record of delivering complex technical solutions in defense, security, or mission-critical contexts\n• Experience with AI/ML integration in operational systems and visualization of AI outputs\n• Background in developing tools for cyber operators, security analysts, or similar high-stakes environments\n• Previous experience as a frontend technical lead or engineering manager\n• Contributions to open-source projects or technical communities, particularly in React or data visualization\n• Experience with real-time data streaming and visualization in production environments\n• Experience with large-scale data processing and analysis visualization",
      "job_type": "Full-time",
      "required_skills": [
        "JavaScript",
        "Java",
        "Go",
        "React",
        "AI",
        "Git",
        "AWS",
        "HTML",
        "CSS"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-12T00:00:00.000Z",
      "url": "https://www.linkedin.com/jobs/view/staff-software-engineer-frontend-at-twenty-4311059453?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Frontend developer",
      "source": "JSearch API"
    },
    {
      "id": "wTZO7rYfmLJvShVDAAAAAA==",
      "title": "Front End Developer",
      "company": "IMAGINEEER LLC",
      "location": "Arlington, VA",
      "description": "About this Role:\n\nThe Front-End Developer will formulate and define specifications for complex operating software programming applications or modifies/maintains complex existing applications using engineering releases and utilities from the manufacturer. They will be responsible for applications dealing with the overall operating system, such as sophisticated file maintenance routines, large telecommunications networks, computer accounting, and advanced mathematical/scientific software packages.\n\nKey Responsibilities:\n• Producing, maintaining and modifying websites and user interfaces. Incorporating applications, graphics, audio, and video clips into user websites.\n• Designing, coding, testing, debugging, and those programs.\n• Supporting the evaluation of new and existing software products\n• Assisting other systems programmers to effectively utilize the system’s technical software.\n• Designing and developing sophisticated software systems that integrate with hardware components\n• Creating and maintaining system architecture documentation and technical specifications\n• Leading the implementation of software solutions that meet performance, reliability, and security requirements\n• Analyzing and resolving complex system integration issues and technical challenges\n• Collaborating with cross-functional teams including hardware engineers, software developers, and QA specialists\n• Developing test plans and procedures to validate system functionality and performance\n• Performing system analysis to identify bottlenecks and recommending optimization strategies\n• Implementing DevOps practices and continuous integration/continuous deployment pipelines\n• Researching and evaluating new technologies and methodologies for potential adoption\n• Mentoring junior engineers and providing technical guidance to the team\n• Creating detailed technical documentation for system operation and maintenance\n• Participating in design reviews, code reviews, and technical discussions\n• Collaborating with stakeholders to gather requirements and translate them into technical solutions\n• Leading system troubleshooting efforts and providing escalation support\n• Ensuring compliance with industry standards and best practices\n\nQualifications and Skills:\n• Bachelor's degree in Computer Science, Software Engineering, Computer Engineering, or related technical field\n• Minimum of 8 years of professional experience in software systems engineering\n• Demonstrated expertise in system architecture and integration\n• Experience with full system development lifecycle from requirements to deployment\n• Advanced proficiency in JavaScript (ES6+), HTML5, CSS3, and a major framework (React, Angular, Vue.js)\n• Strong experience in formulating specifications, designing, and maintaining complex software applications, especially those with system-level impact\n• In-depth understanding of web accessibility standards (Section 508, WCAG)\n• Experience with RESTful API integration, JSON, AJAX, and responsive/mobile-first design\n• Familiarity with source control (Git) and CI/CD pipelines\n• Knowledge of network protocols and distributed systems\n• Experience with database design and implementation (SQL and NoSQL)\n• Excellent debugging, problem-solving, and performance optimization skills\n• Excellent communication abilities with both technical and non-technical stakeholders\n• Experience with software performance optimization and troubleshooting\n• Knowledge of software testing methodologies and quality assurance\n• Understanding of security principles and secure coding practices\n• Experience with agile development methodologies\n• Ability to work independently and lead technical initiatives\n• Strong documentation skills for complex systems\n\nDesired Skills and Competencies:\n• Master's degree in Computer Science, Engineering, or related field\n• Background in federal, defense, or government contracting environments\n• Familiarity with Learning Management Systems (LMS), especially Moodle.\n• UX/UI research and design system familiarity.\n• Experience with DevOps, automated testing, and Agile methodologies.\n• Knowledge of machine learning integration with software systems\n• Experience with high-availability and fault-tolerant system design\n• Familiarity with regulatory compliance requirements for software systems\n• Experience leading technical teams or mentoring junior engineers\n• Experience with system migration and modernization projects\n• Familiarity with Alaska Native Corporation business environment\n• Experience with simulation and modeling software\n\nAdditional Information:\n\nClearance: Ability to obtain and maintain a Public Trust security clearance.",
      "job_type": "Full-time",
      "required_skills": [
        "JavaScript",
        "Java",
        "Go",
        "Rust",
        "React",
        "Vue",
        "Angular",
        "Machine Learning",
        "AI",
        "SQL",
        "Git",
        "HTML",
        "CSS"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": null,
      "url": "https://www.ziprecruiter.com/c/IMAGINEEER-LLC/Job/Front-End-Developer/-in-Arlington,VA?jid=9cc124bf4253f832&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Frontend developer",
      "source": "JSearch API"
    },
    {
      "id": "0B4WruT7X7tuLKQqAAAAAA==",
      "title": "WEB FRONT END DEVELOPER",
      "company": "Donan Consulting",
      "location": "Washington, DC",
      "description": "THE OVERALL PURPOSE OF POSITION:\n•\nThe purpose of this position is to provide build application and web front-ends based on requirements from Stakeholder Engagement, programs, UX and designers.\n\nSCOPE OF WORK\n\n•\n\nThe position's SCOPE OF WORK include the following:\n•\nSkilled in Front-End development framework and process from UX design to web component delivery.\n\n•\nProficient understanding of client-side scripting and JavaScript frameworks, including jQuery.\n\n•\nSome combination of JavaScript frameworks, such as DurandaJS, Angular, Angular 2, Gulp, Webpack, ReactJS.\n\n•\nSkilled in HTML5, CSS, CSS3, SCSS.\n\n•\nExperience creating accessible forms (using ARIA), with client-side form validation (JavaScript).\n\n•\nExperience with Bootstrap or other similar technologies.\n\n•\nExperience with a collaboration platform and code repository control.\n\n•\nBuild reusable code and libraries for future use.\n\n•\nEnsure the technical feasibility of UI/UX designs.\n\n•\nOptimize application for maximum speed and scalability.\n\n•\nA commitment to Lean principles, including rapid prototyping for user testing.\n\n•\nGood understanding of asynchronous request handling, partial page updates, and AJAX\n\n•\nBaseline understanding of server-side CSS pre-processing platforms, such as LESS and SASS\n\n•\nBaseline understanding of WCAG compliance as it applies to front-end code\n\n•\nWorking understanding of Wordpress and Wordpress templates, as well as baseline understanding of PHP.\n\n•\nBasic knowledge of image authoring tools, to be able to crop, resize, or perform small adjustments on an image. Familiarity with tools such as Gimp or Photoshop is a plus.\n\n•\nProficient understanding of cross-browser compatibility issues and ways to work around them.\n\n•\nGood understanding of SEO principles and ensuring that application will adhere to them.\n\n•\nResponsible for support of critical business functions through the development, implementation, and maintenance of web front ends, including adaptation of COTS products to meet the business requirements.\n\n•\nLead and Contribute web front end expertise to multiple projects and ensure that specifications are met.\n\n•\nDesign, code, test, debug, maintain, and document web front end customizations. Participate in peer-reviews.\n\n•\nFollow established accessibility and W3C standards and procedures. Contribute towards the improvement.\n\n•\nWork as part of Development Teams across enterprise\n\n•\nCoordinate with departments and users in the support of business applications.\n\n•\nExercise judgment to plan and accomplish goals.\n\n•\nRepresent the IT department in terms of front-end development expertise in coordination with other departments.\n\n•\nPerform other duties, as assigned.\n\nQUALIFICATION AND EXPERIENCE:\n•\nEXPERIENCE: - JEE\n\n•\n4-6 Years XML, JavaScript, CSS, HTML, HTML5\n\n•\n2-3 Years Accessibility standards and tools (ARIA)\n\n•\n1-2 Years Web Services, ReactJS, Angular, Angular2, Webpack, Gulp\n\n•\n1-2 Years Bootstrap (or similar platform)\n\n•\n1-2 Years WordPress\n\n•\n4-6 Years Technical Documentation\n\nSPECIAL SKILLS:\n•\nAnalytical and problem-solving skills. Ability to develop solutions to problems\n\n•\nAbility to lead and conduct design reviews, code reviews and technical assessment\n\n•\nDeveloping and/or creating new or more effective ideas, approaches, etc.\n\n•\nDeveloping and formulating short-range plans/decisions\n\n•\nExcellent interpersonal and communication skills",
      "job_type": "Full-time",
      "required_skills": [
        "JavaScript",
        "Java",
        "PHP",
        "Go",
        "React",
        "Angular",
        "AI",
        "HTML",
        "CSS"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": null,
      "url": "https://www.indeed.com/viewjob?jk=24ecab7859338c98&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Frontend developer",
      "source": "JSearch API"
    },
    {
      "id": "MqCa0_0SJ4bldfUuAAAAAA==",
      "title": "Front-End Developer (React, TypeScript)",
      "company": "Serigor Inc.",
      "location": "Columbia, MD",
      "description": "Job Title: Front-End Developer (React, TypeScript)Location: Columbia, MD (Onsite)\nEmployment Type: 12 months (CTH)\nExperience Required: Minimum 3+ years\nAbout the RoleWe are looking for a talented and detail-oriented Front-End Developer with strong experience in React and TypeScript to join our growing development team in Columbia, MD. The ideal candidate will be passionate about building high-performing, scalable, and user-centric web applications.\n\nAs a Front-End Developer, you will collaborate closely with designers, back-end developers, and product managers to deliver seamless and engaging digital experiences.\nKey Responsibilities\n• Develop responsive, interactive, and user-friendly web interfaces using React, TypeScript, HTML5, and CSS3.\n• Translate UI/UX designs and wireframes into high-quality, maintainable front-end code.\n• Work closely with back-end developers to integrate APIs and optimize application performance.\n• Implement front-end architecture and best practices to ensure scalability and maintainability.\n• Participate in code reviews, sprint planning, and team discussions to ensure efficient delivery.\n• Debug and resolve UI/UX issues across various browsers and devices.\n• Stay updated on emerging front-end technologies and advocate for modern tools and techniques.\nRequired Qualifications\n• Bachelor’s degree in Computer Science, Software Engineering, or a related field (or equivalent experience).\n• 3+ years of professional experience in front-end development.\n• Strong proficiency in React.js, TypeScript, JavaScript (ES6+), HTML5, and CSS3/SASS.\n• Experience with state management libraries (Redux, Recoil, Zustand, or Context API).\n• Understanding of RESTful APIs and asynchronous request handling.\n• Proficiency with Git and modern development workflows.\n• Solid grasp of responsive design and cross-browser compatibility.\n• Strong debugging, problem-solving, and communication skills.\n• Experience with Next.js or other React frameworks.\n• Familiarity with UI component libraries (e.g., Material UI, Ant Design, Chakra UI).\n• Understanding of performance optimization techniques for web applications.\n• Exposure to unit testing frameworks (Jest, React Testing Library).\n• Experience working in Agile/Scrum environments.\n• Knowledge of CI/CD pipelines and version control tools (GitHub, Azure DevOps).\n\nPowered by JazzHR\n\nEK7vLsH1Ev",
      "job_type": "Contractor",
      "required_skills": [
        "JavaScript",
        "Java",
        "React",
        "AI",
        "Git",
        "Azure",
        "HTML",
        "CSS"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-16T20:00:00.000Z",
      "url": "https://www.ziprecruiter.com/c/Serigor-Inc./Job/Front-End-Developer-(React,-TypeScript)/-in-Columbia,MD?jid=55426794e40e9aed&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Frontend developer",
      "source": "JSearch API"
    },
    {
      "id": "ED-Dq21JMrQfBbSdAAAAAA==",
      "title": "Front End Software Engineer - Senior Level",
      "company": "Walmart",
      "location": "Washington, DC",
      "description": "Position Summary...\n\nWhat you'll do...\n\nAs a part of Walmart Global Tech, you’ll build industry defining reusable customer and partner facing services and products to lead differentiated experiences and revenue. You will be in the unique position to be of service to both our customers (1P as well as 3P) and our associates as a member of this organization supporting all segments of Walmart. If you are the type of person who feels a personal stake in everything that you work on, has a love for data, enjoys solving complex problems, has a passion for privacy, knows how to foster strong relationships and build trust, and works for the success of the entire team.\n\nAbout Team:\nOur team works closely with our US stores and eCommerce business to better serve customers by empowering team members, stores, and merchants with technological innovation. From groceries and entertainment to sporting goods and crafts, Walmart U.S. offers an extensive selection that our customers value, whether they shop online at Walmart.com, through one of our mobile apps, or in-store. Focus areas include customers, stores and employees, in-store service, merchant tools, merchant data science, and search and personalization.\n\nWhat you'll do:\n• Design, build, and maintain high-performance front-end applications for our 1P and 3P customers.\n• Develop robust, maintainable, reusable code for managing functionality, configuration, deployment, monitoring, performance, scalability, availability, security, and alerting for software test, integration, and production environments.\n• Plan and implement a series of steps which potentially includes reconfiguration, integration, removal, or addition of application components to enhance the application's functionality, resiliency, usability, and security.\n• Understand the Business/Stakeholder/Technical requirements and assist in analyzing the existing solutions to address the needs. Assist in creation of simple, modular, extensible functional design for the product/solution in adherence to the requirements.\n• Assess gaps/ updates/ modifications between the customer/business expectations and the existing product/solutions.\n• Analyze defects from past projects/solutions to avoid recurrence of similar defects.\n• Analyze system performance impacting the complete product for non-functional requirements like reliability, operability, performance efficiency and security. Troubleshoot performance and availability bottlenecks for the application.\n• Develop, maintain, and enhance automated test cases (adopting Shift Left practice) and deployment procedures.\n• Follow coding and design best practices developed by the teams and contribute towards their continuous improvement.\n• Plan Hardware Capacity for high traffic business Events.\n• Design Build and maintain Observability aspects of application.\n• Review Peer Code and help create a culture of continuous improvements on the architecture.\n• Work with relevant stakeholders on launching AB tests for different functionalities getting rolled out.\n\nWhat you'll bring:\n• Experience in creating user interfaces using appropriate and relevant technologies (e.g., HTML 5 coding, CSS (Cascading Style Sheets) libraries like Bootstrap, etc.) using best practices and appropriate design patterns.\n• Relevant front end programming experience in relevant languages and frameworks (e.g., Java, Python, JavaScript, Spring, Node, React, Angular etc.)\n• Experience integrating with scalable back-end services (e.g., REST / graph-QL).\n• Experience in functional, integration and E2E (End 2 End) testing tools and practices.\n• Experience with code repositories and version control practices.\n• Experience with CI/CD pipelines and best practices. Automated deployment experience is a plus.\n• Experience in software quality and operational excellence practices.\n• Experience in agile development methodology.\n• Good analytical and problem-solving skills.\n\nAbout Walmart Global Tech\nImagine working in an environment where one line of code can make life easier for hundreds of millions of people. That’s what we do at Walmart Global Tech. We’re a team of software engineers, data scientists, cybersecurity expert's and service professionals within the world’s leading retailer who make an epic impact and are at the forefront of the next retail disruption. People are why we innovate, and people power our innovations. We are people-led and tech-empowered. We train our team in the skillsets of the future and bring in experts like you to help us grow. We have roles for those chasing their first opportunity as well as those looking for the opportunity that will define their career. Here, you can kickstart an illustrious career in tech, gain new skills and experience for virtually every industry, or leverage your expertise to innovate at scale, impact millions and reimagine the future of retail.\n\nFlexible, hybrid work:\nWe use a hybrid way of working that is primarily in the office coupled with virtual when not onsite. Our campuses serve as a hub to enhance collaboration, bring us together for purpose and deliver on business needs. This approach helps us make quicker decisions, remove location barriers across our global team and be more flexible in our personal lives.\n\n#MPAcceleration\n\nAt Walmart, we offer competitive pay as well as performance-based bonus awards and other great benefits for a happier mind, body, and wallet. Health benefits include medical, vision and dental coverage. Financial benefits include 401(k), stock purchase and company-paid life insurance. Paid time off benefits include PTO (including sick leave), parental leave, family care leave, bereavement, jury duty, and voting. Other benefits include short-term and long-term disability, company discounts, Military Leave Pay, adoption and surrogacy expense reimbursement, and more.\n\n‎\n\n‎\n\n‎\nYou will also receive PTO and/or PPTO that can be used for vacation, sick leave, holidays, or other purposes. The amount you receive depends on your job classification and length of employment. It will meet or exceed the requirements of paid sick leave laws, where applicable.\n\n‎\n\nFor information about PTO, see https://one.walmart.com/notices.\n\n‎\n\n‎\nLive Better U is a Walmart-paid education benefit program for full-time and part-time associates in Walmart and Sam's Club facilities. Programs range from high school completion to bachelor's degrees, including English Language Learning and short-form certificates. Tuition, books, and fees are completely paid for by Walmart.\n\n‎\nEligibility requirements apply to some benefits and may depend on your job classification and length of employment. Benefits are subject to change and may be subject to a specific plan or program terms.\n\n‎\n\nFor information about benefits and eligibility, see One.Walmart.\n\n‎\nThe annual salary range for this position is $108,000.00-$216,000.00\n\n‎\nAdditional compensation includes annual or quarterly performance bonuses.\n\n‎\nAdditional compensation for certain positions may also include:\n\n‎\n\n‎\n- Stock\n\n‎\n\n‎\n\nMinimum Qualifications...\n\nOutlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications.\n\nOption 1: Bachelor's degree in computer science, computer engineering, computer information systems, software engineering, or related area and 3 years’ experience in software engineering or related area.Option 2: 5 years’ experience in software engineering or related area.\n\nPreferred Qualifications...\n\nOutlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications.\n\nMaster’s degree in Computer Science, Computer Engineering, Computer Information Systems, Software Engineering, or related area and 1 year's experience in software engineering or related area., We value candidates with a background in creating inclusive digital experiences, demonstrating knowledge in implementing Web Content Accessibility Guidelines (WCAG) 2.2 AA standards, assistive technologies, and integrating digital accessibility seamlessly. The ideal candidate would have knowledge of accessibility best practices and join us as we continue to create accessible products and services following Walmart’s accessibility standards and guidelines for supporting an inclusive culture.\n\nPrimary Location...\n\n10790 Parkridge Dr. Suite 200, Reston, VA 20191, United States of America\n\nWalmart and its subsidiaries are committed to maintaining a drug-free workplace and has a no tolerance policy regarding the use of illegal drugs and alcohol on the job. This policy applies to all employees and aims to create a safe and productive work environment.",
      "job_type": "Full-time and Part-time",
      "required_skills": [
        "Python",
        "JavaScript",
        "Java",
        "Go",
        "Rust",
        "React",
        "Angular",
        "Spring",
        "AI",
        "Git",
        "AWS",
        "HTML",
        "CSS"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-12T00:00:00.000Z",
      "url": "https://www.ziprecruiter.com/c/Walmart/Job/Front-End-Software-Engineer-Senior-Level/-in-Washington,DC?jid=effdfaa9545a277c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Frontend developer",
      "source": "JSearch API"
    },
    {
      "id": "HkWGXCcRurM4PqthAAAAAA==",
      "title": "Frontend Developer",
      "company": "INSPYR Solutions",
      "location": "Annapolis, MD",
      "description": "Front-End .NET Developer\n\nLocation: Onsite – 5 days/week | Annapolis, MD\n\nLong-term Contract: W2, 12+ months (strong potential for conversion)\n\nWork Authorization: U.S. Citizens only\n\nWe’re hiring a Front-End .NET Developer for a long-term contract focused exclusively on front-end development using Microsoft technologies. This role offers strong stability, a collaborative environment, and a high potential to convert to full-time with a company known for its low turnover and long-term growth opportunities.\n\n✅ Requirements:\n• 5+ years software development experience\n• 3+ years focused on front-end work using Angular + .NET Core\n• Experience with Bootstrap and responsive UI design\n• Strong understanding of how UI connects to business logic (but doesn’t write backend code)\n• Comfortable working fully onsite in Annapolis, MD (onsite interview required)\n• U.S. Citizenship required (W2 only – no C2C or sponsorship)\n\n🛠️Tech Stack:\n• C#, ASP.NET MVC\n• .NET Core / .NET 8\n• Angular 17+ (plus some AngularJS support)\n• JavaScript, Bootstrap",
      "job_type": "Contractor",
      "required_skills": [
        "JavaScript",
        "Java",
        "C#",
        "Angular"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-16T16:00:00.000Z",
      "url": "https://www.linkedin.com/jobs/view/frontend-developer-at-inspyr-solutions-4315857582?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Frontend developer",
      "source": "JSearch API"
    },
    {
      "id": "k1WkJ__OGQK0ICVOAAAAAA==",
      "title": "Senior Front End Developer",
      "company": "Data Society",
      "location": "Washington, DC",
      "description": "About Data Society Group\nAt Data Society Group, we provide the highest quality, leading-edge, industry-tailored data and AI training and solutions for Fortune 1,000 companies and federal, state, and local governmental organizations. We partner with our clients to educate, equip, and empower their workforces with the skills they need to achieve their goals and expand their impact. Data Society Group publishes CDO Magazine, the preeminent global publication for Data Officers. Our executive boards include industry leaders, engineers, and data scientists from across the world. We are empowering the workforces of the future, from data literacy for all employees to support for data engineers and data scientists to train up on the most complex AI solutions and Machine Learning skills.\n\nAbout the Role\nWe're looking for a capable, resourceful Senior UI Developer to be a pivotal individual contributor and a subject matter expert in all things UI and Frontend Development. In this role, you'll leverage your deep expertise in React and JavaScript to build impactful solutions across a variety of initiatives, including:\n• Client-Facing Demos & Prototypes: Quickly craft compelling, interactive experiences that showcase our capabilities and secure new partnerships.\n• External Client Solutions: Develop robust, scalable applications that directly address our clients' unique data and AI challenges.\n• Internal Products & Tools: Build sophisticated platforms and applications that empower our internal teams, streamline operations, and enhance our service delivery.\n\nYou'll collaborate closely with a talented cross-functional team, including UX Designers, Fullstack Developers, Data Scientists, and Project Managers, ensuring seamless integration and exceptional user experiences.\n\nPlease note: This role will be remote though based out of the DMV area for occasional travel to client sites in DC. This role also requires the ability to pass a United States federal government Public Trust background check and is exclusively open to U.S. Citizens.\n\nResponsibilities\nAs a Senior UI Engineer, you'll be instrumental in shaping our user experiences and driving technical excellence. Your responsibilities will include:\n• Architecting and building scalable frontend systems from the ground up, utilizing modern React patterns and best practices.\n• Translating complex UX/UI designs into accessible, high-quality code, ensuring an optimal balance between functionality, aesthetics, and performance, while maintaining WCAG and Section 508 compliance.\n• Leading technical discussions and providing expert guidance on frontend architecture, tooling, and development processes.\n• Collaborating closely with stakeholders (clients, UX, product, data scientists, backend engineers) to gather requirements, define technical specifications, and deliver elegant solutions.\n• Driving continuous improvement by identifying opportunities, recommending new technologies, and advocating for best practices in frontend development.\n• Mentoring and elevating the technical capabilities of the team, sharing knowledge and fostering a culture of high-quality code and innovation.\n• Ensuring the technical integrity and timely delivery of projects, working within a modern development ecosystem (CI/CD, containerization with Docker, Jira, etc.).\n• Adhering to security and quality standards (CMMC, ISO privacy & quality).\n\nQualifications:\n• 7+ years of dedicated experience in frontend development, with a strong focus on building complex data-driven applications.\n• Expert-level proficiency in React and JavaScript, including a deep understanding of the React ecosystem (hooks, state management, component lifecycles, performance optimization).\n• Experience with testing frameworks like Mocha, Jest, or Cypress.\n• Experience with component libraries like Material UI or Chakra.\n• Solid command of HTML5, CSS3, and modern styling techniques (e.g., CSS-in-JS, SASS/LESS, styled-components).\n• Demonstrated experience with responsive design, cross-browser compatibility, and accessibility best practices.\n• Expert knowledge of RESTful APIs and integrating frontend applications with backend services. Familiarity with RTK query or react-query is a plus.\n• Familiarity with modern build tools (e.g., Webpack, Vite) and version control systems (Git).\n• Ability to independently research, learn, and implement new open-source technologies and drive technical innovation.\n• Strong understanding of UX/UI principles and the ability to effectively collaborate with design teams.\n\n0GwDvQCToE",
      "job_type": "Full-time",
      "required_skills": [
        "JavaScript",
        "Java",
        "Go",
        "Rust",
        "React",
        "Machine Learning",
        "AI",
        "Git",
        "Docker",
        "HTML",
        "CSS"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": null,
      "url": "https://www.indeed.com/viewjob?jk=907232bef635aa04&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Frontend developer",
      "source": "JSearch API"
    },
    {
      "id": "lJCCovmrpv2sC6G3AAAAAA==",
      "title": "Front End Developer",
      "company": "Jobs via Dice",
      "location": "Annapolis, MD",
      "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, BGSF Inc., is seeking the following. Apply via Dice today!\n\nFront-End .NET Developer\n\nLocation: Onsite – 5 days/week | Annapolis, MD\n\nLong-term Contract: W2, 12+ months (strong potential for conversion)\n\nWork Authorization: U.S. Citizens only\n\nWe’re hiring a Front-End .NET Developer for a long-term contract focused exclusively on front-end development using Microsoft technologies. This role offers strong stability, a collaborative environment, and a high potential to convert to full-time with a company known for its low turnover and long-term growth opportunities.\n\nRequirements:\n• 5+ years software development experience\n• 3+ years focused on front-end work using Angular + .NET Core\n• Experience with Bootstrap and responsive UI design\n• Strong understanding of how UI connects to business logic (but doesn’t write backend code)\n• Comfortable working fully onsite in Annapolis, MD (onsite interview required)\n• U.S. Citizenship required (W2 only – no C2C or sponsorship)\n\nTech Stack:\n• C#, ASP.NET MVC\n• .NET Core / .NET 8\n• Angular 17+ (plus some AngularJS support)\n• JavaScript, Bootstrap",
      "job_type": "Full-time",
      "required_skills": [
        "JavaScript",
        "Java",
        "C#",
        "Angular"
      ],
      "salary_min": null,
      "salary_max": null,
      "posted_date": "2025-10-16T19:00:00.000Z",
      "url": "https://www.linkedin.com/jobs/view/front-end-developer-at-jobs-via-dice-4313080129?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "search_query": "Frontend developer",
      "source": "JSearch API"
    }
  ],
  "total": 30,
  "scraped_at": "2025-10-17T13:42:04.074980",
  "errors": []
}